readme.org
#+TITLE: Apuntes de Recuperación de Información Web
#+AUTHOR: Eduardo Alcaraz 
#+LANGUAGE: es
#+LaTeX_HEADER: \usepackage[spanish]{inputenc}
#+SETUPFILE: /home/likcos/Materias/Recuperacion/theme-readtheorg-local.setup
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: num:nil
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>


* Instalación de requerimientos

** Verificación de Python
Antes de instalar las dependencias, verifique que el sistema cuente con Python
versión 3.9 o superior.

#+BEGIN_SRC bash
python --version
#+END_SRC

En caso de que el comando anterior no esté disponible, intente:

#+BEGIN_SRC bash
python3 --version
#+END_SRC

** Creación del entorno virtual
Se recomienda crear un entorno virtual para aislar las dependencias del proyecto
y evitar conflictos entre versiones de librerías.

#+BEGIN_SRC bash
python -m venv mlp_env
#+END_SRC

** Activación del entorno virtual

La activación del entorno virtual depende del sistema operativo y del intérprete
de comandos utilizado.

