index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2026-02-16 lun 08:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes de Recuperación de Información Web</title>
<meta name="author" content="Eduardo Alcaraz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes de Recuperación de Información Web</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org73a4e5c">Instalación de requerimientos</a>
<ul>
<li><a href="#org6039f02">Verificación de Python</a></li>
<li><a href="#orgb84198b">Creación del entorno virtual</a></li>
<li><a href="#org78215e2">Activación del entorno virtual</a>
<ul>
<li><a href="#org6725e4b">GNU/Linux y macOS</a></li>
<li><a href="#org063489f">Windows – Símbolo del sistema (CMD)</a></li>
<li><a href="#orgd9829c3">Windows – PowerShell</a></li>
<li><a href="#org1a84208">Windows – Git Bash</a></li>
</ul>
</li>
<li><a href="#org93055bd">Actualización del gestor de paquetes</a></li>
<li><a href="#org7c9b706">Instalación de dependencias</a></li>
<li><a href="#org5fd2f4a">Verificación de la instalación</a></li>
<li><a href="#org4b8ff8e">Desactivación del entorno virtual</a></li>
</ul>
</li>
<li><a href="#orgbefbd28">Manual de Entornos Virtuales en Python</a>
<ul>
<li><a href="#orgfc64cc7">Introducción</a></li>
<li><a href="#orga489384">Flujo de Trabajo Básico</a>
<ul>
<li><a href="#orga982802">1. Creación del entorno</a></li>
<li><a href="#org65d0896">2. Activación</a></li>
</ul>
</li>
<li><a href="#org60f5e22">Gestión de paquetes</a></li>
<li><a href="#orgc9455c3">El archivo de Requerimientos</a></li>
<li><a href="#org941ff62">Exportar dependencias</a></li>
<li><a href="#org2be5b98">Instalar desde el archivo</a></li>
<li><a href="#orga763cbc">Tips de Limpieza</a></li>
<li><a href="#orgbfe2c76">Entornos Virtuales Python (Edición Windows)</a></li>
<li><a href="#orgc54de2e">Requisitos Previos</a></li>
<li><a href="#orgb4739e2">Flujo de Trabajo en Windows</a>
<ul>
<li><a href="#org941348a">1. Crear el Entorno Virtual</a></li>
<li><a href="#orgc9d7fb8">2. El Paso Crítico: La Activación</a></li>
<li><a href="#org41012a5">3. Confirmación</a></li>
</ul>
</li>
<li><a href="#orgd358a29">Gestión de Librerías con PIP</a>
<ul>
<li><a href="#orgf975a26">Instalación de paquetes</a></li>
<li><a href="#orgf3a288f">Congelar dependencias (Compartir proyecto)</a></li>
<li><a href="#orga90c204">Instalar desde un archivo recibido</a></li>
</ul>
</li>
<li><a href="#org950b89c">Uso de Entornos en Emacs (Windows)</a>
<ul>
<li><a href="#orgb1f5808">Instalación del paquete pyvenv</a></li>
<li><a href="#org582a677">Cómo activarlo dentro de Emacs</a></li>
</ul>
</li>
<li><a href="#org59d9bab">Solución de Problemas Comunes en Windows</a></li>
<li><a href="#orgace184a">Desactivación y Limpieza</a></li>
<li><a href="#org626af06">Agregar a jupyter notebook</a></li>
</ul>
</li>
<li><a href="#org4420793">Sistemas de recuperación de información</a>
<ul>
<li><a href="#orgcc2f571">Introducción a los sistemas de recuperación de información (IRS)</a>
<ul>
<li><a href="#org49fee6e">Definición y alcance</a></li>
<li><a href="#org7ab7a51">Objetivo fundamental</a></li>
<li><a href="#org9ef60ea">Componentes típicos de un IRS</a></li>
<li><a href="#org0204a9f">Aplicaciones</a></li>
<li><a href="#orge1d42bc">Ejemplo de flujo completo en un IRS</a></li>
</ul>
</li>
<li><a href="#org2b78447">Interfaces de usuario para búsqueda</a>
<ul>
<li><a href="#org5661838">Funciones de la interfaz</a></li>
<li><a href="#orgf34b55f">Tipos de interfaces</a></li>
<li><a href="#org7b8f046">Elementos de presentación de resultados</a></li>
<li><a href="#orga05d39d">Usabilidad y experiencia de usuario</a></li>
</ul>
</li>
<li><a href="#org46dc413">Modelos de recuperación de información</a>
<ul>
<li><a href="#org23c8119">Modelo booleano</a></li>
<li><a href="#org40ce331">Modelo vectorial</a></li>
<li><a href="#orgbde6efe">TF-IDF (Term Frequency - Inverse Document Frequency)</a></li>
<li><a href="#orgb689208">Modelo probabilístico (BM25, etc.)</a></li>
<li><a href="#org70e93e4">Modelos basados en lenguaje (Language Models)</a></li>
<li><a href="#orgfd6fb13">Resumen comparativo</a></li>
</ul>
</li>
<li><a href="#orga42c6f3">Evaluación de la recuperación</a>
<ul>
<li><a href="#orgb87f0b1">Conjuntos de prueba (test collections)</a></li>
<li><a href="#orgcbde838">Métricas principales</a></li>
<li><a href="#orgfe68574">Evaluación con usuarios</a></li>
<li><a href="#org900e24e">Trade-off precisión vs. recall</a></li>
</ul>
</li>
<li><a href="#orgba83a4b">Referencias</a></li>
</ul>
</li>
<li><a href="#org0126e40">Ejemplos IRS — Recuperación de información con feeds RSS</a>
<ul>
<li><a href="#org46d4d2d">Un buscador introductorio con feeds RSS</a>
<ul>
<li><a href="#orge54b267">Hacks de búsqueda: encontrar páginas y URLs de feeds RSS</a></li>
<li><a href="#org0ce8328">Consultas de ejemplo para probar en el buscador</a></li>
</ul>
</li>
<li><a href="#orga350b1d">Extraer datos de un feed RSS y guardarlos</a></li>
<li><a href="#org5f7b4c3">Limpieza de texto (normalización para el IRS)</a></li>
<li><a href="#org4d34ed7">Modelo booleano: búsqueda por palabras clave</a></li>
<li><a href="#org64d282a">Ranking simple (modelo tipo vectorial)</a></li>
<li><a href="#org160d79c">Interfaz de resultados</a></li>
<li><a href="#orgf432c63">Pipeline completo del IRS con RSS</a>
<ul>
<li><a href="#orga569345">Relación IRS ↔ feeds RSS en el pipeline</a></li>
<li><a href="#org7080eb1">Explicación del código</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org073c9ad">Introducción a XPath</a>
<ul>
<li><a href="#org52961a1">¿Para qué sirve?</a></li>
<li><a href="#org2e98948">Documento de ejemplo</a></li>
<li><a href="#orgb2425a2">Sintaxis básica</a>
<ul>
<li><a href="#org6a51cff">Rutas absolutas y relativas</a></li>
<li><a href="#org5f0b4fb">Seleccionar por etiqueta</a></li>
</ul>
</li>
<li><a href="#orgc7c6c65">Predicados</a>
<ul>
<li><a href="#orgd910339">Por posición</a></li>
<li><a href="#orga329c91">Por atributo</a></li>
<li><a href="#orgf0b4d5c">Por contenido de texto</a></li>
</ul>
</li>
<li><a href="#orga3608f0">Ejes</a>
<ul>
<li><a href="#org1108e1b">Ejes más usados</a></li>
<li><a href="#org7ff436c">Ejemplos con ejes</a></li>
</ul>
</li>
<li><a href="#org8a52c2a">Funciones útiles</a>
<ul>
<li><a href="#orgf0e7bbe">Funciones de texto</a></li>
<li><a href="#orga9a53b7">Funciones numéricas</a></li>
<li><a href="#org879a17f">Funciones de tipo</a></li>
</ul>
</li>
<li><a href="#org35c8ce6">Operadores y combinaciones</a>
<ul>
<li><a href="#org8b68b17">Operadores lógicos</a></li>
<li><a href="#orgc2dc296">Unión de conjuntos (|)</a></li>
<li><a href="#org629ed97">Operadores de comparación</a></li>
</ul>
</li>
<li><a href="#org3cc0918">XPath en HTML (scraping)</a>
<ul>
<li><a href="#org0ea237f">XPath útiles para HTML común</a></li>
</ul>
</li>
<li><a href="#org3bb4f29">XPath en Python (lxml)</a>
<ul>
<li><a href="#org5442fb4">Cargar XML desde archivo</a></li>
<li><a href="#org2a78f5d">Ejecutar XPath</a></li>
<li><a href="#org7618d44">Namespaces (XML con prefijos)</a></li>
</ul>
</li>
<li><a href="#orgc458446">Ejercicios prácticos</a></li>
<li><a href="#org20d1614">Referencia rápida</a></li>
<li><a href="#orgf01aa2a">Dependencias</a></li>
</ul>
</li>
<li><a href="#orgcc5fac5">Ruta Crítica del Web Scraping y Aspectos de Seguridad</a>
<ul>
<li><a href="#orga705615">Introducción</a></li>
<li><a href="#org2ce8f8f">La ruta crítica: fases del proyecto de scraping</a>
<ul>
<li><a href="#org2912190">Diagrama de flujo general</a></li>
</ul>
</li>
<li><a href="#orgf25d1b2">Fase 1: Legalidad y ética (puerta de entrada)</a>
<ul>
<li><a href="#orgb7c86d9">Antes de escribir código</a></li>
<li><a href="#org4a77e56">Ejemplo de robots.txt</a></li>
<li><a href="#org7d379de">Consecuencias de omitir esta fase</a></li>
</ul>
</li>
<li><a href="#org145d99d">Fase 2: Buscar alternativas al scraping</a>
<ul>
<li><a href="#org6af5c87">Jerarquía de preferencia (orden recomendado)</a></li>
<li><a href="#orgacfc424">Antes de scrapear, preguntar</a></li>
<li><a href="#org644e5d6">Motivos para preferir alternativas</a></li>
</ul>
</li>
<li><a href="#org19be25a">Fase 3: Planificación</a>
<ul>
<li><a href="#org31f919f">Definir alcance</a></li>
<li><a href="#org0a85354">Estimar carga al servidor</a></li>
</ul>
</li>
<li><a href="#org5f18131">Fase 4: Análisis técnico</a>
<ul>
<li><a href="#org87c170f">Inspeccionar el sitio</a></li>
<li><a href="#org673d320">Contenido estático vs. dinámico</a></li>
<li><a href="#org5494af4">Mapear la estructura</a></li>
<li><a href="#org3f207b7">Detectando JSON oculto (Network)</a></li>
</ul>
</li>
<li><a href="#orgc01caa6">Fase 5: Desarrollo</a>
<ul>
<li><a href="#orge93870b">Estructura recomendada del código</a></li>
<li><a href="#orgbc6e3f3">Manejo de errores</a></li>
</ul>
</li>
<li><a href="#orgac954e9">Fase 6: Seguridad y robustez</a>
<ul>
<li><a href="#org6afc5df">Seguridad de las peticiones</a></li>
<li><a href="#orge2f0b44">Seguridad de los datos extraídos</a></li>
<li><a href="#org3fac825">Protección del sitio objetivo (ética técnica)</a></li>
<li><a href="#org7425bd7">Proxies y escalado (consideraciones)</a></li>
</ul>
</li>
<li><a href="#orgb4eb86b">Fase 7: Ejecución y mantenimiento</a>
<ul>
<li><a href="#orgbff5b90">Logging</a></li>
<li><a href="#orga0fb04b">Monitoreo básico</a></li>
<li><a href="#org1b82da7">Adaptación a cambios</a></li>
</ul>
</li>
<li><a href="#org4fbb0d3">Checklist de seguridad resumido</a></li>
<li><a href="#org776ddf6">Riesgos y mitigaciones</a></li>
<li><a href="#orgeaca0d6">Referencias</a></li>
</ul>
</li>
<li><a href="#orgb20dc24">Web Scraping con XPath para Blogs Estáticos</a>
<ul>
<li><a href="#org894c641">Introducción</a>
<ul>
<li><a href="#org13ececa">Prerrequisitos</a></li>
</ul>
</li>
<li><a href="#org982936e">Blogs estáticos vs. sitios dinámicos</a>
<ul>
<li><a href="#orgaf0449a">¿Qué es un blog estático?</a></li>
<li><a href="#orgc1be984">¿Por qué son adecuados para scraping?</a></li>
</ul>
</li>
<li><a href="#orgdaa964f">Técnicas de scraping para blogs con XPath</a>
<ul>
<li><a href="#org7d48a8b">Paso 1: Inspeccionar la estructura HTML</a></li>
<li><a href="#org37ca7a9">Paso 2: Obtener el HTML</a></li>
<li><a href="#org4e1b772">Paso 3: Parsear y aplicar XPath</a></li>
<li><a href="#org0198aa7">Paso 4: Extraer todos los artículos de una página</a></li>
<li><a href="#orgb4ed267">Paso 5: Paginación</a></li>
<li><a href="#org1044f95">XPath útiles para blogs (resumen)</a></li>
</ul>
</li>
<li><a href="#orge3dd608">Consideraciones éticas y legales</a>
<ul>
<li><a href="#org024301b">Buenas prácticas</a></li>
<li><a href="#orgbc75119">Cuándo es más aceptable</a></li>
</ul>
</li>
<li><a href="#org9b0bcd5">Por qué NO es adecuado hacer scraping en Amazon (y similares)</a>
<ul>
<li><a href="#orga25f19a">1. Términos de uso y condiciones</a></li>
<li><a href="#orgd2b4f3f">2. Contenido dinámico (JavaScript)</a></li>
<li><a href="#org3bc1bb4">3. Medidas anti-bot</a></li>
<li><a href="#org5548a4b">4. Estructura cambiante</a></li>
<li><a href="#orgc4b27ed">5. Alternativas legales y recomendadas</a></li>
<li><a href="#org45b46e2">Resumen: Amazon vs. blog estático</a></li>
</ul>
</li>
<li><a href="#org96df0af">Ejemplo completo: scraper para un blog estático</a></li>
<li><a href="#orge1e7c5c">Dependencias</a></li>
<li><a href="#orgec10f14">Referencias</a></li>
</ul>
</li>
<li><a href="#org30f7650">Fuentes de Datos Gubernamentales y Abiertos: INEGI, datos.gob.mx y más</a>
<ul>
<li><a href="#org3343434">Introducción</a></li>
<li><a href="#org5833d57">INEGI (México)</a>
<ul>
<li><a href="#orgfd8e9c6">Qué es INEGI</a></li>
<li><a href="#org0f2c8e7">API del Banco de Indicadores</a></li>
<li><a href="#org02ff7ee">API DENUE (Directorio Estadístico Nacional de Unidades Económicas)</a></li>
<li><a href="#org9104bbc">Datos Abiertos INEGI</a></li>
<li><a href="#orgfa51724">Descarga Masiva INEGI</a></li>
<li><a href="#orgb37784c">Librería inegipy (Python)</a></li>
</ul>
</li>
<li><a href="#org3ab981f">datos.gob.mx (Plataforma Nacional de Datos Abiertos)</a>
<ul>
<li><a href="#org84a55c9">Qué es datos.gob.mx</a></li>
<li><a href="#org081e874">API CKAN</a></li>
<li><a href="#org8adee69">Descarga directa de archivos</a></li>
</ul>
</li>
<li><a href="#org9ae1722">Otras fuentes gubernamentales de datos abiertos</a>
<ul>
<li><a href="#orgc047019">México</a></li>
<li><a href="#org126e121">España</a></li>
<li><a href="#org293bcf0">Internacional</a></li>
</ul>
</li>
<li><a href="#orgccbf71a">Cuándo usar cada método</a></li>
<li><a href="#org9e5ee69">Buenas prácticas</a></li>
<li><a href="#orgb776d30">Ejemplo completo: indicador INEGI + guardar CSV</a></li>
<li><a href="#orgaf43fe7">Resumen de enlaces</a></li>
<li><a href="#orga202019">Dependencias</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org73a4e5c" class="outline-2">
<h2 id="org73a4e5c">Instalación de requerimientos</h2>
<div class="outline-text-2" id="text-org73a4e5c">
</div>
<div id="outline-container-org6039f02" class="outline-3">
<h3 id="org6039f02">Verificación de Python</h3>
<div class="outline-text-3" id="text-org6039f02">
<p>
Antes de instalar las dependencias, verifique que el sistema cuente con Python
versión 3.9 o superior.
</p>

<div class="org-src-container">
<pre class="src src-bash">python --version
</pre>
</div>

<p>
En caso de que el comando anterior no esté disponible, intente:
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 --version
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb84198b" class="outline-3">
<h3 id="orgb84198b">Creación del entorno virtual</h3>
<div class="outline-text-3" id="text-orgb84198b">
<p>
Se recomienda crear un entorno virtual para aislar las dependencias del proyecto
y evitar conflictos entre versiones de librerías.
</p>

<div class="org-src-container">
<pre class="src src-bash">python -m venv mlp_env
</pre>
</div>
</div>
</div>
<div id="outline-container-org78215e2" class="outline-3">
<h3 id="org78215e2">Activación del entorno virtual</h3>
<div class="outline-text-3" id="text-org78215e2">
<p>
La activación del entorno virtual depende del sistema operativo y del intérprete
de comandos utilizado.
</p>
</div>
