index.html
<div id="outline-container-org6725e4b" class="outline-4">
<h4 id="org6725e4b">GNU/Linux y macOS</h4>
<div class="outline-text-4" id="text-org6725e4b">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fe8019;">source</span> mlp_env/bin/activate
</pre>
</div>
</div>
</div>
<div id="outline-container-org063489f" class="outline-4">
<h4 id="org063489f">Windows – Símbolo del sistema (CMD)</h4>
<div class="outline-text-4" id="text-org063489f">
<p>
Si se utiliza el <b>Símbolo del sistema</b> (cmd.exe), ejecute:
</p>

<div class="org-src-container">
<pre class="src src-bat">mlp_env\Scripts\activate.bat
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9829c3" class="outline-4">
<h4 id="orgd9829c3">Windows – PowerShell</h4>
<div class="outline-text-4" id="text-orgd9829c3">
<p>
Si se utiliza <b>Windows PowerShell</b>, ejecute:
</p>

<div class="org-src-container">
<pre class="src src-powershell">mlp_env\Scripts\Activate.ps1
</pre>
</div>

<p>
En caso de que la ejecución de scripts esté deshabilitada, habilítela
temporalmente con:
</p>

<div class="org-src-container">
<pre class="src src-powershell">Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope Process
</pre>
</div>

<p>
Posteriormente, vuelva a ejecutar el comando de activación.
</p>
</div>
</div>
<div id="outline-container-org1a84208" class="outline-4">
<h4 id="org1a84208">Windows – Git Bash</h4>
<div class="outline-text-4" id="text-org1a84208">
<p>
Si se utiliza <b>Git Bash</b>, ejecute:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fe8019;">source</span> mlp_env/Scripts/activate
</pre>
</div>

<p>
Una vez activado el entorno virtual, el nombre del entorno aparecerá entre
paréntesis al inicio de la línea de comandos.
</p>
</div>
</div>
</div>
<div id="outline-container-org93055bd" class="outline-3">
<h3 id="org93055bd">Actualización del gestor de paquetes</h3>
<div class="outline-text-3" id="text-org93055bd">
<p>
Antes de instalar las librerías, se recomienda actualizar el gestor de paquetes
<code>pip</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install --upgrade pip
</pre>
</div>
</div>
</div>
<div id="outline-container-org7c9b706" class="outline-3">
<h3 id="org7c9b706">Instalación de dependencias</h3>
<div class="outline-text-3" id="text-org7c9b706">
<p>
Ejecute el siguiente comando para instalar los requerimientos del módulo
Perceptrón Multicapa <b>feedforward</b>.
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install numpy matplotlib scikit-learn feedparser
</pre>
</div>
</div>
</div>
<div id="outline-container-org5fd2f4a" class="outline-3">
<h3 id="org5fd2f4a">Verificación de la instalación</h3>
<div class="outline-text-3" id="text-org5fd2f4a">
<p>
Para verificar que las dependencias se instalaron correctamente, ejecute Python
en modo interactivo:
</p>

<div class="org-src-container">
<pre class="src src-bash">python
</pre>
</div>

<p>
Posteriormente, importe las librerías:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> numpy
<span style="color: #fb4934;">import</span> matplotlib
<span style="color: #fb4934;">import</span> sklearn
<span style="color: #fb4934;">import</span> feedparser
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Instalaci&#243;n de requerimientos completada correctamente"</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4b8ff8e" class="outline-3">
<h3 id="org4b8ff8e">Desactivación del entorno virtual</h3>
<div class="outline-text-3" id="text-org4b8ff8e">
<p>
Una vez finalizado el trabajo, el entorno virtual puede desactivarse con el
siguiente comando:
</p>

<div class="org-src-container">
<pre class="src src-bash">deactivate
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbefbd28" class="outline-2">
<h2 id="orgbefbd28">Manual de Entornos Virtuales en Python</h2>
<div class="outline-text-2" id="text-orgbefbd28">
</div>
<div id="outline-container-orgfc64cc7" class="outline-3">
<h3 id="orgfc64cc7">Introducción</h3>
<div class="outline-text-3" id="text-orgfc64cc7">
<p>
El uso de entornos virtuales es esencial para mantener las
dependencias de tus proyectos aisladas. En este manual aprenderás a
gestionarlos usando el módulo estándar <code>venv</code>.
</p>
</div>
</div>
<div id="outline-container-orga489384" class="outline-3">
<h3 id="orga489384">Flujo de Trabajo Básico</h3>
<div class="outline-text-3" id="text-orga489384">
</div>
<div id="outline-container-orga982802" class="outline-4">
<h4 id="orga982802">1. Creación del entorno</h4>
<div class="outline-text-4" id="text-orga982802">
<p>
Para crear un entorno virtual, navega a la raíz de tu proyecto en la terminal (o dentro de un buffer de Emacs con <code>M-x shell</code>) y ejecuta:
</p>

<div class="org-src-container">
<pre class="src src-bash">python -m venv .venv
</pre>
</div>

<p>
<b>Nota:</b> El nombre <code>.venv</code> es una convención que hace que el directorio sea oculto en sistemas Unix.
</p>
</div>
</div>
<div id="outline-container-org65d0896" class="outline-4">
<h4 id="org65d0896">2. Activación</h4>
<div class="outline-text-4" id="text-org65d0896">
<p>
La activación depende de tu sistema operativo:
</p>
</div>
<ul class="org-ul">
<li><a id="org913780e"></a>En Windows (PowerShell)<br />
<div class="outline-text-5" id="text-org913780e">
<div class="org-src-container">
<pre class="src src-powershell">.\.venv\Scripts\Activate.ps1
</pre>
</div>
</div>
</li>
<li><a id="org56aa824"></a>En macOS / Linux<br />
<div class="outline-text-5" id="text-org56aa824">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #fe8019;">source</span> .venv/bin/activate
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org60f5e22" class="outline-3">
<h3 id="org60f5e22">Gestión de paquetes</h3>
<div class="outline-text-3" id="text-org60f5e22">
<p>
Una vez activado (verás el prefijo <code>(.venv)</code> en tu prompt), puedes instalar librerías:
</p>

<div class="org-src-container">
<pre class="src src-bash">pip install requests pandas
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9455c3" class="outline-3">
<h3 id="orgc9455c3">El archivo de Requerimientos</h3>
<div class="outline-text-3" id="text-orgc9455c3">
<p>
Es fundamental para la reproducibilidad del proyecto.
</p>
</div>
</div>
<div id="outline-container-org941ff62" class="outline-3">
<h3 id="org941ff62">Exportar dependencias</h3>
<div class="outline-text-3" id="text-org941ff62">
<div class="org-src-container">
<pre class="src src-bash">pip freeze &gt; requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org2be5b98" class="outline-3">
<h3 id="org2be5b98">Instalar desde el archivo</h3>
<div class="outline-text-3" id="text-org2be5b98">
<div class="org-src-container">
<pre class="src src-bash">pip install -r requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-orga763cbc" class="outline-3">
<h3 id="orga763cbc">Tips de Limpieza</h3>
<div class="outline-text-3" id="text-orga763cbc">
<p>
Para salir del entorno virtual:
</p>
<div class="org-src-container">
<pre class="src src-bash">deactivate
</pre>
</div>

<p>
Para borrar el entorno, simplemente elimina la carpeta:
</p>
<div class="org-src-container">
<pre class="src src-bash">rm -rf .venv  <span style="color: #928374;"># </span><span style="color: #928374;">En Linux/macOS
</span>rmdir /s /q .venv  <span style="color: #928374;"># </span><span style="color: #928374;">En Windows</span>
</pre>
</div>

<p>
&#x2014;
</p>
<blockquote>
<p>
"Keep your global Python clean, keep your projects isolated."
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgbfe2c76" class="outline-3">
<h3 id="orgbfe2c76">Entornos Virtuales Python (Edición Windows)</h3>
</div>

<div id="outline-container-orgc54de2e" class="outline-3">
<h3 id="orgc54de2e">Requisitos Previos</h3>
<div class="outline-text-3" id="text-orgc54de2e">
<ol class="org-ol">
<li>Tener instalado Python (descargado de <a href="https://www.python.org/">python.org</a> o la Microsoft Store).</li>
<li>Durante la instalación, asegúrate de marcar la casilla: <b><b>"Add Python to PATH"</b></b>.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb4739e2" class="outline-3">
<h3 id="orgb4739e2">Flujo de Trabajo en Windows</h3>
<div class="outline-text-3" id="text-orgb4739e2">
</div>
<div id="outline-container-org941348a" class="outline-4">
<h4 id="org941348a">1. Crear el Entorno Virtual</h4>
<div class="outline-text-4" id="text-org941348a">
<p>
Abre tu terminal (PowerShell o CMD) en la carpeta de tu proyecto. El comando es el mismo para ambos:
</p>

<div class="org-src-container">
<pre class="src src-powershell">python -m venv venv
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9d7fb8" class="outline-4">
<h4 id="orgc9d7fb8">2. El Paso Crítico: La Activación</h4>
<div class="outline-text-4" id="text-orgc9d7fb8">
<p>
En Windows, la activación depende de qué terminal estés usando.
</p>
</div>
<ul class="org-ul">
<li><a id="org5934875"></a>Opción A: PowerShell (Recomendado)<br />
<div class="outline-text-5" id="text-org5934875">
<p>
Si es la primera vez que usas scripts en Windows, podrías recibir un error de seguridad. Primero, ejecuta esto como administrador (solo una vez):
</p>
<div class="org-src-container">
<pre class="src src-powershell">Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser
</pre>
</div>

<p>
Luego, para activar el entorno:
</p>
<div class="org-src-container">
<pre class="src src-powershell">.\venv\Scripts\Activate.ps1
</pre>
</div>
</div>
</li>
<li><a id="org0313159"></a>Opción B: Símbolo del Sistema (CMD)<br />
<div class="outline-text-5" id="text-org0313159">
<div class="org-src-container">
<pre class="src src-cmd">.\venv\Scripts\activate.bat
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org41012a5" class="outline-4">
<h4 id="org41012a5">3. Confirmación</h4>
<div class="outline-text-4" id="text-org41012a5">
<p>
Sabrás que el entorno está activo porque el nombre <code>(venv)</code> aparecerá a la izquierda de la ruta en tu terminal:
#+example
(venv) C:\Proyectos\MiProyecto&gt;
#+example
</p>
</div>
</div>
</div>
<div id="outline-container-orgd358a29" class="outline-3">
<h3 id="orgd358a29">Gestión de Librerías con PIP</h3>
<div class="outline-text-3" id="text-orgd358a29">
</div>
<div id="outline-container-orgf975a26" class="outline-4">
<h4 id="orgf975a26">Instalación de paquetes</h4>
<div class="outline-text-4" id="text-orgf975a26">
<p>
Una vez activo el entorno, instala lo que necesites:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip install pandas requests openpyxl
</pre>
</div>
</div>
</div>
