readme.org
*** Congelar dependencias (Compartir proyecto)
Para que otros participantes tengan exactamente lo mismo que tú:
#+begin_src powershell
pip freeze > requirements.txt
#+end_src

*** Instalar desde un archivo recibido
Si un compañero te pasa su =requirements.txt=:
#+begin_src powershell
pip install -r requirements.txt
#+end_src

** Uso de Entornos en Emacs (Windows)

Para que Emacs en Windows gestione bien el entorno, añade esto a tu archivo de configuración (=init.el= o =.emacs=):

*** Instalación del paquete pyvenv
#+begin_src elisp
(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode 1))
#+end_src

*** Cómo activarlo dentro de Emacs
1. Presiona =M-x pyvenv-activate=.
2. Emacs te pedirá la ruta. Navega hasta la carpeta =venv= de tu proyecto.
3. Al seleccionarla, Emacs usará ese intérprete de Python para todos los scripts que ejecutes.

** Solución de Problemas Comunes en Windows

| Error / Problema | Solución |
| :--- | :--- |
| "python" no se reconoce | Reinstala Python y marca "Add to PATH" o usa el comando `py`. |
| Error de "Execution Policy" | Ejecuta `Set-ExecutionPolicy RemoteSigned -Scope CurrentUser`. |
| No aparece el (venv) | Asegúrate de usar el comando de activación correcto para tu terminal (.ps1 vs .bat). |

** Desactivación y Limpieza
Para salir del entorno:
#+begin_src powershell
deactivate
#+end_src

Si quieres borrar el entorno por completo (para empezar de cero):
#+begin_src powershell
rmdir /s /q venv
#+end_src

---
#+BEGIN_IMPORTANT
*Recordatorio:* Nunca incluyas la carpeta =venv= en tus archivos compartidos o en tu repositorio de Git. Solo comparte el código y el archivo =requirements.txt=.
#+END_IMPORTANT








** Agregar a jupyter notebook

#+BEGIN_SRC shell
pip install ipykernel
python -m ipykernel install --user --name=redes --display-name="redes"
#+END_SRC






* Sistemas de recuperación de información

** Introducción a los sistemas de recuperación de información (IRS)

*** Definición y alcance

Un *Sistema de Recuperación de Información* (IRS, por sus siglas en inglés
*Information Retrieval System*) es un sistema software diseñado para almacenar,
representar y recuperar información relevante ante consultas de usuarios.

**** Características principales
- Almacena grandes volúmenes de documentos (texto, multimedia, metadatos).
- Permite consultas en lenguaje natural o estructurado.
- Devuelve un *ranking* o lista ordenada de documentos según relevancia.
- La relevancia suele ser subjetiva y dependiente del contexto del usuario.

**** Ejemplo de necesidad de información
#+BEGIN_EXAMPLE
Usuario: "Necesito saber cómo se calcula la precisión en un sistema de búsqueda
para poder comparar dos motores que estamos evaluando en mi empresa."

El IRS no busca la frase exacta "cómo se calcula la precisión"; busca documentos
que traten sobre *evaluación*, *precisión*, *sistemas de búsqueda* y los ordena
según qué tan bien satisfacen esa necesidad.
#+END_EXAMPLE

*** Objetivo fundamental

El objetivo no es devolver *todos* los documentos que coincidan literalmente con
la consulta, sino aquellos que el usuario consideraría *útiles* o *relevantes*
para satisfacer su necesidad de información.

**** Diferencia con bases de datos

| Bases de datos          | Recuperación de información        |
|-------------------------+------------------------------------|
| Consultas exactas (SQL) | Consultas por similitud/relevancia |
| Coincidencia exacta     | Ranking y ordenación               |
| Datos estructurados     | Texto libre, documentos            |
| Respuesta determinista  | Respuesta aproximada, probabilista |

*** Componentes típicos de un IRS

1. *Índice* :: Estructura que permite localizar documentos sin escanear todo el corpus.
2. *Motor de búsqueda* :: Algoritmos que comparan consulta vs. documentos.
3. *Modelo de ranking* :: Criterio para ordenar resultados (TF-IDF, BM25, etc.).
4. *Interfaz de usuario* :: Formulario de búsqueda, resultados, filtros.
5. *Módulo de evaluación* :: Métricas para medir calidad (precisión, recall, etc.).

*** Aplicaciones

- Motores de búsqueda web (Google, Bing).
- Búsqueda en bibliotecas digitales y repositorios.
- Búsqueda en correo electrónico y documentos corporativos.
- Sistemas de recomendación y búsqueda semántica.

*** Ejemplo de flujo completo en un IRS

**** Corpus mínimo de ejemplo
Se tienen 3 documentos (para ilustrar; en la realidad son millones):

| ID | Documento |
|----+-----------|
| d1 | "La recuperación de información usa índices para buscar documentos de forma rápida." |
| d2 | "Los modelos vectoriales calculan similitud entre consulta y documento." |
| d3 | "La evaluación mide precisión y recall del sistema de búsqueda." |

**** Paso 1: Indexación
- Se extraen términos (tras eliminar stopwords y aplicar stemming): =recuperación=, =información=, =índices=, =documentos=, =modelos=, =vectoriales=, =similitud=, =consulta=, =evaluación=, =precisión=, =recall=, =búsqueda=.
- Se construye un *índice invertido*: para cada término, lista de documentos que lo contienen.
- Ejemplo: =precisión= \(\rightarrow\) [d3], =documentos= \(\rightarrow\) [d1], =recuperación= \(\rightarrow\) [d1], etc.

**** Paso 2: Consulta
- Usuario escribe: "evaluación precisión búsqueda".

