index.html
<div id="outline-container-orgf3a288f" class="outline-4">
<h4 id="orgf3a288f">Congelar dependencias (Compartir proyecto)</h4>
<div class="outline-text-4" id="text-orgf3a288f">
<p>
Para que otros participantes tengan exactamente lo mismo que tú:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip freeze &gt; requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-orga90c204" class="outline-4">
<h4 id="orga90c204">Instalar desde un archivo recibido</h4>
<div class="outline-text-4" id="text-orga90c204">
<p>
Si un compañero te pasa su <code>requirements.txt</code>:
</p>
<div class="org-src-container">
<pre class="src src-powershell">pip install -r requirements.txt
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org950b89c" class="outline-3">
<h3 id="org950b89c">Uso de Entornos en Emacs (Windows)</h3>
<div class="outline-text-3" id="text-org950b89c">
<p>
Para que Emacs en Windows gestione bien el entorno, añade esto a tu archivo de configuración (<code>init.el</code> o <code>.emacs</code>):
</p>
</div>
<div id="outline-container-orgb1f5808" class="outline-4">
<h4 id="orgb1f5808">Instalación del paquete pyvenv</h4>
<div class="outline-text-4" id="text-orgb1f5808">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #fe8019;">(</span><span style="color: #fb4934;">use-package</span> pyvenv
  <span style="color: #fe8019;">:ensure</span> t
  <span style="color: #fe8019;">:config</span>
  <span style="color: #b16286;">(</span>pyvenv-mode 1<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org582a677" class="outline-4">
<h4 id="org582a677">Cómo activarlo dentro de Emacs</h4>
<div class="outline-text-4" id="text-org582a677">
<ol class="org-ol">
<li>Presiona <code>M-x pyvenv-activate</code>.</li>
<li>Emacs te pedirá la ruta. Navega hasta la carpeta <code>venv</code> de tu proyecto.</li>
<li>Al seleccionarla, Emacs usará ese intérprete de Python para todos los scripts que ejecutes.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org59d9bab" class="outline-3">
<h3 id="org59d9bab">Solución de Problemas Comunes en Windows</h3>
<div class="outline-text-3" id="text-org59d9bab">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Error / Problema</td>
<td class="org-left">Solución</td>
</tr>

<tr>
<td class="org-left">:---</td>
<td class="org-left">:---</td>
</tr>

<tr>
<td class="org-left">"python" no se reconoce</td>
<td class="org-left">Reinstala Python y marca "Add to PATH" o usa el comando `py`.</td>
</tr>

<tr>
<td class="org-left">Error de "Execution Policy"</td>
<td class="org-left">Ejecuta `Set-ExecutionPolicy RemoteSigned -Scope CurrentUser`.</td>
</tr>

<tr>
<td class="org-left">No aparece el (venv)</td>
<td class="org-left">Asegúrate de usar el comando de activación correcto para tu terminal (.ps1 vs .bat).</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgace184a" class="outline-3">
<h3 id="orgace184a">Desactivación y Limpieza</h3>
<div class="outline-text-3" id="text-orgace184a">
<p>
Para salir del entorno:
</p>
<div class="org-src-container">
<pre class="src src-powershell">deactivate
</pre>
</div>

<p>
Si quieres borrar el entorno por completo (para empezar de cero):
</p>
<div class="org-src-container">
<pre class="src src-powershell">rmdir /s /q venv
</pre>
</div>

<p>
&#x2014;
</p>
<div class="IMPORTANT" id="orgeaa8656">
<p>
<b>Recordatorio:</b> Nunca incluyas la carpeta <code>venv</code> en tus archivos compartidos o en tu repositorio de Git. Solo comparte el código y el archivo <code>requirements.txt</code>.
</p>

</div>
</div>
</div>
<div id="outline-container-org626af06" class="outline-3">
<h3 id="org626af06">Agregar a jupyter notebook</h3>
<div class="outline-text-3" id="text-org626af06">
<div class="org-src-container">
<pre class="src src-shell">pip install ipykernel
python -m ipykernel install --user --name=redes --display-name=<span style="color: #b8bb26;">"redes"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4420793" class="outline-2">
<h2 id="org4420793">Sistemas de recuperación de información</h2>
<div class="outline-text-2" id="text-org4420793">
</div>
<div id="outline-container-orgcc2f571" class="outline-3">
<h3 id="orgcc2f571">Introducción a los sistemas de recuperación de información (IRS)</h3>
<div class="outline-text-3" id="text-orgcc2f571">
</div>
<div id="outline-container-org49fee6e" class="outline-4">
<h4 id="org49fee6e">Definición y alcance</h4>
<div class="outline-text-4" id="text-org49fee6e">
<p>
Un <b>Sistema de Recuperación de Información</b> (IRS, por sus siglas en inglés
<b>Information Retrieval System</b>) es un sistema software diseñado para almacenar,
representar y recuperar información relevante ante consultas de usuarios.
</p>
</div>
<ul class="org-ul">
<li><a id="orgf08baf1"></a>Características principales<br />
<div class="outline-text-5" id="text-orgf08baf1">
<ul class="org-ul">
<li>Almacena grandes volúmenes de documentos (texto, multimedia, metadatos).</li>
<li>Permite consultas en lenguaje natural o estructurado.</li>
<li>Devuelve un <b>ranking</b> o lista ordenada de documentos según relevancia.</li>
<li>La relevancia suele ser subjetiva y dependiente del contexto del usuario.</li>
</ul>
</div>
</li>
<li><a id="org83a6683"></a>Ejemplo de necesidad de información<br />
<div class="outline-text-5" id="text-org83a6683">
<pre class="example" id="org26954d3">
Usuario: "Necesito saber cómo se calcula la precisión en un sistema de búsqueda
para poder comparar dos motores que estamos evaluando en mi empresa."

El IRS no busca la frase exacta "cómo se calcula la precisión"; busca documentos
que traten sobre *evaluación*, *precisión*, *sistemas de búsqueda* y los ordena
según qué tan bien satisfacen esa necesidad.
</pre>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7ab7a51" class="outline-4">
<h4 id="org7ab7a51">Objetivo fundamental</h4>
<div class="outline-text-4" id="text-org7ab7a51">
<p>
El objetivo no es devolver <b>todos</b> los documentos que coincidan literalmente con
la consulta, sino aquellos que el usuario consideraría <b>útiles</b> o <b>relevantes</b>
para satisfacer su necesidad de información.
</p>
</div>
<ul class="org-ul">
<li><a id="org73fbc83"></a>Diferencia con bases de datos<br />
<div class="outline-text-5" id="text-org73fbc83">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Bases de datos</th>
<th scope="col" class="org-left">Recuperación de información</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Consultas exactas (SQL)</td>
<td class="org-left">Consultas por similitud/relevancia</td>
</tr>

<tr>
<td class="org-left">Coincidencia exacta</td>
<td class="org-left">Ranking y ordenación</td>
</tr>

<tr>
<td class="org-left">Datos estructurados</td>
<td class="org-left">Texto libre, documentos</td>
</tr>

<tr>
<td class="org-left">Respuesta determinista</td>
<td class="org-left">Respuesta aproximada, probabilista</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9ef60ea" class="outline-4">
<h4 id="org9ef60ea">Componentes típicos de un IRS</h4>
<div class="outline-text-4" id="text-org9ef60ea">
<ol class="org-ol">
<li><b>Índice</b> :: Estructura que permite localizar documentos sin escanear todo el corpus.</li>
<li><b>Motor de búsqueda</b> :: Algoritmos que comparan consulta vs. documentos.</li>
<li><b>Modelo de ranking</b> :: Criterio para ordenar resultados (TF-IDF, BM25, etc.).</li>
<li><b>Interfaz de usuario</b> :: Formulario de búsqueda, resultados, filtros.</li>
<li><b>Módulo de evaluación</b> :: Métricas para medir calidad (precisión, recall, etc.).</li>
</ol>
</div>
</div>
<div id="outline-container-org0204a9f" class="outline-4">
<h4 id="org0204a9f">Aplicaciones</h4>
<div class="outline-text-4" id="text-org0204a9f">
<ul class="org-ul">
<li>Motores de búsqueda web (Google, Bing).</li>
<li>Búsqueda en bibliotecas digitales y repositorios.</li>
<li>Búsqueda en correo electrónico y documentos corporativos.</li>
<li>Sistemas de recomendación y búsqueda semántica.</li>
</ul>
</div>
</div>
<div id="outline-container-orge1d42bc" class="outline-4">
<h4 id="orge1d42bc">Ejemplo de flujo completo en un IRS</h4>
<div class="outline-text-4" id="text-orge1d42bc">
</div>
<ul class="org-ul">
<li><a id="orga99b8b6"></a>Corpus mínimo de ejemplo<br />
<div class="outline-text-5" id="text-orga99b8b6">
<p>
Se tienen 3 documentos (para ilustrar; en la realidad son millones):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ID</th>
<th scope="col" class="org-left">Documento</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">d1</td>
<td class="org-left">"La recuperación de información usa índices para buscar documentos de forma rápida."</td>
</tr>

<tr>
<td class="org-left">d2</td>
<td class="org-left">"Los modelos vectoriales calculan similitud entre consulta y documento."</td>
</tr>

<tr>
<td class="org-left">d3</td>
<td class="org-left">"La evaluación mide precisión y recall del sistema de búsqueda."</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgcca0b36"></a>Paso 1: Indexación<br />
<div class="outline-text-5" id="text-orgcca0b36">
<ul class="org-ul">
<li>Se extraen términos (tras eliminar stopwords y aplicar stemming): <code>recuperación</code>, <code>información</code>, <code>índices</code>, <code>documentos</code>, <code>modelos</code>, <code>vectoriales</code>, <code>similitud</code>, <code>consulta</code>, <code>evaluación</code>, <code>precisión</code>, <code>recall</code>, <code>búsqueda</code>.</li>
<li>Se construye un <b>índice invertido</b>: para cada término, lista de documentos que lo contienen.</li>
<li>Ejemplo: <code>precisión</code> \(\rightarrow\) [d3], <code>documentos</code> \(\rightarrow\) [d1], <code>recuperación</code> \(\rightarrow\) [d1], etc.</li>
</ul>
</div>
</li>
<li><a id="orgeb12f69"></a>Paso 2: Consulta<br />
<div class="outline-text-5" id="text-orgeb12f69">
<ul class="org-ul">
<li>Usuario escribe: "evaluación precisión búsqueda".</li>
</ul>
</div>
</li>
