index.html
<li><a id="orgb370b41"></a>Paso 3: Recuperación y ranking<br />
<div class="outline-text-5" id="text-orgb370b41">
<ul class="org-ul">
<li>El motor obtiene candidatos del índice (p. ej. d3 contiene los tres términos) y aplica el modelo (TF-IDF o BM25) para puntuar cada documento.</li>
<li>Resultado ordenado: d3 (mayor puntuación), y posiblemente d1, d2 si comparten términos.</li>
</ul>
</div>
</li>
<li><a id="orge2725b3"></a>Paso 4: Presentación<br />
<div class="outline-text-5" id="text-orge2725b3">
<ul class="org-ul">
<li>Se muestra al usuario: título/snippet de d3 primero, luego los demás, para que pueda elegir el documento que le resulta relevante.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2b78447" class="outline-3">
<h3 id="org2b78447">Interfaces de usuario para búsqueda</h3>
<div class="outline-text-3" id="text-org2b78447">
</div>
<div id="outline-container-org5661838" class="outline-4">
<h4 id="org5661838">Funciones de la interfaz</h4>
<div class="outline-text-4" id="text-org5661838">
<p>
La interfaz de usuario en un IRS debe permitir:
</p>

<ol class="org-ol">
<li><b>Formular la consulta</b> (caja de búsqueda, operadores, filtros).</li>
<li><b>Ver resultados</b> ordenados y con información suficiente para decidir.</li>
<li><b>Refinar o reformular</b> la consulta (búsqueda iterativa).</li>
<li><b>Acceder al documento</b> completo cuando se considera relevante.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf34b55f" class="outline-4">
<h4 id="orgf34b55f">Tipos de interfaces</h4>
<div class="outline-text-4" id="text-orgf34b55f">
</div>
<ul class="org-ul">
<li><a id="orgbcafdb7"></a>Interfaz de consulta por palabras clave<br />
<div class="outline-text-5" id="text-orgbcafdb7">
<ul class="org-ul">
<li>El usuario escribe términos (palabras clave).</li>
<li>Puede usar operadores: AND, OR, NOT, comillas para frases.</li>
<li>Ejemplo: <code>información AND (recuperación OR búsqueda)</code>.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org94dfd0b"></a>Ejemplos de consultas booleanas<br />
<div class="outline-text-6" id="text-org94dfd0b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Consulta</th>
<th scope="col" class="org-left">Interpretación</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">recuperación información</td>
<td class="org-left">documentos que contengan ambos términos (AND implícito)</td>
</tr>

<tr>
<td class="org-left">"recuperación de información"</td>
<td class="org-left">documentos con la frase exacta</td>
</tr>

<tr>
<td class="org-left">TF-IDF OR BM25</td>
<td class="org-left">documentos que contengan al menos uno de los dos</td>
</tr>

<tr>
<td class="org-left">evaluación NOT recall</td>
<td class="org-left">documentos sobre evaluación pero sin la palabra recall</td>
</tr>

<tr>
<td class="org-left">(precisión OR recall) AND métricas</td>
<td class="org-left">métricas y además precisión o recall</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</li>
<li><a id="org99d8455"></a>Interfaz de lenguaje natural<br />
<div class="outline-text-5" id="text-org99d8455">
<ul class="org-ul">
<li>Consultas en forma de pregunta o frase.</li>
<li>El sistema interpreta la intención (a veces con NLP).</li>
<li>Ejemplo: "¿Cómo se evalúa un sistema de recuperación?"</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orge00a14c"></a>Ejemplo<br />
<div class="outline-text-6" id="text-orge00a14c">
<pre class="example" id="orge27c2c5">
Usuario escribe: "recetas de pastel de chocolate sin gluten"

El sistema puede extraer: términos clave (recetas, pastel, chocolate, gluten),
negación (sin gluten) y devolver documentos que hablen de pastel de chocolate
y que mencionen "sin gluten" o recetas aptas para celíacos, aunque no aparezca
la frase exacta.
</pre>
</div>
</li>
</ul>
</li>
<li><a id="orgee38d70"></a>Interfaz con filtros y facetas<br />
<div class="outline-text-5" id="text-orgee38d70">
<ul class="org-ul">
<li>Filtros por fecha, autor, tipo de documento, idioma.</li>
<li>Facetas: categorías o atributos para restringir resultados.</li>
<li>Muy común en tiendas online y bibliotecas digitales.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org79a84b9"></a>Ejemplo (biblioteca digital)<br />
<div class="outline-text-6" id="text-org79a84b9">
<pre class="example" id="org842aa52">
Búsqueda: "recuperación de información"
Facetas mostradas al lado:
  Tipo de documento: Libro (120), Artículo (85), Tesis (12)
  Año: 2020-2024 (45), 2015-2019 (98), anterior (74)
  Idioma: Español (150), Inglés (67)

El usuario hace clic en "Artículo" y "2020-2024": la lista de resultados se
restringe a artículos de esos años, sin cambiar la consulta textual.
</pre>
</div>
</li>
</ul>
</li>
<li><a id="org1e14dab"></a>Interfaz de búsqueda por ejemplo (Query by Example)<br />
<div class="outline-text-5" id="text-org1e14dab">
<ul class="org-ul">
<li>El usuario proporciona un documento o fragmento como "ejemplo" de lo que busca.</li>
<li>El sistema busca documentos similares (búsqueda por similitud).</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org0e7efba"></a>Ejemplo<br />
<div class="outline-text-6" id="text-org0e7efba">
<pre class="example" id="org4e72ac1">
Usuario pega un párrafo de un artículo que le gustó:
"El modelo vectorial representa documentos como vectores en un espacio de términos.
La similitud coseno mide el ángulo entre el vector de la consulta y el del documento."

El sistema trata ese texto como una "consulta larga" o como documento de referencia,
calcula su vector (o embedding) y busca en el corpus los documentos más similares,
devolviendo por ejemplo artículos sobre modelos vectoriales, TF-IDF y similitud coseno.
</pre>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org7b8f046" class="outline-4">
<h4 id="org7b8f046">Elementos de presentación de resultados</h4>
<div class="outline-text-4" id="text-org7b8f046">
</div>
<ul class="org-ul">
<li><a id="org7fa052a"></a>Lista de resultados (SERP)<br />
<div class="outline-text-5" id="text-org7fa052a">
<ul class="org-ul">
<li>Título, URL, snippet o fragmento del documento.</li>
<li>Destacados (bold) de los términos de la consulta.</li>
<li>Paginación o scroll infinito.</li>
</ul>
</div>
</li>
<li><a id="org52b1406"></a>Snippets<br />
<div class="outline-text-5" id="text-org52b1406">
<ul class="org-ul">
<li>Fragmentos cortos del documento donde aparecen los términos.</li>
<li>Ayudan al usuario a juzgar relevancia sin abrir el documento.</li>
</ul>
</div>
</li>
<li><a id="org712cffa"></a>Agrupación y clustering<br />
<div class="outline-text-5" id="text-org712cffa">
<ul class="org-ul">
<li>Resultados agrupados por sitio, fecha o tema.</li>
<li>Reduce redundancia y facilita la exploración.</li>
</ul>
</div>
</li>
<li><a id="org6aab225"></a>Ejemplo de SERP (página de resultados)<br />
<div class="outline-text-5" id="text-org6aab225">
<pre class="example" id="org0300cde">
Consulta: "evaluación recuperación información"

--- Resultado 1 ---
Título: Evaluación de sistemas de recuperación de información - Wikipedia
URL: https://es.wikipedia.org/wiki/...
Snippet: ... La evaluación de la recuperación de información utiliza métricas como
precisión, recall y F1. Se usan colecciones de prueba con juicios de relevancia ...

--- Resultado 2 ---
Título: Precisión y exhaustividad - Recuperación de información
URL: https://...
Snippet: ... Para evaluar un sistema de recuperación se definen la precisión (P) y
la exhaustividad (recall R). La precisión mide cuántos de los recuperados son
relevantes ...

--- Resultado 3 ---
...
</pre>
<p>
Los términos "evaluación", "recuperación", "información" aparecerían resaltados
en negrita en título y snippet para que el usuario juzgue la relevancia de un vistazo.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga05d39d" class="outline-4">
<h4 id="orga05d39d">Usabilidad y experiencia de usuario</h4>
<div class="outline-text-4" id="text-orga05d39d">
<ul class="org-ul">
<li><b>Tiempo de respuesta</b>: resultados en milisegundos.</li>
<li><b>Claridad</b>: que el usuario entienda por qué aparece cada resultado.</li>
<li><b>Opciones de refinamiento</b>: sugerencias, "personas también buscaron", filtros.</li>
<li><b>Accesibilidad</b>: uso con teclado, lectores de pantalla, diseño responsive.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org46dc413" class="outline-3">
<h3 id="org46dc413">Modelos de recuperación de información</h3>
<div class="outline-text-3" id="text-org46dc413">
<p>
Un <b>modelo de recuperación</b> define cómo se representan documentos y consultas, y
cómo se calcula la relevancia o similitud entre ellos.
</p>
</div>
<div id="outline-container-org23c8119" class="outline-4">
<h4 id="org23c8119">Modelo booleano</h4>
<div class="outline-text-4" id="text-org23c8119">
</div>
<ul class="org-ul">
<li><a id="org88532e1"></a>Idea<br />
<div class="outline-text-5" id="text-org88532e1">
<ul class="org-ul">
<li>Documentos y consultas como conjuntos de términos.</li>
<li>La consulta es una expresión booleana (AND, OR, NOT).</li>
<li>Un documento es "relevante" si satisface la expresión (verdadero/falso).</li>
</ul>
</div>
</li>
<li><a id="org321b61f"></a>Limitaciones<br />
<div class="outline-text-5" id="text-org321b61f">
<ul class="org-ul">
<li>No hay ranking: todos los documentos que coinciden son iguales.</li>
<li>No captura importancia de términos (frecuencia, rareza).</li>
<li>Demasiado rígido para el usuario promedio.</li>
</ul>
</div>
</li>
