index.html
<li><a id="org153131f"></a>Ejemplo numérico (modelo booleano)<br />
<div class="outline-text-5" id="text-org153131f">
<p>
Corpus de 4 documentos (términos tras stemming):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Doc</th>
<th scope="col" class="org-left">Términos presentes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">d1</td>
<td class="org-left">recuperación, información, índice, documento</td>
</tr>

<tr>
<td class="org-left">d2</td>
<td class="org-left">modelo, vectorial, similitud, documento</td>
</tr>

<tr>
<td class="org-left">d3</td>
<td class="org-left">evaluación, precisión, recall, búsqueda</td>
</tr>

<tr>
<td class="org-left">d4</td>
<td class="org-left">evaluación, información, índice</td>
</tr>
</tbody>
</table>

<p>
Consultas y resultados:
</p>
<ul class="org-ul">
<li>\(q_1\) = <code>recuperación AND información</code> \(\Rightarrow\) {d1} (solo d1 tiene ambos).</li>
<li>\(q_2\) = <code>evaluación OR precisión</code> \(\Rightarrow\) {d3, d4} (d3 tiene ambos; d4 tiene evaluación).</li>
<li>\(q_3\) = <code>documento NOT vectorial</code> \(\Rightarrow\) {d1} (d1 y d2 tienen "documento"; d2 tiene "vectorial", se excluye; d1 no tiene "vectorial", se incluye).</li>
</ul>

<p>
Todos los documentos devueltos se consideran "iguales"; no hay orden de preferencia.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org40ce331" class="outline-4">
<h4 id="org40ce331">Modelo vectorial</h4>
<div class="outline-text-4" id="text-org40ce331">
</div>
<ul class="org-ul">
<li><a id="org247e3b7"></a>Idea<br />
<div class="outline-text-5" id="text-org247e3b7">
<ul class="org-ul">
<li>Documentos y consultas como vectores en un espacio donde cada dimensión es un término.</li>
<li>Cada componente del vector es un peso (p. ej. TF-IDF).</li>
<li>Similitud = similitud coseno entre vector de consulta y vector del documento.</li>
</ul>
</div>
</li>
<li><a id="org7c66111"></a>Fórmula de similitud coseno<br />
<div class="outline-text-5" id="text-org7c66111">
<p>
\[
\text{sim}(q, d) = \frac{\vec{q} \cdot \vec{d}}{|\vec{q}| \, |\vec{d}|}
\]
</p>
</div>
</li>
<li><a id="org97c406b"></a>Ventajas<br />
<div class="outline-text-5" id="text-org97c406b">
<ul class="org-ul">
<li>Permite ranking (ordenar por similitud).</li>
<li>Simple y eficiente.</li>
<li>TF-IDF captura importancia de términos.</li>
</ul>
</div>
</li>
<li><a id="orgaa321d0"></a>Ejemplo: espacio de términos<br />
<div class="outline-text-5" id="text-orgaa321d0">
<p>
Supongamos vocabulario = {recuperación, información, evaluación}. Cada documento
y la consulta se representan como vectores de 3 dimensiones (pesos TF-IDF):
</p>

<ul class="org-ul">
<li>\(q\) = "recuperación información" \(\rightarrow\) \(\vec{q} = (0.8, 0.7, 0)\)</li>
<li>\(d_1\) = "recuperación de información e información" \(\rightarrow\) \(\vec{d_1} = (0.5, 0.9, 0)\)</li>
<li>\(d_2\) = "evaluación de la recuperación" \(\rightarrow\) \(\vec{d_2} = (0.6, 0, 0.8)\)</li>
</ul>

<p>
Similitud coseno: \(\text{sim}(q,d) = \frac{\vec{q}\cdot\vec{d}}{|\vec{q}||\vec{d}|}\).
</p>
<ul class="org-ul">
<li>\(\vec{q}\cdot\vec{d_1} = 0.8\cdot 0.5 + 0.7\cdot 0.9 = 0.4 + 0.63 = 1.03\) (alto).</li>
<li>\(\vec{q}\cdot\vec{d_2} = 0.8\cdot 0.6 + 0 + 0 = 0.48\) (menor).</li>
</ul>

<p>
Tras normalizar por las normas, \(d_1\) queda por encima de \(d_2\) en el ranking,
que es lo esperado porque \(d_1\) comparte ambos términos de la consulta.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgbde6efe" class="outline-4">
<h4 id="orgbde6efe">TF-IDF (Term Frequency - Inverse Document Frequency)</h4>
<div class="outline-text-4" id="text-orgbde6efe">
</div>
<ul class="org-ul">
<li><a id="org0e736f1"></a>Frecuencia de término (TF)<br />
<div class="outline-text-5" id="text-org0e736f1">
<ul class="org-ul">
<li>Cuántas veces aparece el término en el documento.</li>
<li>Variantes: TF bruto, TF logarítmico (suavizado).</li>
</ul>
</div>
</li>
<li><a id="org74648a7"></a>Frecuencia inversa de documento (IDF)<br />
<div class="outline-text-5" id="text-org74648a7">
<ul class="org-ul">
<li>\(\text{IDF}(t) = \log \frac{N}{n_t}\), donde \(N\) = número de documentos, \(n_t\) = documentos que contienen \(t\).</li>
<li>Términos raros (en pocos documentos) tienen mayor IDF.</li>
</ul>
</div>
</li>
<li><a id="org510029e"></a>Peso TF-IDF<br />
<div class="outline-text-5" id="text-org510029e">
<p>
\[
w_{t,d} = \text{TF}(t,d) \times \text{IDF}(t)
\]
</p>
</div>
</li>
<li><a id="org6882c3e"></a>Ejemplo numérico TF-IDF<br />
<div class="outline-text-5" id="text-org6882c3e">
<p>
Corpus: 3 documentos. Término "recuperación":
</p>
<ul class="org-ul">
<li>En d1 aparece 3 veces; en d2 aparece 1 vez; en d3 no aparece.</li>
<li>\(N = 3\), \(n_{\text{recuperación}} = 2\) (está en d1 y d2).</li>
<li>\(\text{IDF}(\text{recuperación}) = \log \frac{3}{2} \approx 0.41\).</li>
</ul>

<p>
Para d1: \(\text{TF} = 3\) (o \(\log(1+3)\) si se suaviza). Peso \(\approx 3 \times 0.41 \approx 1.23\).
Para d2: \(\text{TF} = 1\). Peso \(\approx 1 \times 0.41 \approx 0.41\).
</p>

<p>
El término "recuperación" aporta más peso en d1 que en d2 porque es más frecuente
en d1; y aporta más que un término que aparezca en los 3 documentos (IDF menor).
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb689208" class="outline-4">
<h4 id="orgb689208">Modelo probabilístico (BM25, etc.)</h4>
<div class="outline-text-4" id="text-orgb689208">
</div>
<ul class="org-ul">
<li><a id="orgc570d6a"></a>Idea<br />
<div class="outline-text-5" id="text-orgc570d6a">
<ul class="org-ul">
<li>Estimar la probabilidad de que un documento sea relevante dada la consulta.</li>
<li>Ordenar por \(P(\text{relevante} \mid d, q)\).</li>
</ul>
</div>
</li>
<li><a id="org5d9287a"></a>BM25<br />
<div class="outline-text-5" id="text-org5d9287a">
<ul class="org-ul">
<li>Extensión del modelo probabilístico; muy usado en práctica.</li>
<li>Incorpora longitud del documento (penalización por documentos muy largos).</li>
<li>Parámetros: \(k_1\), \(b\) para ajustar saturación de TF y efecto de la longitud.</li>
</ul>
</div>
</li>
<li><a id="org0cf4623"></a>Ejemplo intuitivo BM25<br />
<div class="outline-text-5" id="text-org0cf4623">
<p>
Documento A: 50 palabras, "recuperación" aparece 2 veces.
Documento B: 500 palabras, "recuperación" aparece 10 veces.
</p>

<p>
En TF bruto, B tendría mayor TF. Pero BM25:
</p>
<ul class="org-ul">
<li>Satura el TF: 10 apariciones no aportan 5 veces más que 2 (crecimiento sublineal).</li>
<li>Penaliza por longitud: un documento muy largo tiene más probabilidad de contener
el término por casualidad; BM25 reduce el peso según la longitud respecto a la
media del corpus. Así, un documento corto y focalizado (A) puede rankear más alto.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org70e93e4" class="outline-4">
<h4 id="org70e93e4">Modelos basados en lenguaje (Language Models)</h4>
<div class="outline-text-4" id="text-org70e93e4">
</div>
<ul class="org-ul">
<li><a id="orgea2ec8a"></a>Idea<br />
<div class="outline-text-5" id="text-orgea2ec8a">
<ul class="org-ul">
<li>Modelar cada documento como una distribución de probabilidad sobre términos (language model).</li>
<li>La consulta se "genera" con cierta probabilidad desde el modelo del documento.</li>
<li>Ranking por \(P(q \mid d)\) o variantes (e.g. mezcla con modelo de colección).</li>
</ul>
</div>
</li>
<li><a id="org3c978c1"></a>Ventajas<br />
<div class="outline-text-5" id="text-org3c978c1">
<ul class="org-ul">
<li>Base teórica sólida (probabilidad).</li>
<li>Permite suavizado (smoothing) para términos no vistos.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfd6fb13" class="outline-4">
<h4 id="orgfd6fb13">Resumen comparativo</h4>
<div class="outline-text-4" id="text-orgfd6fb13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modelo</th>
<th scope="col" class="org-left">Ranking</th>
<th scope="col" class="org-left">Complejidad</th>
<th scope="col" class="org-left">Uso típico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Booleano</td>
<td class="org-left">No</td>
<td class="org-left">Baja</td>
<td class="org-left">Sistemas legados</td>
</tr>

<tr>
<td class="org-left">Vectorial</td>
<td class="org-left">Sí</td>
<td class="org-left">Media</td>
<td class="org-left">General, TF-IDF</td>
</tr>

<tr>
<td class="org-left">Probabilístico</td>
<td class="org-left">Sí</td>
<td class="org-left">Media</td>
<td class="org-left">BM25 en Elasticsearch</td>
</tr>

<tr>
<td class="org-left">Language Model</td>
<td class="org-left">Sí</td>
<td class="org-left">Mayor</td>
<td class="org-left">Investigación, NLP</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orga42c6f3" class="outline-3">
<h3 id="orga42c6f3">Evaluación de la recuperación</h3>
<div class="outline-text-3" id="text-orga42c6f3">
<p>
La evaluación permite comparar sistemas o configuraciones y decidir mejoras.
</p>
</div>
<div id="outline-container-orgb87f0b1" class="outline-4">
<h4 id="orgb87f0b1">Conjuntos de prueba (test collections)</h4>
<div class="outline-text-4" id="text-orgb87f0b1">
</div>
<ul class="org-ul">
<li><a id="orgb5765c7"></a>Componentes<br />
<div class="outline-text-5" id="text-orgb5765c7">
<ol class="org-ol">
<li><b>Corpus</b>: conjunto de documentos.</li>
<li><b>Consultas</b> (topics): necesidades de información representativas.</li>
<li><b>Juicios de relevancia</b> (qrels): para cada par (consulta, documento), si el documento es relevante o no (idealmente por humanos).</li>
</ol>
</div>
</li>
<li><a id="org3c102a8"></a>Ejemplos de colecciones<br />
<div class="outline-text-5" id="text-org3c102a8">
<ul class="org-ul">
<li>Cranfield, TREC, CLEF, NTCIR: estándar en investigación.</li>
<li>En la industria: datos propios con juicios implícitos (clics, tiempo en página).</li>
</ul>
</div>
</li>
