index.html
<li><a id="org14bf4ba"></a>Ejemplo de colección mínima<br />
<div class="outline-text-5" id="text-org14bf4ba">
<ul class="org-ul">
<li><b>Corpus</b>: 5 documentos d1, d2, d3, d4, d5.</li>
<li><b>Consulta</b>: "evaluación de la recuperación".</li>
<li><p>
<b>Juicios de relevancia</b> (qrels): un evaluador humano indica qué documentos son relevantes:
</p>
<ul class="org-ul">
<li>d1: no relevante.</li>
<li>d2: relevante.</li>
<li>d3: relevante.</li>
<li>d4: no relevante.</li>
<li>d5: relevante.</li>
</ul>
<p>
Total relevante = 3 (d2, d3, d5).
</p></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcbde838" class="outline-4">
<h4 id="orgcbde838">Métricas principales</h4>
<div class="outline-text-4" id="text-orgcbde838">
</div>
<ul class="org-ul">
<li><a id="org26f5ab0"></a>Precisión (Precision)<br />
<div class="outline-text-5" id="text-org26f5ab0">
<p>
\[
P = \frac{\text{documentos relevantes recuperados}}{\text{total de documentos recuperados}}
\]
</p>
<ul class="org-ul">
<li>"De lo que devolví, ¿cuánto era relevante?"</li>
</ul>
</div>
</li>
<li><a id="org022618b"></a>Recall (Exhaustividad)<br />
<div class="outline-text-5" id="text-org022618b">
<p>
\[
R = \frac{\text{documentos relevantes recuperados}}{\text{total de documentos relevantes en el corpus}}
\]
</p>
<ul class="org-ul">
<li>"De todo lo relevante, ¿cuánto recuperé?"</li>
</ul>
</div>
</li>
<li><a id="org9f598e1"></a>F1 (F-measure)<br />
<div class="outline-text-5" id="text-org9f598e1">
<ul class="org-ul">
<li>Media armónica de precisión y recall:</li>
</ul>
<p>
\[
F_1 = 2 \frac{P \cdot R}{P + R}
\]
</p>
</div>
</li>
<li><a id="org1ebc160"></a>Precisión en k (P@k)<br />
<div class="outline-text-5" id="text-org1ebc160">
<ul class="org-ul">
<li>Precisión considerando solo los primeros \(k\) resultados.</li>
<li>Útil cuando el usuario solo mira los primeros resultados (p. ej. P@10).</li>
</ul>
</div>
</li>
<li><a id="orgbe884ab"></a>Ejemplo numérico: precisión, recall, F1, P@k<br />
<div class="outline-text-5" id="text-orgbe884ab">
<p>
Con la colección anterior: 3 documentos relevantes (d2, d3, d5). Supongamos que
el sistema devuelve, en orden: [d2, d1, d3, d4, d5].
</p>

<ul class="org-ul">
<li><b>Recuperados</b>: 5. <b>Relevantes recuperados</b>: d2, d3, d5 \(\Rightarrow\) 3.</li>
<li>Precisión \(P = 3/5 = 0.6\) (de los 5 devueltos, 3 son relevantes).</li>
<li>Recall \(R = 3/3 = 1.0\) (recuperamos todos los relevantes).</li>
<li>\(F_1 = 2 \cdot \frac{0.6 \cdot 1}{0.6 + 1} = \frac{1.2}{1.6} \approx 0.75\).</li>
</ul>

<p>
P@k:
</p>
<ul class="org-ul">
<li>P@1 = 1/1 = 1 (el primero es relevante).</li>
<li>P@2 = 1/2 = 0.5 (de los dos primeros, uno es relevante).</li>
<li>P@3 = 2/3 \(\approx\) 0.67.</li>
<li>P@5 = 3/5 = 0.6.</li>
</ul>
</div>
</li>
<li><a id="orgc67e5c9"></a>Precisión promedia (AP) y MAP<br />
<div class="outline-text-5" id="text-orgc67e5c9">
<ul class="org-ul">
<li><b>Average Precision (AP)</b>: para una consulta, promedio de precisiones en cada punto de recall donde se recupera un documento relevante.</li>
<li><b>MAP (Mean Average Precision)</b>: media de AP sobre todas las consultas.</li>
<li>Muy usada en competiciones y literatura.</li>
</ul>
</div>
</li>
<li><a id="org806f004"></a>Ejemplo: Average Precision (AP)<br />
<div class="outline-text-5" id="text-org806f004">
<p>
Mismo ranking: [d2, d1, d3, d4, d5]; relevantes = {d2, d3, d5}.
</p>

<p>
En las posiciones 1, 2, 3, 4, 5 vamos marcando si el documento es relevante (R) o no (N):
pos 1: d2 R \(\rightarrow\) precisión hasta aquí = 1/1 = 1.0
pos 2: d1 N
pos 3: d3 R \(\rightarrow\) precisión hasta aquí = 2/3 \(\approx\) 0.67
pos 4: d4 N
pos 5: d5 R \(\rightarrow\) precisión hasta aquí = 3/5 = 0.6
</p>

<p>
AP = promedio de las precisiones en cada "hit" relevante:
\[
\text{AP} = \frac{1 + 2/3 + 3/5}{3} = \frac{1 + 0.67 + 0.6}{3} \approx 0.76
\]
Un ranking perfecto [d2, d3, d5, &#x2026;] tendría AP = 1.0.
</p>
</div>
</li>
<li><a id="orga6b8520"></a>NDCG (Normalized Discounted Cumulative Gain)<br />
<div class="outline-text-5" id="text-orga6b8520">
<ul class="org-ul">
<li>Tiene en cuenta la <b>posición</b> en el ranking: más relevante arriba es mejor.</li>
<li>El "gain" se descuenta según la posición (discounted).</li>
<li>NDCG normaliza por el DCG ideal (ranking perfecto).</li>
<li>Adecuado cuando hay grados de relevancia (no solo relevante/no relevante).</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgd5e3f82"></a>Ejemplo NDCG (intuitivo)<br />
<div class="outline-text-6" id="text-orgd5e3f82">
<p>
Supongamos relevancia en escala 0–3: 0 = no relevante, 3 = muy relevante.
Ranking del sistema: pos1 rel=2, pos2 rel=0, pos3 rel=3, pos4 rel=1.
</p>

<p>
DCG suma el "gain" (relevancia) descontado por la posición: \(\frac{\text{rel}}{\log_2(\text{pos}+1)}\).
</p>
<ul class="org-ul">
<li>Pos 1: \(2/\log_2 2 = 2\)</li>
<li>Pos 2: \(0\)</li>
<li>Pos 3: \(3/\log_2 4 = 3/2 = 1.5\)</li>
<li>Pos 4: \(1/\log_2 5 \approx 0.43\)</li>
</ul>
<p>
DCG \(\approx 2 + 0 + 1.5 + 0.43 \approx 3.93\).
</p>

<p>
El DCG ideal ordenaría por relevancia descendente: [3, 2, 1, 0] \(\Rightarrow\) IDCG.
NDCG = DCG / IDCG (normalizado entre 0 y 1). Así se premia que los más relevantes
estén arriba en el ranking.
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgfe68574" class="outline-4">
<h4 id="orgfe68574">Evaluación con usuarios</h4>
<div class="outline-text-4" id="text-orgfe68574">
<ul class="org-ul">
<li><b>Estudios de usabilidad</b>: tiempo para completar tareas, satisfacción, número de clics.</li>
<li><b>A/B testing</b>: comparar dos versiones del sistema con usuarios reales.</li>
<li><b>Juicios de relevancia</b>: coste humano; a veces se usan juicios implícitos (clics, dwell time).</li>
</ul>
</div>
</div>
<div id="outline-container-org900e24e" class="outline-4">
<h4 id="org900e24e">Trade-off precisión vs. recall</h4>
<div class="outline-text-4" id="text-org900e24e">
<ul class="org-ul">
<li>Aumentar resultados mostrados \(\Rightarrow\) recall sube, precisión puede bajar.</li>
<li>Ser más estricto en el ranking \(\Rightarrow\) precisión sube, recall puede bajar.</li>
<li>Depende del dominio: en legal/medicina a veces se prioriza recall; en web comercial, precisión en los primeros resultados.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orgf365c0a"></a>Ejemplo<br />
<div class="outline-text-5" id="text-orgf365c0a">
<pre class="example" id="org055c0d0">
Corpus: 100 documentos, 10 relevantes para la consulta.

- Si el sistema devuelve solo los 5 primeros y los 5 son relevantes:
  P = 5/5 = 1.0, R = 5/10 = 0.5 (precisión perfecta, recall bajo).

- Si devuelve 50 documentos y 10 son relevantes:
  P = 10/50 = 0.2, R = 10/10 = 1.0 (recall perfecto, precisión baja).

- Objetivo típico: devolver unos 10–20 resultados con varios relevantes arriba,
  equilibrando P y R (p. ej. P@10 alto y recall razonable).
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgba83a4b" class="outline-3">
<h3 id="orgba83a4b">Referencias</h3>
<div class="outline-text-3" id="text-orgba83a4b">
<ul class="org-ul">
<li>Manning, Raghavan, Schütze: <i>Information Retrieval: Implementing and Evaluating Search Engines</i> (MIT Press).</li>
<li>Baeza-Yates, Ribeiro-Neto: <i>Modern Information Retrieval</i> (Addison Wesley).</li>
<li>TREC: <code>https://trec.nist.gov/</code> (benchmarks y métricas).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0126e40" class="outline-2">
<h2 id="org0126e40">Ejemplos IRS — Recuperación de información con feeds RSS</h2>
<div class="outline-text-2" id="text-org0126e40">
<p>
Un <b>Sistema de Recuperación de Información</b> (IRS, o IR en inglés) es un sistema
que permite almacenar, organizar y recuperar documentos (o ítems) relevantes
ante una <b>consulta</b> del usuario. Los componentes típicos son:
</p>

<ol class="org-ol">
<li><b>Colección</b>: conjunto de documentos (en nuestras actividades = ítems de feeds RSS).</li>
<li><b>Consulta</b>: necesidad de información expresada por el usuario (query).</li>
<li><b>Proceso de recuperación</b>: matching entre consulta y documentos (ranking, filtrado).</li>
<li><b>Interfaz</b>: forma en que el usuario formula consultas y ve resultados.</li>
</ol>

<p>
En estas actividades usaremos <b>feeds RSS</b> como colección de documentos: cada
entrada (item) es un “documento” con título, descripción, fecha y enlace.
Así practicamos extracción, limpieza e indexación como en un IRS real.
</p>
</div>
<div id="outline-container-org46d4d2d" class="outline-3">
<h3 id="org46d4d2d">Un buscador introductorio con feeds RSS</h3>
<div class="outline-text-3" id="text-org46d4d2d">
<p>
En este material construimos un <b>buscador muy sencillo</b> que usa <b>feeds RSS</b> como
fuente de documentos: tú escribes una consulta y el sistema te devuelve ítems
relevantes (título, enlace, fecha). Para que el buscador tenga algo que buscar,
primero hay que <b>encontrar URLs de feeds RSS</b>. Por eso la primera actividad es
usar <b>hacks de búsqueda</b> en Google (o DuckDuckGo, etc.) para descubrir esas
páginas; después extraemos, limpiamos e indexamos esos feeds y probamos la
búsqueda.
</p>
</div>
