readme.org
*** Hacks de búsqueda: encontrar páginas y URLs de feeds RSS


El uso de operadores de búsqueda (también conocidos como hacks de
búsqueda) permite refinar las consultas en buscadores web con el
objetivo de localizar páginas que publican feeds RSS. Mediante estos
operadores es posible identificar de forma eficiente las URLs de
dichos feeds, los cuales constituyen la fuente primaria de documentos
para el sistema de recuperación de información. Sin una colección de
feeds RSS adecuadamente identificada, no es posible construir ni
alimentar el buscador de noticias propuesto.

****  Operadores útiles Google Search
| Operador       | Ejemplo                 | Descripción                          |
|----------------+-------------------------+--------------------------------------|
| site:          | site:bbc.com rss        | Busca RSS dentro de un dominio       |
| inurl:         | inurl:rss noticias      | Busca URLs que contengan "rss"       |
| intitle:       | intitle:rss technology  | Busca páginas con "rss" en el título |
| filetype:      | filetype:xml rss        | Localiza archivos XML (feeds)        |
| "frase exacta" | "RSS feed" site:news    | Coincidencia exacta                  |
| OR             | rss OR "xml feed"       | Búsqueda alternativa                 |
| -              | rss -podcast            | Excluye términos                     |
| allinurl:      | allinurl:rss feeds news | Todas las palabras en la URL         |


**** Operadores útiles DuckDuckGo

| Operador       | Ejemplo              | Descripción                  |
|----------------+----------------------+------------------------------|
| site:          | site:reuters.com rss | Limita búsqueda a un dominio |
| inurl:         | inurl:rss            | Busca "rss" en la URL        |
| intitle:       | intitle:"rss feed"   | Busca en el título           |
| filetype:      | filetype:xml rss     | Archivos XML                 |
| "frase exacta" | "news rss feed"      | Coincidencia exacta          |
| -              | rss -video           | Excluir términos             |


**** Bing Search

| Operador       | Ejemplo             | Descripción               |
|----------------+---------------------+---------------------------|
| site:          | site:elpais.com rss | Buscar RSS por dominio    |
| inurl:         | inurl:feed          | URLs que contienen "feed" |
| intitle:       | intitle:rss         | Buscar en títulos         |
| filetype:      | filetype:xml rss    | Feeds XML                 |
| "frase exacta" | "rss noticias"      | Coincidencia exacta       |
| -              | rss -audio          | Exclusión                 |

**** Hacks combinados (muy útiles para IRS)
| Consulta ejemplo          |
|---------------------------|
| site:news "rss feed"      |
| inurl:rss filetype:xml    |
| site:.org intitle:rss     |
| site:gov filetype:xml rss |
| "rss feed" "news"         |



*** Consultas de ejemplo para probar en el buscador

#+begin_example
inurl:rss noticias tecnología
inurl:feed blog educación
"rss" "suscribirse" site:elpais.com
filetype:xml rss
inurl:atom feed
#+end_example

Desde el punto de vista del IRS, la *consulta* que se escribe en el buscador
(p. ej. ~inurl:rss noticias~) es la “consulta” del sistema de recuperación; los
*resultados* que muestra Google (o DuckDuckGo, Bing) son la “interfaz de
búsqueda”: un listado de documentos (páginas) que el modelo de recuperación del
buscador consideró relevantes. Las URLs de feeds que el usuario anota pasan a
ser la *colección* que alimentará el pequeño buscador sobre RSS.

