index.html
<div id="outline-container-orge54b267" class="outline-4">
<h4 id="orge54b267">Hacks de búsqueda: encontrar páginas y URLs de feeds RSS</h4>
<div class="outline-text-4" id="text-orge54b267">
<p>
El uso de operadores de búsqueda (también conocidos como hacks de
búsqueda) permite refinar las consultas en buscadores web con el
objetivo de localizar páginas que publican feeds RSS. Mediante estos
operadores es posible identificar de forma eficiente las URLs de
dichos feeds, los cuales constituyen la fuente primaria de documentos
para el sistema de recuperación de información. Sin una colección de
feeds RSS adecuadamente identificada, no es posible construir ni
alimentar el buscador de noticias propuesto.
</p>
</div>
<ul class="org-ul">
<li><a id="orgc7d35bf"></a>Operadores útiles Google Search<br />
<div class="outline-text-5" id="text-orgc7d35bf">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Ejemplo</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">site:</td>
<td class="org-left">site:bbc.com rss</td>
<td class="org-left">Busca RSS dentro de un dominio</td>
</tr>

<tr>
<td class="org-left">inurl:</td>
<td class="org-left">inurl:rss noticias</td>
<td class="org-left">Busca URLs que contengan "rss"</td>
</tr>

<tr>
<td class="org-left">intitle:</td>
<td class="org-left">intitle:rss technology</td>
<td class="org-left">Busca páginas con "rss" en el título</td>
</tr>

<tr>
<td class="org-left">filetype:</td>
<td class="org-left">filetype:xml rss</td>
<td class="org-left">Localiza archivos XML (feeds)</td>
</tr>

<tr>
<td class="org-left">"frase exacta"</td>
<td class="org-left">"RSS feed" site:news</td>
<td class="org-left">Coincidencia exacta</td>
</tr>

<tr>
<td class="org-left">OR</td>
<td class="org-left">rss OR "xml feed"</td>
<td class="org-left">Búsqueda alternativa</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">rss -podcast</td>
<td class="org-left">Excluye términos</td>
</tr>

<tr>
<td class="org-left">allinurl:</td>
<td class="org-left">allinurl:rss feeds news</td>
<td class="org-left">Todas las palabras en la URL</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org2736e4e"></a>Operadores útiles DuckDuckGo<br />
<div class="outline-text-5" id="text-org2736e4e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Ejemplo</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">site:</td>
<td class="org-left">site:reuters.com rss</td>
<td class="org-left">Limita búsqueda a un dominio</td>
</tr>

<tr>
<td class="org-left">inurl:</td>
<td class="org-left">inurl:rss</td>
<td class="org-left">Busca "rss" en la URL</td>
</tr>

<tr>
<td class="org-left">intitle:</td>
<td class="org-left">intitle:"rss feed"</td>
<td class="org-left">Busca en el título</td>
</tr>

<tr>
<td class="org-left">filetype:</td>
<td class="org-left">filetype:xml rss</td>
<td class="org-left">Archivos XML</td>
</tr>

<tr>
<td class="org-left">"frase exacta"</td>
<td class="org-left">"news rss feed"</td>
<td class="org-left">Coincidencia exacta</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">rss -video</td>
<td class="org-left">Excluir términos</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgb717139"></a>Bing Search<br />
<div class="outline-text-5" id="text-orgb717139">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operador</th>
<th scope="col" class="org-left">Ejemplo</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">site:</td>
<td class="org-left">site:elpais.com rss</td>
<td class="org-left">Buscar RSS por dominio</td>
</tr>

<tr>
<td class="org-left">inurl:</td>
<td class="org-left">inurl:feed</td>
<td class="org-left">URLs que contienen "feed"</td>
</tr>

<tr>
<td class="org-left">intitle:</td>
<td class="org-left">intitle:rss</td>
<td class="org-left">Buscar en títulos</td>
</tr>

<tr>
<td class="org-left">filetype:</td>
<td class="org-left">filetype:xml rss</td>
<td class="org-left">Feeds XML</td>
</tr>

<tr>
<td class="org-left">"frase exacta"</td>
<td class="org-left">"rss noticias"</td>
<td class="org-left">Coincidencia exacta</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">rss -audio</td>
<td class="org-left">Exclusión</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgf234ed5"></a>Hacks combinados (muy útiles para IRS)<br />
<div class="outline-text-5" id="text-orgf234ed5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Consulta ejemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">site:news "rss feed"</td>
</tr>

<tr>
<td class="org-left">inurl:rss filetype:xml</td>
</tr>

<tr>
<td class="org-left">site:.org intitle:rss</td>
</tr>

<tr>
<td class="org-left">site:gov filetype:xml rss</td>
</tr>

<tr>
<td class="org-left">"rss feed" "news"</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0ce8328" class="outline-4">
<h4 id="org0ce8328">Consultas de ejemplo para probar en el buscador</h4>
<div class="outline-text-4" id="text-org0ce8328">
<pre class="example" id="org86fe652">
inurl:rss noticias tecnología
inurl:feed blog educación
"rss" "suscribirse" site:elpais.com
filetype:xml rss
inurl:atom feed
</pre>

<p>
Desde el punto de vista del IRS, la <b>consulta</b> que se escribe en el buscador
(p. ej. <code>inurl:rss noticias</code>) es la “consulta” del sistema de recuperación; los
<b>resultados</b> que muestra Google (o DuckDuckGo, Bing) son la “interfaz de
búsqueda”: un listado de documentos (páginas) que el modelo de recuperación del
buscador consideró relevantes. Las URLs de feeds que el usuario anota pasan a
ser la <b>colección</b> que alimentará el pequeño buscador sobre RSS.
</p>
</div>
</div>
</div>
