readme.org
** Extraer datos de un feed RSS y guardarlos
 
En un IRS la *colección* es el conjunto de documentos sobre el que el sistema
responde a las consultas. Sin colección no hay recuperación. En nuestro caso,
los “documentos” son los *ítems de un feed RSS*: cada entrada del feed (título,
enlace, fecha, resumen) equivale a un documento indexable. Extraer esos ítems
y representarlos en una estructura uniforme (p. ej. lista de diccionarios) es
el primer paso para que el IRS pueda comparar después la consulta del usuario
contra cada documento. Los feeds RSS son idóneos porque ya vienen estructurados
(XML con ~<item>~ o entradas Atom), con campos de texto (título, descripción)
que el IRS puede usar para búsqueda.

- *IRS — Colección*: la lista de ítems extraídos del feed *es* la colección del
  sistema.
- *RSS*: el feed es la fuente externa; cada ~entry~ o ~<item>~ es un documento.
- *Código*: descargar el feed (HTTP), parsear el XML y mapear cada ítem a
  campos (título, link, fecha, resumen) construye esa colección en memoria.

La función ~fetch_rss(url, max_entries)~ recibe la URL del feed y un límite de
entradas. ~feedparser.parse(url)~ descarga y parsea el feed (RSS o Atom) y
devuelve un objeto con ~.entries~: lista de ítems. Para cada entrada se
extraen ~title~, ~link~, ~published~ (o ~updated~) y ~summary~ (o ~description~).
Esos campos son los que un IRS necesita para identificar el documento y para
indexar texto (título y resumen). El resultado es una lista de diccionarios:
cada uno representa *un documento de la colección*. Si hay error de red o XML
inválido, se devuelve un ítem con ~error~ para no romper el flujo. Al final,
~items~ es la colección sobre la que más adelante se aplicará la consulta.

#+begin_src python :session irs :results output :exports both
import feedparser
import json

def fetch_rss(url, max_entries=20):
    """Extrae ítems de un feed RSS/Atom. Devuelve lista de diccionarios."""
    try:
        feed = feedparser.parse(url)
        items = []
        for e in feed.entries[:max_entries]:
            items.append({
                "title": e.get("title", ""),
                "link": e.get("link", ""),
                "published": e.get("published", e.get("updated", "")),
                "summary": e.get("summary", e.get("description", "")),
            })
        return items
    except Exception as err:
        return [{"error": str(err), "url": url}]

url = "https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada"
items = fetch_rss(url, max_entries=15)
print(json.dumps(items, indent=2, ensure_ascii=False))
#+end_src

#+RESULTS:

Ejemplo con mas de una URL 

#+begin_src python :session irs :results output :exports both
import feedparser
import json

def fetch_rss(url, max_entries=20):
    """Extrae ítems de un feed RSS/Atom."""
    feed = feedparser.parse(url)
    items = []
    for e in feed.entries[:max_entries]:
        items.append({
            "title": e.get("title", ""),
            "link": e.get("link", ""),
            "published": e.get("published", e.get("updated", "")),
            "summary": e.get("summary", e.get("description", "")),
            "source": url
        })
    return items

# 🔹 Lista de feeds
urls = [
    "https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada",
    "https://www.reddit.com/r/python/.rss",
    "https://hnrss.org/frontpage"
]

all_items = []

for url in urls:
    try:
        all_items.extend(fetch_rss(url, max_entries=10))
    except Exception as err:
        all_items.append({"error": str(err), "url": url})

print(json.dumps(all_items, indent=2, ensure_ascii=False))
#+end_src


Ejemplo clasificando la salida

#+begin_src python :session irs :results output :exports both
import feedparser
import json

def fetch_rss(url, max_entries=20):
    """Devuelve una lista de ítems de un feed RSS/Atom."""
    feed = feedparser.parse(url)
    items = []
    for e in feed.entries[:max_entries]:
        items.append({
            "title": e.get("title", ""),
            "link": e.get("link", ""),
            "published": e.get("published", e.get("updated", "")),
            "summary": e.get("summary", e.get("description", "")),
        })
    return items

# 🔹 Lista de feeds RSS / Atom
urls = [
    "https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada",
    "https://www.reddit.com/r/python/.rss",
    "https://hnrss.org/frontpage"
]

#  Diccionario: una clave por feed
feeds_data = {}

for url in urls:
    try:
        feeds_data[url] = fetch_rss(url, max_entries=10)
    except Exception as err:
        feeds_data[url] = [{"error": str(err)}]

#  Salida legible en Org / consola
print(json.dumps(feeds_data, indent=2, ensure_ascii=False))
#+end_src


Guardar en json

#+begin_src python :session irs :results output :exports both
import feedparser
import json

def fetch_rss(url, max_entries=20):
    """Devuelve una lista de ítems de un feed RSS/Atom."""
    feed = feedparser.parse(url)
    items = []
    for e in feed.entries[:max_entries]:
        items.append({
            "title": e.get("title", ""),
            "link": e.get("link", ""),
            "published": e.get("published", e.get("updated", "")),
            "summary": e.get("summary", e.get("description", "")),
        })
    return items

# 🔹 Lista de feeds RSS / Atom
urls = [
    "https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada",
    "https://www.reddit.com/r/python/.rss",
    "https://hnrss.org/frontpage"
]

#  Diccionario: una clave por feed
feeds_data = {}

for url in urls:
    try:
        feeds_data[url] = fetch_rss(url, max_entries=10)
    except Exception as err:
        feeds_data[url] = [{"error": str(err)}]

        
with open("data.json", "w", encoding="utf-8") as f:
    json.dump(feeds_data, f, indent=2, ensure_ascii=False)
        
        
#  Salida legible en Org / consola
print("Salida del JSON")
#+end_src

#+RESULTS:
: Salida del JSON



