index.html
<div id="outline-container-orga350b1d" class="outline-3">
<h3 id="orga350b1d">Extraer datos de un feed RSS y guardarlos</h3>
<div class="outline-text-3" id="text-orga350b1d">
<p>
En un IRS la <b>colección</b> es el conjunto de documentos sobre el que el sistema
responde a las consultas. Sin colección no hay recuperación. En nuestro caso,
los “documentos” son los <b>ítems de un feed RSS</b>: cada entrada del feed (título,
enlace, fecha, resumen) equivale a un documento indexable. Extraer esos ítems
y representarlos en una estructura uniforme (p. ej. lista de diccionarios) es
el primer paso para que el IRS pueda comparar después la consulta del usuario
contra cada documento. Los feeds RSS son idóneos porque ya vienen estructurados
(XML con <code>&lt;item&gt;</code> o entradas Atom), con campos de texto (título, descripción)
que el IRS puede usar para búsqueda.
</p>

<ul class="org-ul">
<li><b>IRS — Colección</b>: la lista de ítems extraídos del feed <b>es</b> la colección del
sistema.</li>
<li><b>RSS</b>: el feed es la fuente externa; cada <code>entry</code> o <code>&lt;item&gt;</code> es un documento.</li>
<li><b>Código</b>: descargar el feed (HTTP), parsear el XML y mapear cada ítem a
campos (título, link, fecha, resumen) construye esa colección en memoria.</li>
</ul>

<p>
La función <code>fetch_rss(url, max_entries)</code> recibe la URL del feed y un límite de
entradas. <code>feedparser.parse(url)</code> descarga y parsea el feed (RSS o Atom) y
devuelve un objeto con <code>.entries</code>: lista de ítems. Para cada entrada se
extraen <code>title</code>, <code>link</code>, <code>published</code> (o <code>updated</code>) y <code>summary</code> (o <code>description</code>).
Esos campos son los que un IRS necesita para identificar el documento y para
indexar texto (título y resumen). El resultado es una lista de diccionarios:
cada uno representa <b>un documento de la colección</b>. Si hay error de red o XML
inválido, se devuelve un ítem con <code>error</code> para no romper el flujo. Al final,
<code>items</code> es la colección sobre la que más adelante se aplicará la consulta.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> feedparser
<span style="color: #fb4934;">import</span> json

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">fetch_rss</span><span style="color: #fe8019;">(</span>url, max_entries=20<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Extrae &#237;tems de un feed RSS/Atom. Devuelve lista de diccionarios."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feed</span> = feedparser.parse<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">items</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> e <span style="color: #fb4934;">in</span> feed.entries<span style="color: #fe8019;">[</span>:max_entries<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   items.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"title"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"link"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"link"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"published"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"published"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"updated"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"summary"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"summary"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"description"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> items
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> <span style="color: #fabd2f;">Exception</span> <span style="color: #fb4934;">as</span> err:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #fe8019;">[</span><span style="color: #b16286;">{</span><span style="color: #b8bb26;">"error"</span>: <span style="color: #fe8019;">str</span><span style="color: #b8bb26;">(</span>err<span style="color: #b8bb26;">)</span>, <span style="color: #b8bb26;">"url"</span>: url<span style="color: #b16286;">}</span><span style="color: #fe8019;">]</span>

<span style="color: #83a598;">url</span> = <span style="color: #b8bb26;">"https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada"</span>
<span style="color: #83a598;">items</span> = fetch_rss<span style="color: #fe8019;">(</span>url, max_entries=15<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>json.dumps<span style="color: #b16286;">(</span>items, indent=2, ensure_ascii=<span style="color: #d3869b;">False</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<p>
Ejemplo con mas de una URL 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> feedparser
<span style="color: #fb4934;">import</span> json

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">fetch_rss</span><span style="color: #fe8019;">(</span>url, max_entries=20<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Extrae &#237;tems de un feed RSS/Atom."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feed</span> = feedparser.parse<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">items</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> e <span style="color: #fb4934;">in</span> feed.entries<span style="color: #fe8019;">[</span>:max_entries<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   items.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"title"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"link"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"link"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"published"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"published"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"updated"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"summary"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"summary"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"description"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"source"</span>: url
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> items

<span style="color: #928374;"># </span><span style="color: #928374;">&#128313; Lista de feeds
</span><span style="color: #83a598;">urls</span> = <span style="color: #fe8019;">[</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://www.reddit.com/r/python/.rss"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://hnrss.org/frontpage"</span>
<span style="color: #fe8019;">]</span>

<span style="color: #83a598;">all_items</span> = <span style="color: #fe8019;">[]</span>

<span style="color: #fb4934;">for</span> url <span style="color: #fb4934;">in</span> urls:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   all_items.extend<span style="color: #fe8019;">(</span>fetch_rss<span style="color: #b16286;">(</span>url, max_entries=10<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> <span style="color: #fabd2f;">Exception</span> <span style="color: #fb4934;">as</span> err:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   all_items.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span><span style="color: #b8bb26;">"error"</span>: <span style="color: #fe8019;">str</span><span style="color: #b8bb26;">(</span>err<span style="color: #b8bb26;">)</span>, <span style="color: #b8bb26;">"url"</span>: url<span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>

<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>json.dumps<span style="color: #b16286;">(</span>all_items, indent=2, ensure_ascii=<span style="color: #d3869b;">False</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>


<p>
Ejemplo clasificando la salida
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> feedparser
<span style="color: #fb4934;">import</span> json

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">fetch_rss</span><span style="color: #fe8019;">(</span>url, max_entries=20<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Devuelve una lista de &#237;tems de un feed RSS/Atom."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feed</span> = feedparser.parse<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">items</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> e <span style="color: #fb4934;">in</span> feed.entries<span style="color: #fe8019;">[</span>:max_entries<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   items.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"title"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"link"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"link"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"published"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"published"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"updated"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"summary"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"summary"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"description"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> items

<span style="color: #928374;"># </span><span style="color: #928374;">&#128313; Lista de feeds RSS / Atom
</span><span style="color: #83a598;">urls</span> = <span style="color: #fe8019;">[</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://www.reddit.com/r/python/.rss"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://hnrss.org/frontpage"</span>
<span style="color: #fe8019;">]</span>

<span style="color: #928374;">#  </span><span style="color: #928374;">Diccionario: una clave por feed
</span><span style="color: #83a598;">feeds_data</span> = <span style="color: #fe8019;">{}</span>

<span style="color: #fb4934;">for</span> url <span style="color: #fb4934;">in</span> urls:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feeds_data</span><span style="color: #fe8019;">[</span>url<span style="color: #fe8019;">]</span> = fetch_rss<span style="color: #fe8019;">(</span>url, max_entries=10<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> <span style="color: #fabd2f;">Exception</span> <span style="color: #fb4934;">as</span> err:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feeds_data</span><span style="color: #fe8019;">[</span>url<span style="color: #fe8019;">]</span> = <span style="color: #fe8019;">[</span><span style="color: #b16286;">{</span><span style="color: #b8bb26;">"error"</span>: <span style="color: #fe8019;">str</span><span style="color: #b8bb26;">(</span>err<span style="color: #b8bb26;">)</span><span style="color: #b16286;">}</span><span style="color: #fe8019;">]</span>

<span style="color: #928374;">#  </span><span style="color: #928374;">Salida legible en Org / consola
</span><span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>json.dumps<span style="color: #b16286;">(</span>feeds_data, indent=2, ensure_ascii=<span style="color: #d3869b;">False</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>


<p>
Guardar en json
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> feedparser
<span style="color: #fb4934;">import</span> json

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">fetch_rss</span><span style="color: #fe8019;">(</span>url, max_entries=20<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Devuelve una lista de &#237;tems de un feed RSS/Atom."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feed</span> = feedparser.parse<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">items</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> e <span style="color: #fb4934;">in</span> feed.entries<span style="color: #fe8019;">[</span>:max_entries<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   items.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"title"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"link"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"link"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"published"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"published"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"updated"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"summary"</span>: e.get<span style="color: #b8bb26;">(</span><span style="color: #b8bb26;">"summary"</span>, e.get<span style="color: #83a598;">(</span><span style="color: #b8bb26;">"description"</span>, <span style="color: #b8bb26;">""</span><span style="color: #83a598;">)</span><span style="color: #b8bb26;">)</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> items

<span style="color: #928374;"># </span><span style="color: #928374;">&#128313; Lista de feeds RSS / Atom
</span><span style="color: #83a598;">urls</span> = <span style="color: #fe8019;">[</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://feeds.elpais.com/mrss-s/pages/ep/site/elpais.com/section/mexico/portada"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://www.reddit.com/r/python/.rss"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"https://hnrss.org/frontpage"</span>
<span style="color: #fe8019;">]</span>

<span style="color: #928374;">#  </span><span style="color: #928374;">Diccionario: una clave por feed
</span><span style="color: #83a598;">feeds_data</span> = <span style="color: #fe8019;">{}</span>

<span style="color: #fb4934;">for</span> url <span style="color: #fb4934;">in</span> urls:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feeds_data</span><span style="color: #fe8019;">[</span>url<span style="color: #fe8019;">]</span> = fetch_rss<span style="color: #fe8019;">(</span>url, max_entries=10<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> <span style="color: #fabd2f;">Exception</span> <span style="color: #fb4934;">as</span> err:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">feeds_data</span><span style="color: #fe8019;">[</span>url<span style="color: #fe8019;">]</span> = <span style="color: #fe8019;">[</span><span style="color: #b16286;">{</span><span style="color: #b8bb26;">"error"</span>: <span style="color: #fe8019;">str</span><span style="color: #b8bb26;">(</span>err<span style="color: #b8bb26;">)</span><span style="color: #b16286;">}</span><span style="color: #fe8019;">]</span>

<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   
<span style="color: #fb4934;">with</span> <span style="color: #fe8019;">open</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"data.json"</span>, <span style="color: #b8bb26;">"w"</span>, encoding=<span style="color: #b8bb26;">"utf-8"</span><span style="color: #fe8019;">)</span> <span style="color: #fb4934;">as</span> f:
<span style="background-color: #3c3836;"> </span>   json.dump<span style="color: #fe8019;">(</span>feeds_data, f, indent=2, ensure_ascii=<span style="color: #d3869b;">False</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   
<span style="color: #928374;">#  </span><span style="color: #928374;">Salida legible en Org / consola
</span><span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Salida del JSON"</span><span style="color: #fe8019;">)</span>
</pre>
</div>

<pre class="example">
Salida del JSON
</pre>
</div>
</div>
