readme.org
** Limpieza de texto (normalización para el IRS)
  
Los feeds RSS suelen incluir en título y resumen *HTML* (etiquetas ~<p>~, ~<a>~,
etc.), mayúsculas/minúsculas mezcladas y signos de puntuación. Si el IRS
busca la palabra “python” en el texto crudo, no encontrará “Python” ni
“<em>python</em>”. La *normalización* (limpieza) hace que todos los documentos
y la consulta compartan el mismo “alfabeto”: minúsculas, sin HTML, sin
caracteres que no aporten para la búsqueda. Así la comparación consulta–documento
es consistente y el *modelo booleano* (palabras exactas) y el *vectorial* (conteo
de términos) pueden aplicarse sobre una representación uniforme del texto.


- *IRS*: la normalización es una etapa típica de *indexación*; el índice se
  construye sobre el texto limpio, no sobre el raw.
- *RSS*: los campos ~title~ y ~summary~/~description~ suelen venir en HTML;
  ~text_clean~ es la versión “indexable” de ese contenido.
- *Código*: ~clean_text~ transforma una cadena en texto normalizado;
  ~normalize_items~ añade a cada documento de la colección el campo ~text_clean~
  (título + resumen concatenados y limpios).

clean_text(text)~: (1) quita etiquetas HTML con ~re.sub(r"<[^>]+>", " ", text)~;
(2) deja solo letras, números y espacios con ~re.sub(r"[^\w\s]", " ", text,
flags=re.UNICODE)~; (3) colapsa espacios y pasa a minúsculas con
~.strip().lower()~. El resultado es una sola cadena en minúsculas, sin HTML ni
puntuación, lista para comparar con la consulta. ~normalize_items(items)~
recorre cada ítem de la colección, concatena título y resumen limpios en
~text_clean~ y modifica el ítem in-place. A partir de aquí, la *recuperación*
(booleana o rankeada) usará ~text_clean~, no el título/resumen originales.
Así se garantiza que la búsqueda “python” coincida con “Python” en el feed.

#+begin_src python :session irs :results output :exports both
import re

def clean_text(text):
    """Limpieza básica: quitar tags HTML, solo letras y espacios, minúsculas."""
    if not text:
        return ""
    text = re.sub(r"<[^>]+>", " ", text)
    text = re.sub(r"[^\w\s]", " ", text, flags=re.UNICODE)
    text = re.sub(r"\s+", " ", text).strip().lower()
    return text

def normalize_items(items):
    """Añade campo 'text_clean' a cada ítem (título + resumen limpios)."""
    for it in items:
        if "error" in it:
            continue
        title = it.get("title", "")
        summary = it.get("summary", "")
        it["text_clean"] = clean_text(title) + " " + clean_text(summary)
    return items

items_norm = normalize_items(items)
for i, it in enumerate(items_norm[:3]):
    if "error" not in it:
        print("--- Ítem", i+1, "---")
        print("text_clean:", it.get("text_clean", "")[:200], "...")
        print()
#+end_src

