index.html
<div id="outline-container-org5f7b4c3" class="outline-3">
<h3 id="org5f7b4c3">Limpieza de texto (normalización para el IRS)</h3>
<div class="outline-text-3" id="text-org5f7b4c3">
<p>
Los feeds RSS suelen incluir en título y resumen <b>HTML</b> (etiquetas <code>&lt;p&gt;</code>, <code>&lt;a&gt;</code>,
etc.), mayúsculas/minúsculas mezcladas y signos de puntuación. Si el IRS
busca la palabra “python” en el texto crudo, no encontrará “Python” ni
“&lt;em&gt;python&lt;/em&gt;”. La <b>normalización</b> (limpieza) hace que todos los documentos
y la consulta compartan el mismo “alfabeto”: minúsculas, sin HTML, sin
caracteres que no aporten para la búsqueda. Así la comparación consulta–documento
es consistente y el <b>modelo booleano</b> (palabras exactas) y el <b>vectorial</b> (conteo
de términos) pueden aplicarse sobre una representación uniforme del texto.
</p>


<ul class="org-ul">
<li><b>IRS</b>: la normalización es una etapa típica de <b>indexación</b>; el índice se
construye sobre el texto limpio, no sobre el raw.</li>
<li><b>RSS</b>: los campos <code>title</code> y <code>summary~/~description</code> suelen venir en HTML;
<code>text_clean</code> es la versión “indexable” de ese contenido.</li>
<li><b>Código</b>: <code>clean_text</code> transforma una cadena en texto normalizado;
<code>normalize_items</code> añade a cada documento de la colección el campo <code>text_clean</code>
(título + resumen concatenados y limpios).</li>
</ul>

<p>
clean<sub>text</sub>(text)~: (1) quita etiquetas HTML con <code>re.sub(r"&lt;[^&gt;]+&gt;", " ", text)</code>;
(2) deja solo letras, números y espacios con <code>re.sub(r"[^\w\s]", " ", text,
flags=re.UNICODE)</code>; (3) colapsa espacios y pasa a minúsculas con
<code>.strip().lower()</code>. El resultado es una sola cadena en minúsculas, sin HTML ni
puntuación, lista para comparar con la consulta. <code>normalize_items(items)</code>
recorre cada ítem de la colección, concatena título y resumen limpios en
<code>text_clean</code> y modifica el ítem in-place. A partir de aquí, la <b>recuperación</b>
(booleana o rankeada) usará <code>text_clean</code>, no el título/resumen originales.
Así se garantiza que la búsqueda “python” coincida con “Python” en el feed.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> re

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">clean_text</span><span style="color: #fe8019;">(</span>text<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Limpieza b&#225;sica: quitar tags HTML, solo letras y espacios, min&#250;sculas."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #fb4934;">not</span> text:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #b8bb26;">""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">text</span> = re.sub<span style="color: #fe8019;">(</span>r<span style="color: #b8bb26;">"&lt;[^&gt;]+&gt;"</span>, <span style="color: #b8bb26;">" "</span>, text<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">text</span> = re.sub<span style="color: #fe8019;">(</span>r<span style="color: #b8bb26;">"[^\w\s]"</span>, <span style="color: #b8bb26;">" "</span>, text, flags=re.UNICODE<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">text</span> = re.sub<span style="color: #fe8019;">(</span>r<span style="color: #b8bb26;">"\s+"</span>, <span style="color: #b8bb26;">" "</span>, text<span style="color: #fe8019;">)</span>.strip<span style="color: #fe8019;">()</span>.lower<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> text

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">normalize_items</span><span style="color: #fe8019;">(</span>items<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""A&#241;ade campo 'text_clean' a cada &#237;tem (t&#237;tulo + resumen limpios)."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> it <span style="color: #fb4934;">in</span> items:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">in</span> it:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">continue</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">title</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">summary</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"summary"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">it</span><span style="color: #fe8019;">[</span><span style="color: #b8bb26;">"text_clean"</span><span style="color: #fe8019;">]</span> = clean_text<span style="color: #fe8019;">(</span>title<span style="color: #fe8019;">)</span> + <span style="color: #b8bb26;">" "</span> + clean_text<span style="color: #fe8019;">(</span>summary<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> items

<span style="color: #83a598;">items_norm</span> = normalize_items<span style="color: #fe8019;">(</span>items<span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">for</span> i, it <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">enumerate</span><span style="color: #fe8019;">(</span>items_norm<span style="color: #b16286;">[</span>:3<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">not</span> <span style="color: #fb4934;">in</span> it:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"--- &#205;tem"</span>, i+1, <span style="color: #b8bb26;">"---"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"text_clean:"</span>, it.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"text_clean"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b16286;">)[</span>:200<span style="color: #b16286;">]</span>, <span style="color: #b8bb26;">"..."</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">()</span>
</pre>
</div>
</div>
</div>
