readme.org
** Modelo booleano: búsqueda por palabras clave


En el *modelo booleano* de recuperación, cada documento es *relevante* o *no
relevante* según cumpla o no una expresión lógica sobre los términos (AND, OR,
NOT). No hay “más o menos relevante”: es un filtro. Es el modelo más directo
para consultas del tipo “quiero ítems que contengan *todas* estas palabras”.
Sobre la colección de ítems RSS normalizados (~text_clean~), una búsqueda AND
equivale a: “devolver solo los documentos cuyo ~text_clean~ contiene cada
palabra de la consulta”. Así el IRS aplica el *proceso de recuperación*:
comparar la *consulta* (query) con cada *documento* de la colección y decidir
sí/no según el criterio booleano.

- *IRS — Proceso de recuperación*: la función que compara consulta y documentos
  implementa el *modelo booleano* (AND).
- *Consulta*: la cadena que escribe el usuario (p. ej. “python software”) se
  normaliza igual que los documentos y se divide en palabras; cada palabra debe
  aparecer en ~text_clean~.
- *RSS*: cada ítem del feed es un documento; el campo ~text_clean~ (título +
  resumen limpios) es el texto sobre el que se hace la comparación.

search_boolean_and(items, query)~ recibe la colección (lista de ítems con
~text_clean~) y la consulta en lenguaje natural. Primero se *normaliza la
consulta* con ~clean_text(query).split()~: mismas reglas que los documentos,
para que “Python Software” y “python software” den las mismas palabras. Luego
se recorre cada ítem: si ~text_clean~ contiene *todas* las palabras de la
consulta (~all(w in text for w in words)~), el documento se considera relevante
y se añade a ~results~. La lista devuelta es el *conjunto recuperado*: documentos
que pasan el filtro booleano. No hay orden de relevancia; si se quisiera
ordenar, se usaría un modelo con score (p. ej. el ranking siguiente).

#+begin_src python :session irs :results output :exports both
def search_boolean_and(items, query):
    """Recupera ítems donde text_clean contiene TODAS las palabras de query."""
    words = clean_text(query).split()
    results = []
    for it in items:
        if "error" in it:
            continue
        text = it.get("text_clean", "")
        if all(w in text for w in words):
            results.append(it)
    return results

query = "python software"
found = search_boolean_and(items_norm, query)
print("Consulta:", repr(query))
print("Resultados:", len(found))
for it in found[:5]:
    print("-", it.get("title", "")[:60])
#+end_src

