index.html
<div id="outline-container-org4d34ed7" class="outline-3">
<h3 id="org4d34ed7">Modelo booleano: búsqueda por palabras clave</h3>
<div class="outline-text-3" id="text-org4d34ed7">
<p>
En el <b>modelo booleano</b> de recuperación, cada documento es <b>relevante</b> o <b>no
relevante</b> según cumpla o no una expresión lógica sobre los términos (AND, OR,
NOT). No hay “más o menos relevante”: es un filtro. Es el modelo más directo
para consultas del tipo “quiero ítems que contengan <b>todas</b> estas palabras”.
Sobre la colección de ítems RSS normalizados (<code>text_clean</code>), una búsqueda AND
equivale a: “devolver solo los documentos cuyo <code>text_clean</code> contiene cada
palabra de la consulta”. Así el IRS aplica el <b>proceso de recuperación</b>:
comparar la <b>consulta</b> (query) con cada <b>documento</b> de la colección y decidir
sí/no según el criterio booleano.
</p>

<ul class="org-ul">
<li><b>IRS — Proceso de recuperación</b>: la función que compara consulta y documentos
implementa el <b>modelo booleano</b> (AND).</li>
<li><b>Consulta</b>: la cadena que escribe el usuario (p. ej. “python software”) se
normaliza igual que los documentos y se divide en palabras; cada palabra debe
aparecer en <code>text_clean</code>.</li>
<li><b>RSS</b>: cada ítem del feed es un documento; el campo <code>text_clean</code> (título +
resumen limpios) es el texto sobre el que se hace la comparación.</li>
</ul>

<p>
search<sub>boolean</sub><sub>and</sub>(items, query)~ recibe la colección (lista de ítems con
<code>text_clean</code>) y la consulta en lenguaje natural. Primero se <b>normaliza la
consulta</b> con <code>clean_text(query).split()</code>: mismas reglas que los documentos,
para que “Python Software” y “python software” den las mismas palabras. Luego
se recorre cada ítem: si <code>text_clean</code> contiene <b>todas</b> las palabras de la
consulta (<code>all(w in text for w in words)</code>), el documento se considera relevante
y se añade a <code>results</code>. La lista devuelta es el <b>conjunto recuperado</b>: documentos
que pasan el filtro booleano. No hay orden de relevancia; si se quisiera
ordenar, se usaría un modelo con score (p. ej. el ranking siguiente).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">search_boolean_and</span><span style="color: #fe8019;">(</span>items, query<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Recupera &#237;tems donde text_clean contiene TODAS las palabras de query."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">words</span> = clean_text<span style="color: #fe8019;">(</span>query<span style="color: #fe8019;">)</span>.split<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">results</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> it <span style="color: #fb4934;">in</span> items:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">in</span> it:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">continue</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">text</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"text_clean"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #fe8019;">all</span><span style="color: #fe8019;">(</span>w <span style="color: #fb4934;">in</span> text <span style="color: #fb4934;">for</span> w <span style="color: #fb4934;">in</span> words<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   results.append<span style="color: #fe8019;">(</span>it<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> results

<span style="color: #83a598;">query</span> = <span style="color: #b8bb26;">"python software"</span>
<span style="color: #83a598;">found</span> = search_boolean_and<span style="color: #fe8019;">(</span>items_norm, query<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Consulta:"</span>, <span style="color: #fe8019;">repr</span><span style="color: #b16286;">(</span>query<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Resultados:"</span>, <span style="color: #fe8019;">len</span><span style="color: #b16286;">(</span>found<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">for</span> it <span style="color: #fb4934;">in</span> found<span style="color: #fe8019;">[</span>:5<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"-"</span>, it.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b16286;">)[</span>:60<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
