readme.org
** Ranking simple (modelo tipo vectorial)
 
El modelo booleano devuelve un conjunto sin orden: todos los documentos
recuperados son “igual de relevantes”. En la práctica el usuario espera ver
*primero* los más relevantes. El *modelo vectorial* (y variantes) asigna a
cada documento un *score* de relevancia y ordena por ese score. Una
simplificación muy usada es contar cuántas veces aparecen los términos de la
consulta en el documento (*term frequency*, TF): más apariciones suelen indicar
mayor relevancia. Así el IRS no solo filtra (sí/no) sino que *rankea* los
resultados; la interfaz puede mostrar los ~top_k~ primeros. En feeds RSS, los
ítems con más menciones de las palabras buscadas en título y resumen aparecen
arriba.

- *IRS — Modelo de recuperación*: aquí se implementa un *ranking* inspirado en
  el modelo vectorial (score por conteo de términos en ~text_clean~).
- *Consulta*: se normaliza y se divide en palabras; cada palabra contribuye al
  score del documento.
- *RSS*: cada ítem tiene ~text_clean~; el score es la suma de las frecuencias
  de los términos de la consulta en ese texto. Los ítems se ordenan por score
  descendente.

search_ranked(items, query, top_k)~ recibe la colección normalizada, la
consulta y cuántos resultados devolver. Para cada ítem se calcula ~score~ como
~sum(text.split().count(w) for w in words)~: número total de apariciones de
cualquier término de la consulta en ~text_clean~. Solo se consideran documentos
con score > 0. Se ordena la lista ~(score, ítem)~ por score descendente
(~key=lambda x: -x[0]~) y se devuelven los primeros ~top_k~ ítems. Así la
salida es una *lista ordenada por relevancia*: el primer elemento es el que más
coincide con la consulta. Es una versión simplificada de TF (sin IDF ni
normalización por longitud); suficiente para ilustrar el concepto de ranking
en un IRS sobre feeds RSS.

#+begin_src python :session irs :results output :exports both
def search_ranked(items, query, top_k=10):
    """Recupera ítems rankeados por número de apariciones de términos de la consulta."""
    words = clean_text(query).split()
    if not words:
        return []
    scored = []
    for it in items:
        if "error" in it:
            continue
        text = it.get("text_clean", "")
        score = sum(text.split().count(w) for w in words)
        if score > 0:
            scored.append((score, it))
    scored.sort(key=lambda x: -x[0])
    return [it for _, it in scored[:top_k]]

query2 = "python release"
ranked = search_ranked(items_norm, query2, top_k=5)
print("Consulta:", repr(query2))
for i, it in enumerate(ranked, 1):
    title = it.get("title", "")[:55]
    print(i, "-", title)
#+end_src

