index.html
<div id="outline-container-org64d282a" class="outline-3">
<h3 id="org64d282a">Ranking simple (modelo tipo vectorial)</h3>
<div class="outline-text-3" id="text-org64d282a">
<p>
El modelo booleano devuelve un conjunto sin orden: todos los documentos
recuperados son “igual de relevantes”. En la práctica el usuario espera ver
<b>primero</b> los más relevantes. El <b>modelo vectorial</b> (y variantes) asigna a
cada documento un <b>score</b> de relevancia y ordena por ese score. Una
simplificación muy usada es contar cuántas veces aparecen los términos de la
consulta en el documento (<b>term frequency</b>, TF): más apariciones suelen indicar
mayor relevancia. Así el IRS no solo filtra (sí/no) sino que <b>rankea</b> los
resultados; la interfaz puede mostrar los <code>top_k</code> primeros. En feeds RSS, los
ítems con más menciones de las palabras buscadas en título y resumen aparecen
arriba.
</p>

<ul class="org-ul">
<li><b>IRS — Modelo de recuperación</b>: aquí se implementa un <b>ranking</b> inspirado en
el modelo vectorial (score por conteo de términos en <code>text_clean</code>).</li>
<li><b>Consulta</b>: se normaliza y se divide en palabras; cada palabra contribuye al
score del documento.</li>
<li><b>RSS</b>: cada ítem tiene <code>text_clean</code>; el score es la suma de las frecuencias
de los términos de la consulta en ese texto. Los ítems se ordenan por score
descendente.</li>
</ul>

<p>
search<sub>ranked</sub>(items, query, top<sub>k</sub>)~ recibe la colección normalizada, la
consulta y cuántos resultados devolver. Para cada ítem se calcula <code>score</code> como
<code>sum(text.split().count(w) for w in words)</code>: número total de apariciones de
cualquier término de la consulta en <code>text_clean</code>. Solo se consideran documentos
con score &gt; 0. Se ordena la lista <code>(score, ítem)</code> por score descendente
(<code>key=lambda x: -x[0]</code>) y se devuelven los primeros <code>top_k</code> ítems. Así la
salida es una <b>lista ordenada por relevancia</b>: el primer elemento es el que más
coincide con la consulta. Es una versión simplificada de TF (sin IDF ni
normalización por longitud); suficiente para ilustrar el concepto de ranking
en un IRS sobre feeds RSS.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">search_ranked</span><span style="color: #fe8019;">(</span>items, query, top_k=10<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Recupera &#237;tems rankeados por n&#250;mero de apariciones de t&#233;rminos de la consulta."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">words</span> = clean_text<span style="color: #fe8019;">(</span>query<span style="color: #fe8019;">)</span>.split<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #fb4934;">not</span> words:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">scored</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> it <span style="color: #fb4934;">in</span> items:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">in</span> it:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">continue</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">text</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"text_clean"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">score</span> = <span style="color: #fe8019;">sum</span><span style="color: #fe8019;">(</span>text.split<span style="color: #b16286;">()</span>.count<span style="color: #b16286;">(</span>w<span style="color: #b16286;">)</span> <span style="color: #fb4934;">for</span> w <span style="color: #fb4934;">in</span> words<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> score &gt; 0:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   scored.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">(</span>score, it<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   scored.sort<span style="color: #fe8019;">(</span>key=<span style="color: #fb4934;">lambda</span> x: -x<span style="color: #b16286;">[</span>0<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #fe8019;">[</span>it <span style="color: #fb4934;">for</span> _, it <span style="color: #fb4934;">in</span> scored<span style="color: #b16286;">[</span>:top_k<span style="color: #b16286;">]</span><span style="color: #fe8019;">]</span>

<span style="color: #83a598;">query2</span> = <span style="color: #b8bb26;">"python release"</span>
<span style="color: #83a598;">ranked</span> = search_ranked<span style="color: #fe8019;">(</span>items_norm, query2, top_k=5<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Consulta:"</span>, <span style="color: #fe8019;">repr</span><span style="color: #b16286;">(</span>query2<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">for</span> i, it <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">enumerate</span><span style="color: #fe8019;">(</span>ranked, 1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">title</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)[</span>:55<span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>i, <span style="color: #b8bb26;">"-"</span>, title<span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
