readme.org
** Interfaz de resultados
  
En un IRS la *interfaz* es el medio por el que el usuario formula la consulta
y *ve los resultados*. Sin una presentación clara de los documentos recuperados,
el sistema no es usable. En un buscador web típico la interfaz muestra título,
enlace, fecha y a veces un snippet. En nuestro flujo con feeds RSS y Org-mode,
la “pantalla” de resultados puede ser una *tabla Org*: cada fila es un ítem
recuperado (por búsqueda booleana o rankeada), con columnas como número de
orden, título, URL y fecha. Así se cierra el ciclo IRS: colección → consulta →
recuperación → *presentación* al usuario.

- *IRS — Interfaz*: la tabla generada es la *vista de resultados* del sistema;
  el usuario ve qué documentos se recuperaron y puede acceder al enlace (RSS
  ~link~) de cada ítem.
- *RSS*: los campos mostrados (título, enlace, fecha) vienen directamente del
  feed; el orden de las filas viene del *modelo de recuperación* (ranking o
  filtro booleano).
- *Código*: ~results_to_org_table~ transforma la lista de ítems (salida de
  ~search_ranked~ o ~search_boolean_and~) en líneas de tabla Org.

results_to_org_table(items_list)~ recibe la lista de ítems ya recuperados
(ordenados por score si vienen de ~search_ranked~). Construye la cabecera de
la tabla Org (~| # | Título | Enlace | Fecha |~) y el separador (~|---+...~).
Para cada ítem añade una fila: posición (~i~), título truncado a 50 caracteres,
~link~ (URL del ítem en el feed) y fecha truncada a 20 caracteres. El resultado
es una cadena con las líneas de la tabla; en Org-mode se puede insertar en el
buffer o exportar. Así el documento Org actúa como “pantalla” del IRS: el usuario
ve el listado rankeado de ítems RSS con enlaces clicables.

#+begin_src python :session irs :results value :exports both
def results_to_org_table(items_list):
    """Genera líneas de tabla Org (| col1 | col2 | col3 |)."""
    lines = ["| # | Título | Enlace | Fecha |", "|---+--------+--------+-------|"]
    for i, it in enumerate(items_list, 1):
        if "error" in it:
            continue
        title = (it.get("title", "") or "")[:50]
        link = it.get("link", "")
        pub = (it.get("published", "") or "")[:20]
        lines.append(f"| {i} | {title} | {link} | {pub} |")
    return "\n".join(lines)

org_table = results_to_org_table(ranked)
print(org_table)
#+end_src

** Pipeline completo del IRS con RSS

Un IRS real encadena varias etapas: obtener la colección, indexar/normalizar,
recibir la consulta, aplicar el modelo de recuperación y presentar los
resultados. Integrar todo en un *pipeline* (una sola función o flujo) permite
ver de un vistazo cómo se relacionan los componentes del IRS con los feeds RSS:
URL del feed → colección; consulta del usuario → proceso de recuperación;
lista rankeada → interfaz (tabla). Así se evidencia que el IRS no es solo
“búsqueda”, sino *colección + consulta + modelo + interfaz*.

*** Relación IRS ↔ feeds RSS en el pipeline
| Componente IRS      | En el pipeline con RSS                          |
|---------------------+-------------------------------------------------|
| Colección           | ~fetch_rss(feed_url)~ → ítems del feed          |
| Normalización       | ~normalize_items(raw)~ → ~text_clean~ por ítem |
| Consulta            | Parámetro ~query~ (cadena del usuario)           |
| Modelo recuperación | ~search_ranked(normalized, query, top_k)~       |
| Interfaz            | ~results_to_org_table(resultados)~ → tabla Org  |

