index.html
<div id="outline-container-org160d79c" class="outline-3">
<h3 id="org160d79c">Interfaz de resultados</h3>
<div class="outline-text-3" id="text-org160d79c">
<p>
En un IRS la <b>interfaz</b> es el medio por el que el usuario formula la consulta
y <b>ve los resultados</b>. Sin una presentación clara de los documentos recuperados,
el sistema no es usable. En un buscador web típico la interfaz muestra título,
enlace, fecha y a veces un snippet. En nuestro flujo con feeds RSS y Org-mode,
la “pantalla” de resultados puede ser una <b>tabla Org</b>: cada fila es un ítem
recuperado (por búsqueda booleana o rankeada), con columnas como número de
orden, título, URL y fecha. Así se cierra el ciclo IRS: colección → consulta →
recuperación → <b>presentación</b> al usuario.
</p>

<ul class="org-ul">
<li><b>IRS — Interfaz</b>: la tabla generada es la <b>vista de resultados</b> del sistema;
el usuario ve qué documentos se recuperaron y puede acceder al enlace (RSS
<code>link</code>) de cada ítem.</li>
<li><b>RSS</b>: los campos mostrados (título, enlace, fecha) vienen directamente del
feed; el orden de las filas viene del <b>modelo de recuperación</b> (ranking o
filtro booleano).</li>
<li><b>Código</b>: <code>results_to_org_table</code> transforma la lista de ítems (salida de
<code>search_ranked</code> o <code>search_boolean_and</code>) en líneas de tabla Org.</li>
</ul>

<p>
results<sub>to</sub><sub>org</sub><sub>table</sub>(items<sub>list</sub>)~ recibe la lista de ítems ya recuperados
(ordenados por score si vienen de <code>search_ranked</code>). Construye la cabecera de
la tabla Org (<code>| # | Título | Enlace | Fecha |</code>) y el separador (<code>|---+...</code>).
Para cada ítem añade una fila: posición (<code>i</code>), título truncado a 50 caracteres,
<code>link</code> (URL del ítem en el feed) y fecha truncada a 20 caracteres. El resultado
es una cadena con las líneas de la tabla; en Org-mode se puede insertar en el
buffer o exportar. Así el documento Org actúa como “pantalla” del IRS: el usuario
ve el listado rankeado de ítems RSS con enlaces clicables.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">results_to_org_table</span><span style="color: #fe8019;">(</span>items_list<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Genera l&#237;neas de tabla Org (| col1 | col2 | col3 |)."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">lines</span> = <span style="color: #fe8019;">[</span><span style="color: #b8bb26;">"| # | T&#237;tulo | Enlace | Fecha |"</span>, <span style="color: #b8bb26;">"|---+--------+--------+-------|"</span><span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> i, it <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">enumerate</span><span style="color: #fe8019;">(</span>items_list, 1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">in</span> it:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">continue</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">title</span> = <span style="color: #fe8019;">(</span>it.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"title"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b16286;">)</span> <span style="color: #fb4934;">or</span> <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)[</span>:50<span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">link</span> = it.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"link"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">pub</span> = <span style="color: #fe8019;">(</span>it.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"published"</span>, <span style="color: #b8bb26;">""</span><span style="color: #b16286;">)</span> <span style="color: #fb4934;">or</span> <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)[</span>:20<span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   lines.append<span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"| </span>{i}<span style="color: #b8bb26;"> | </span>{title}<span style="color: #b8bb26;"> | </span>{link}<span style="color: #b8bb26;"> | </span>{pub}<span style="color: #b8bb26;"> |"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #b8bb26;">"</span><span style="color: #d3869b;">\n</span><span style="color: #b8bb26;">"</span>.join<span style="color: #fe8019;">(</span>lines<span style="color: #fe8019;">)</span>

<span style="color: #83a598;">org_table</span> = results_to_org_table<span style="color: #fe8019;">(</span>ranked<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>org_table<span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf432c63" class="outline-3">
<h3 id="orgf432c63">Pipeline completo del IRS con RSS</h3>
<div class="outline-text-3" id="text-orgf432c63">
<p>
Un IRS real encadena varias etapas: obtener la colección, indexar/normalizar,
recibir la consulta, aplicar el modelo de recuperación y presentar los
resultados. Integrar todo en un <b>pipeline</b> (una sola función o flujo) permite
ver de un vistazo cómo se relacionan los componentes del IRS con los feeds RSS:
URL del feed → colección; consulta del usuario → proceso de recuperación;
lista rankeada → interfaz (tabla). Así se evidencia que el IRS no es solo
“búsqueda”, sino <b>colección + consulta + modelo + interfaz</b>.
</p>
</div>
<div id="outline-container-orga569345" class="outline-4">
<h4 id="orga569345">Relación IRS ↔ feeds RSS en el pipeline</h4>
<div class="outline-text-4" id="text-orga569345">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Componente IRS</th>
<th scope="col" class="org-left">En el pipeline con RSS</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Colección</td>
<td class="org-left"><code>fetch_rss(feed_url)</code> → ítems del feed</td>
</tr>

<tr>
<td class="org-left">Normalización</td>
<td class="org-left"><code>normalize_items(raw)</code> → <code>text_clean</code> por ítem</td>
</tr>

<tr>
<td class="org-left">Consulta</td>
<td class="org-left">Parámetro <code>query</code> (cadena del usuario)</td>
</tr>

<tr>
<td class="org-left">Modelo recuperación</td>
<td class="org-left"><code>search_ranked(normalized, query, top_k)</code></td>
</tr>

<tr>
<td class="org-left">Interfaz</td>
<td class="org-left"><code>results_to_org_table(resultados)</code> → tabla Org</td>
</tr>
</tbody>
</table>
</div>
</div>
