readme.org
*** Explicación del código
~irs_pipeline(feed_url, query, max_entries, top_k)~ encadena: (1) ~fetch_rss~
descarga y parsea el feed y devuelve la lista de ítems (colección en bruto);
(2) si hay error, se devuelve el mensaje; (3) ~normalize_items~ añade
~text_clean~ a cada ítem; (4) ~search_ranked~ aplica el modelo de recuperación
(ranking por conteo de términos) y devuelve los ~top_k~ ítems más relevantes;
(5) opcionalmente se pasa esa lista a ~results_to_org_table~ para generar la
vista. Una sola llamada con URL de feed y consulta produce la tabla de
resultados que el usuario vería en la interfaz. Así queda explícito el flujo
completo: feed RSS → colección → normalización → consulta → ranking →
presentación.

#+begin_src python :session irs :results output :exports both
def irs_pipeline(feed_url, query, max_entries=20, top_k=5):
    """Pipeline: fetch → normalizar → búsqueda rankeada → resultados."""
    raw = fetch_rss(feed_url, max_entries=max_entries)
    if raw and "error" in raw[0]:
        return raw
    normalized = normalize_items(raw)
    results = search_ranked(normalized, query, top_k=top_k)
    return results

url_ejemplo = "https://pyfound.blogspot.com/feeds/posts/default?alt=rss"
consulta = "python foundation"
resultados = irs_pipeline(url_ejemplo, consulta, max_entries=15, top_k=5)
print("Feed:", url_ejemplo)
print("Consulta:", consulta)
print(results_to_org_table(resultados))
#+end_src



* Introducción a XPath

*XPath* (XML Path Language) es un lenguaje para localizar nodos y extraer valores en
documentos XML y HTML. Se usa en transformaciones XSLT, scraping web, APIs y consultas
a documentos estructurados.

** ¿Para qué sirve?
- Navegar por la estructura de un árbol XML/HTML.
- Seleccionar elementos por etiqueta, atributo, posición o relación jerárquica.
- Extraer texto, atributos o fragmentos concretos.
- Usarse desde Python (=lxml=, =BeautifulSoup=), JavaScript (=document.evaluate=), etc.

