index.html
<div id="outline-container-org7080eb1" class="outline-4">
<h4 id="org7080eb1">Explicación del código</h4>
<div class="outline-text-4" id="text-org7080eb1">
<p>
<code>irs_pipeline(feed_url, query, max_entries, top_k)</code> encadena: (1) <code>fetch_rss</code>
descarga y parsea el feed y devuelve la lista de ítems (colección en bruto);
(2) si hay error, se devuelve el mensaje; (3) <code>normalize_items</code> añade
<code>text_clean</code> a cada ítem; (4) <code>search_ranked</code> aplica el modelo de recuperación
(ranking por conteo de términos) y devuelve los <code>top_k</code> ítems más relevantes;
(5) opcionalmente se pasa esa lista a <code>results_to_org_table</code> para generar la
vista. Una sola llamada con URL de feed y consulta produce la tabla de
resultados que el usuario vería en la interfaz. Así queda explícito el flujo
completo: feed RSS → colección → normalización → consulta → ranking →
presentación.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">irs_pipeline</span><span style="color: #fe8019;">(</span>feed_url, query, max_entries=20, top_k=5<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Pipeline: fetch &#8594; normalizar &#8594; b&#250;squeda rankeada &#8594; resultados."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">raw</span> = fetch_rss<span style="color: #fe8019;">(</span>feed_url, max_entries=max_entries<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> raw <span style="color: #fb4934;">and</span> <span style="color: #b8bb26;">"error"</span> <span style="color: #fb4934;">in</span> raw<span style="color: #fe8019;">[</span>0<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> raw
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">normalized</span> = normalize_items<span style="color: #fe8019;">(</span>raw<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">results</span> = search_ranked<span style="color: #fe8019;">(</span>normalized, query, top_k=top_k<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> results

<span style="color: #83a598;">url_ejemplo</span> = <span style="color: #b8bb26;">"https://pyfound.blogspot.com/feeds/posts/default?alt=rss"</span>
<span style="color: #83a598;">consulta</span> = <span style="color: #b8bb26;">"python foundation"</span>
<span style="color: #83a598;">resultados</span> = irs_pipeline<span style="color: #fe8019;">(</span>url_ejemplo, consulta, max_entries=15, top_k=5<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Feed:"</span>, url_ejemplo<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Consulta:"</span>, consulta<span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>results_to_org_table<span style="color: #b16286;">(</span>resultados<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org073c9ad" class="outline-2">
<h2 id="org073c9ad">Introducción a XPath</h2>
<div class="outline-text-2" id="text-org073c9ad">
<p>
<b>XPath</b> (XML Path Language) es un lenguaje para localizar nodos y extraer valores en
documentos XML y HTML. Se usa en transformaciones XSLT, scraping web, APIs y consultas
a documentos estructurados.
</p>
</div>
<div id="outline-container-org52961a1" class="outline-3">
<h3 id="org52961a1">¿Para qué sirve?</h3>
<div class="outline-text-3" id="text-org52961a1">
<ul class="org-ul">
<li>Navegar por la estructura de un árbol XML/HTML.</li>
<li>Seleccionar elementos por etiqueta, atributo, posición o relación jerárquica.</li>
<li>Extraer texto, atributos o fragmentos concretos.</li>
<li>Usarse desde Python (<code>lxml</code>, <code>BeautifulSoup</code>), JavaScript (<code>document.evaluate</code>), etc.</li>
</ul>
</div>
</div>
