readme.org
** Documento de ejemplo

En esta parte usaremos este XML ficticio como referencia:

#+BEGIN_SRC xml
<?xml version="1.0" encoding="UTF-8"?>
<catalogo>
  <libro id="1" categoria="ficcion">
    <titulo>Don Quijote</titulo>
    <autor>Cervantes</autor>
    <precio moneda="EUR">12.50</precio>
    <anio>1605</anio>
  </libro>
  <libro id="2" categoria="tecnica">
    <titulo>Introducción a XPath</titulo>
    <autor>Ana García</autor>
    <precio moneda="USD">25.00</precio>
    <anio>2023</anio>
  </libro>
  <libro id="3" categoria="ficcion">
    <titulo>Cien años de soledad</titulo>
    <autor>García Márquez</autor>
    <precio moneda="EUR">14.00</precio>
    <anio>1967</anio>
  </libro>
</catalogo>
#+END_SRC

** Sintaxis básica

*** Rutas absolutas y relativas

**** Ruta absoluta
Empieza en la raíz del documento con =/=:

#+BEGIN_EXAMPLE
/catalogo/libro
#+END_EXAMPLE

Selecciona todos los elementos =<libro>= que son hijos directos de =<catalogo>=.

**** Ruta relativa
Se evalúa desde el nodo actual (contexto):

#+BEGIN_EXAMPLE
libro/titulo
#+END_EXAMPLE

Desde el contexto actual, selecciona =<titulo>= dentro de =<libro>=.

*** Seleccionar por etiqueta

| XPath           | Descripción                        |
|-----------------+------------------------------------|
| =/catalogo=       | Elemento raíz =catalogo=             |
| =/catalogo/libro= | Todos los =libro= hijos de =catalogo=  |
| =//libro=         | Todos los =libro= en cualquier nivel |
| =//titulo=        | Todos los =titulo= en el documento   |

**** Diferencia entre =/= y =//=
- =/= :: Solo hijos *directos* (un nivel).
- =//= :: Descendientes en *cualquier nivel*.

#+BEGIN_EXAMPLE
/catalogo/libro/titulo   → titulos que son nietos de catalogo (1 nivel)
//titulo                 → todos los titulos del documento
#+END_EXAMPLE

** Predicados
:PROPERTIES:
:UNNUMBERED: t
:END:

Los *predicados* =[...]= filtran nodos según una condición.

*** Por posición

| XPath                    | Descripción                    |
|--------------------------+--------------------------------|
| =/catalogo/libro[1]=     | Primer =libro= (índice desde 1) |
| =/catalogo/libro[last()]=| Último =libro=                 |
| =/catalogo/libro[position()<=2]= | Los dos primeros       |

**** Nota sobre índices
En XPath, los índices empiezan en *1*, no en 0.

