index.html
<div id="outline-container-org2e98948" class="outline-3">
<h3 id="org2e98948">Documento de ejemplo</h3>
<div class="outline-text-3" id="text-org2e98948">
<p>
En esta parte usaremos este XML ficticio como referencia:
</p>

<div class="org-src-container">
<pre class="src src-xml"><span style="color: #ebdbb2; background-color: #282828;">&lt;?</span><span style="color: #fb4934;">xml</span> <span style="color: #dfd2b8;">version="1.0" encoding="UTF-8"</span><span style="color: #ebdbb2; background-color: #282828;">?&gt;</span>
<span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">catalogo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">libro</span> <span style="color: #83a598;">id</span>=<span style="color: #b8bb26;">"1"</span> <span style="color: #83a598;">categoria</span>=<span style="color: #b8bb26;">"ficcion"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Don Quijote</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Cervantes</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">precio</span> <span style="color: #83a598;">moneda</span>=<span style="color: #b8bb26;">"EUR"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">12.50</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">precio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">1605</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">libro</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">libro</span> <span style="color: #83a598;">id</span>=<span style="color: #b8bb26;">"2"</span> <span style="color: #83a598;">categoria</span>=<span style="color: #b8bb26;">"tecnica"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Introducci&#243;n a XPath</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Ana Garc&#237;a</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">precio</span> <span style="color: #83a598;">moneda</span>=<span style="color: #b8bb26;">"USD"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">25.00</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">precio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">2023</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">libro</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">libro</span> <span style="color: #83a598;">id</span>=<span style="color: #b8bb26;">"3"</span> <span style="color: #83a598;">categoria</span>=<span style="color: #b8bb26;">"ficcion"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Cien a&#241;os de soledad</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">titulo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">Garc&#237;a M&#225;rquez</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">autor</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">precio</span> <span style="color: #83a598;">moneda</span>=<span style="color: #b8bb26;">"EUR"</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">14.00</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">precio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
    <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span><span style="color: #ebdbb2; background-color: #282828;">1967</span><span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">anio</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
  <span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">libro</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
<span style="color: #ebdbb2; background-color: #282828;">&lt;</span><span style="color: #ebdbb2; background-color: #282828;">/</span><span style="color: #b8bb26;">catalogo</span><span style="color: #ebdbb2; background-color: #282828;">&gt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb2425a2" class="outline-3">
<h3 id="orgb2425a2">Sintaxis básica</h3>
<div class="outline-text-3" id="text-orgb2425a2">
</div>
<div id="outline-container-org6a51cff" class="outline-4">
<h4 id="org6a51cff">Rutas absolutas y relativas</h4>
<div class="outline-text-4" id="text-org6a51cff">
</div>
<ul class="org-ul">
<li><a id="orga0b2d27"></a>Ruta absoluta<br />
<div class="outline-text-5" id="text-orga0b2d27">
<p>
Empieza en la raíz del documento con <code>/</code>:
</p>

<pre class="example" id="orgc946470">
/catalogo/libro
</pre>

<p>
Selecciona todos los elementos <code>&lt;libro&gt;</code> que son hijos directos de <code>&lt;catalogo&gt;</code>.
</p>
</div>
</li>
<li><a id="orgc5e9f00"></a>Ruta relativa<br />
<div class="outline-text-5" id="text-orgc5e9f00">
<p>
Se evalúa desde el nodo actual (contexto):
</p>

<pre class="example" id="org33f7d4c">
libro/titulo
</pre>

<p>
Desde el contexto actual, selecciona <code>&lt;titulo&gt;</code> dentro de <code>&lt;libro&gt;</code>.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5f0b4fb" class="outline-4">
<h4 id="org5f0b4fb">Seleccionar por etiqueta</h4>
<div class="outline-text-4" id="text-org5f0b4fb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">XPath</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/catalogo</code></td>
<td class="org-left">Elemento raíz <code>catalogo</code></td>
</tr>

<tr>
<td class="org-left"><code>/catalogo/libro</code></td>
<td class="org-left">Todos los <code>libro</code> hijos de <code>catalogo</code></td>
</tr>

<tr>
<td class="org-left"><code>//libro</code></td>
<td class="org-left">Todos los <code>libro</code> en cualquier nivel</td>
</tr>

<tr>
<td class="org-left"><code>//titulo</code></td>
<td class="org-left">Todos los <code>titulo</code> en el documento</td>
</tr>
</tbody>
</table>
</div>
<ul class="org-ul">
<li><a id="org921b332"></a>Diferencia entre <code>/</code> y <code>//</code><br />
<div class="outline-text-5" id="text-org921b332">
<dl class="org-dl">
<dt><code>/</code></dt><dd>Solo hijos <b>directos</b> (un nivel).</dd>
<dt><code>//</code></dt><dd>Descendientes en <b>cualquier nivel</b>.</dd>
</dl>

<pre class="example" id="org6b110c3">
/catalogo/libro/titulo   → titulos que son nietos de catalogo (1 nivel)
//titulo                 → todos los titulos del documento
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7c6c65" class="outline-3">
<h3 id="orgc7c6c65">Predicados</h3>
<div class="outline-text-3" id="text-orgc7c6c65">
<p>
Los <b>predicados</b> <code>[...]</code> filtran nodos según una condición.
</p>
</div>
<div id="outline-container-orgd910339" class="outline-4">
<h4 id="orgd910339">Por posición</h4>
<div class="outline-text-4" id="text-orgd910339">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">XPath</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/catalogo/libro[1]</code></td>
<td class="org-left">Primer <code>libro</code> (índice desde 1)</td>
</tr>

<tr>
<td class="org-left"><code>/catalogo/libro[last()]</code></td>
<td class="org-left">Último <code>libro</code></td>
</tr>

<tr>
<td class="org-left"><code>/catalogo/libro[position()&lt;=2]</code></td>
<td class="org-left">Los dos primeros</td>
</tr>
</tbody>
</table>
</div>
<ul class="org-ul">
<li><a id="org0dba391"></a>Nota sobre índices<br />
<div class="outline-text-5" id="text-org0dba391">
<p>
En XPath, los índices empiezan en <b>1</b>, no en 0.
</p>
</div>
</li>
</ul>
</div>
