readme.org
*** Por atributo

| XPath                           | Descripción                          |
|---------------------------------+--------------------------------------|
| =//libro[@id]=                  | Libros que tienen atributo =id=      |
| =//libro[@id="2"]=              | Libro con =id="2"=                   |
| =//libro[@categoria="ficcion"]= | Libros de categoría ficción          |
| =//precio[@moneda="EUR"]=       | Precios en euros                     |
| =//libro[@id>1]=                | Libros con id numérico mayor que 1   |

*** Por contenido de texto

| XPath                           | Descripción                          |
|---------------------------------+--------------------------------------|
| =//titulo[text()="Don Quijote"]= | Título con ese texto exacto         |
| =//titulo[contains(., "años")]=  | Títulos que contienen "años"        |
| =//autor[starts-with(., "Gar")]= | Autores que empiezan por "Gar"      |
| =//libro[precio>13]=             | Libros cuyo precio es mayor que 13  |

El punto =.= representa el nodo actual (el texto del elemento en muchos contextos).

** Ejes
:PROPERTIES:
:UNNUMBERED: t
:END:

Los *ejes* definen la relación entre nodos. Sintaxis: =eje::paso=.

*** Ejes más usados

| Eje                 | Abreviatura   | Descripción                     |
|---------------------+---------------+---------------------------------|
| =child::=             | (por defecto) | Hijos directos                  |
| =descendant::=        | =//=            | Descendientes (cualquier nivel) |
| =parent::=            | =../=           | Padre                           |
| =ancestor::=          |               | Antepasados                     |
| =following-sibling::= |               | Hermanos siguientes             |
| =preceding-sibling::= |               | Hermanos anteriores             |
| =attribute::=         | =@=             | Atributos                       |

*** Ejemplos con ejes

#+BEGIN_EXAMPLE
/catalogo/child::libro          → igual que /catalogo/libro
//titulo/parent::libro          → libros que contienen un titulo
//libro[1]/following-sibling::libro  → hermanos siguientes del primer libro
//libro/@id                     → atributo id de cada libro
#+END_EXAMPLE

** Funciones útiles
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Funciones de texto

| Función              | Uso                      | Ejemplo                              |
|----------------------+--------------------------+--------------------------------------|
| =text()=             | Texto del nodo           | =//titulo/text()=                    |
| =normalize-space(s)= | Quita espacios extra     | =normalize-space(//titulo[1])=       |
| =contains(s, sub)=   | ¿s contiene sub?         | =//titulo[contains(., "Quijote")]=   |
| =starts-with(s, pre)=| ¿s empieza por pre?      | =//autor[starts-with(., "C")]=       |
| =substring(s, i, n)= | Subcadena desde i, n chars | =substring(//titulo[1], 1, 3)=    |
| =concat(s1, s2)=     | Concatenar strings       | =concat(//titulo[1], " - ", //autor[1])= |

*** Funciones numéricas

| Función        | Uso                    |
|----------------+------------------------|
| =count(nodeset)= | Número de nodos      |
| =sum(nodeset)=   | Suma de valores      |
| =position()=     | Posición en el contexto |
| =last()=         | Última posición      |

#+BEGIN_EXAMPLE
count(//libro)           → 3
sum(//precio)            → 51.50 (si los precios son números)
//libro[position()=last()]
#+END_EXAMPLE

*** Funciones de tipo

| Función      | Uso                         |
|--------------+-----------------------------|
| =name()=     | Nombre de la etiqueta       |
| =local-name()= | Nombre local (sin prefijo) |
| =string-length(s)= | Longitud de la cadena   |

** Operadores y combinaciones
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Operadores lógicos

#+BEGIN_EXAMPLE
//libro[@categoria="ficcion" and precio>12]
//libro[@categoria="ficcion" or @categoria="tecnica"]
//titulo[not(contains(., "años"))]
#+END_EXAMPLE

*** Unión de conjuntos (|)

#+BEGIN_EXAMPLE
//titulo | //autor
#+END_EXAMPLE

Devuelve todos los elementos =titulo= y =autor=.

*** Operadores de comparación

= = =, =!= =, =< =, =<= =, => =, =>= =

