index.html
<div id="outline-container-orga329c91" class="outline-4">
<h4 id="orga329c91">Por atributo</h4>
<div class="outline-text-4" id="text-orga329c91">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">XPath</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>//libro[@id]</code></td>
<td class="org-left">Libros que tienen atributo <code>id</code></td>
</tr>

<tr>
<td class="org-left"><code>//libro[@id</code>"2"]=</td>
<td class="org-left">Libro con <code>id</code>"2"=</td>
</tr>

<tr>
<td class="org-left"><code>//libro[@categoria</code>"ficcion"]=</td>
<td class="org-left">Libros de categoría ficción</td>
</tr>

<tr>
<td class="org-left"><code>//precio[@moneda</code>"EUR"]=</td>
<td class="org-left">Precios en euros</td>
</tr>

<tr>
<td class="org-left"><code>//libro[@id&gt;1]</code></td>
<td class="org-left">Libros con id numérico mayor que 1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf0b4d5c" class="outline-4">
<h4 id="orgf0b4d5c">Por contenido de texto</h4>
<div class="outline-text-4" id="text-orgf0b4d5c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">XPath</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>//titulo[text()</code>"Don Quijote"]=</td>
<td class="org-left">Título con ese texto exacto</td>
</tr>

<tr>
<td class="org-left"><code>//titulo[contains(., "años")]</code></td>
<td class="org-left">Títulos que contienen "años"</td>
</tr>

<tr>
<td class="org-left"><code>//autor[starts-with(., "Gar")]</code></td>
<td class="org-left">Autores que empiezan por "Gar"</td>
</tr>

<tr>
<td class="org-left"><code>//libro[precio&gt;13]</code></td>
<td class="org-left">Libros cuyo precio es mayor que 13</td>
</tr>
</tbody>
</table>

<p>
El punto <code>.</code> representa el nodo actual (el texto del elemento en muchos contextos).
</p>
</div>
</div>
</div>
<div id="outline-container-orga3608f0" class="outline-3">
<h3 id="orga3608f0">Ejes</h3>
<div class="outline-text-3" id="text-orga3608f0">
<p>
Los <b>ejes</b> definen la relación entre nodos. Sintaxis: <code>eje::paso</code>.
</p>
</div>
<div id="outline-container-org1108e1b" class="outline-4">
<h4 id="org1108e1b">Ejes más usados</h4>
<div class="outline-text-4" id="text-org1108e1b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Eje</th>
<th scope="col" class="org-left">Abreviatura</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>child::</code></td>
<td class="org-left">(por defecto)</td>
<td class="org-left">Hijos directos</td>
</tr>

<tr>
<td class="org-left"><code>descendant::</code></td>
<td class="org-left"><code>//</code></td>
<td class="org-left">Descendientes (cualquier nivel)</td>
</tr>

<tr>
<td class="org-left"><code>parent::</code></td>
<td class="org-left"><code>../</code></td>
<td class="org-left">Padre</td>
</tr>

<tr>
<td class="org-left"><code>ancestor::</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Antepasados</td>
</tr>

<tr>
<td class="org-left"><code>following-sibling::</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Hermanos siguientes</td>
</tr>

<tr>
<td class="org-left"><code>preceding-sibling::</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Hermanos anteriores</td>
</tr>

<tr>
<td class="org-left"><code>attribute::</code></td>
<td class="org-left"><code>@</code></td>
<td class="org-left">Atributos</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7ff436c" class="outline-4">
<h4 id="org7ff436c">Ejemplos con ejes</h4>
<div class="outline-text-4" id="text-org7ff436c">
<pre class="example" id="org180ed63">
/catalogo/child::libro          → igual que /catalogo/libro
//titulo/parent::libro          → libros que contienen un titulo
//libro[1]/following-sibling::libro  → hermanos siguientes del primer libro
//libro/@id                     → atributo id de cada libro
</pre>
</div>
</div>
</div>
<div id="outline-container-org8a52c2a" class="outline-3">
<h3 id="org8a52c2a">Funciones útiles</h3>
<div class="outline-text-3" id="text-org8a52c2a">
</div>
<div id="outline-container-orgf0e7bbe" class="outline-4">
<h4 id="orgf0e7bbe">Funciones de texto</h4>
<div class="outline-text-4" id="text-orgf0e7bbe">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Función</th>
<th scope="col" class="org-left">Uso</th>
<th scope="col" class="org-left">Ejemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>text()</code></td>
<td class="org-left">Texto del nodo</td>
<td class="org-left"><code>//titulo/text()</code></td>
</tr>

<tr>
<td class="org-left"><code>normalize-space(s)</code></td>
<td class="org-left">Quita espacios extra</td>
<td class="org-left"><code>normalize-space(//titulo[1])</code></td>
</tr>

<tr>
<td class="org-left"><code>contains(s, sub)</code></td>
<td class="org-left">¿s contiene sub?</td>
<td class="org-left"><code>//titulo[contains(., "Quijote")]</code></td>
</tr>

<tr>
<td class="org-left"><code>starts-with(s, pre)</code></td>
<td class="org-left">¿s empieza por pre?</td>
<td class="org-left"><code>//autor[starts-with(., "C")]</code></td>
</tr>

<tr>
<td class="org-left"><code>substring(s, i, n)</code></td>
<td class="org-left">Subcadena desde i, n chars</td>
<td class="org-left"><code>substring(//titulo[1], 1, 3)</code></td>
</tr>

<tr>
<td class="org-left"><code>concat(s1, s2)</code></td>
<td class="org-left">Concatenar strings</td>
<td class="org-left"><code>concat(//titulo[1], " - ", //autor[1])</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga9a53b7" class="outline-4">
<h4 id="orga9a53b7">Funciones numéricas</h4>
<div class="outline-text-4" id="text-orga9a53b7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Función</th>
<th scope="col" class="org-left">Uso</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>count(nodeset)</code></td>
<td class="org-left">Número de nodos</td>
</tr>

<tr>
<td class="org-left"><code>sum(nodeset)</code></td>
<td class="org-left">Suma de valores</td>
</tr>

<tr>
<td class="org-left"><code>position()</code></td>
<td class="org-left">Posición en el contexto</td>
</tr>

<tr>
<td class="org-left"><code>last()</code></td>
<td class="org-left">Última posición</td>
</tr>
</tbody>
</table>

<pre class="example" id="org6235beb">
count(//libro)           → 3
sum(//precio)            → 51.50 (si los precios son números)
//libro[position()=last()]
</pre>
</div>
</div>
<div id="outline-container-org879a17f" class="outline-4">
<h4 id="org879a17f">Funciones de tipo</h4>
<div class="outline-text-4" id="text-org879a17f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Función</th>
<th scope="col" class="org-left">Uso</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>name()</code></td>
<td class="org-left">Nombre de la etiqueta</td>
</tr>

<tr>
<td class="org-left"><code>local-name()</code></td>
<td class="org-left">Nombre local (sin prefijo)</td>
</tr>

<tr>
<td class="org-left"><code>string-length(s)</code></td>
<td class="org-left">Longitud de la cadena</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org35c8ce6" class="outline-3">
<h3 id="org35c8ce6">Operadores y combinaciones</h3>
<div class="outline-text-3" id="text-org35c8ce6">
</div>
<div id="outline-container-org8b68b17" class="outline-4">
<h4 id="org8b68b17">Operadores lógicos</h4>
<div class="outline-text-4" id="text-org8b68b17">
<pre class="example" id="org90f87b6">
//libro[@categoria="ficcion" and precio&gt;12]
//libro[@categoria="ficcion" or @categoria="tecnica"]
//titulo[not(contains(., "años"))]
</pre>
</div>
</div>
<div id="outline-container-orgc2dc296" class="outline-4">
<h4 id="orgc2dc296">Unión de conjuntos (|)</h4>
<div class="outline-text-4" id="text-orgc2dc296">
<pre class="example" id="org395593a">
//titulo | //autor
</pre>

<p>
Devuelve todos los elementos <code>titulo</code> y <code>autor</code>.
</p>
</div>
</div>
<div id="outline-container-org629ed97" class="outline-4">
<h4 id="org629ed97">Operadores de comparación</h4>
<div class="outline-text-4" id="text-org629ed97">
<p>
= = <code>, =!</code> <code>, =&lt; =, =&lt;</code> <code>, =&gt; =, =&gt;</code> =
</p>
</div>
</div>
</div>
