readme.org
** XPath en HTML (scraping)
:PROPERTIES:
:UNNUMBERED: t
:END:

HTML no siempre es XML bien formado. Herramientas como =lxml= en Python pueden parsear
HTML y aplicar XPath. Ejemplo:

#+BEGIN_SRC python
from lxml import etree

html = """
<html>
  <body>
    <div class="articulo">
      <h1>Título del artículo</h1>
      <p>Párrafo uno.</p>
      <p>Párrafo dos con <a href="/enlace">enlace</a>.</p>
    </div>
    <div class="articulo">
      <h1>Otro artículo</h1>
      <p>Contenido.</p>
    </div>
  </body>
</html>
"""

tree = etree.HTML(html)

# Todos los h1
titulos = tree.xpath("//h1/text()")
print(titulos)  # ['Título del artículo', 'Otro artículo']

# h1 dentro de div con clase "articulo"
titulos_articulo = tree.xpath("//div[@class='articulo']/h1/text()")

# Atributo href de enlaces
enlaces = tree.xpath("//a/@href")
print(enlaces)  # ['/enlace']

# Segundo párrafo del primer articulo
segundo_p = tree.xpath("//div[@class='articulo'][1]/p[2]/text()")
#+END_SRC

*** XPath útiles para HTML común

#+BEGIN_EXAMPLE
//a/@href                    → todos los enlaces (URL)
//img/@src                   → todas las imágenes
//div[@class='contenido']    → divs con esa clase
//table//tr                  → filas de tablas
//input[@name='email']       → input por nombre
//*[@id='principal']         → elemento con id
#+END_EXAMPLE

** XPath en Python (lxml)
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Cargar XML desde archivo

#+BEGIN_SRC python
from lxml import etree

tree = etree.parse("catalogo.xml")
root = tree.getroot()

# O desde string
xml_string = "<catalogo><libro><titulo>X</titulo></libro></catalogo>"
root = etree.fromstring(xml_string.encode("utf-8"))
#+END_SRC

*** Ejecutar XPath

#+BEGIN_SRC python
# .xpath() devuelve lista de nodos o valores según la expresión
libros = root.xpath("//libro")
titulos = root.xpath("//titulo/text()")
precio_eur = root.xpath("//precio[@moneda='EUR']/text()")
primer_autor = root.xpath("//autor[1]/text()")[0]
#+END_SRC

*** Namespaces (XML con prefijos)

Si el XML usa namespaces (p. ej. =xmlns=), hay que registrarlos:

#+BEGIN_SRC python
ns = {"rss": "http://purl.org/rss/1.0/"}
items = root.xpath("//rss:item/title/text()", namespaces=ns)
#+END_SRC

** Ejercicios prácticos

Con el XML de ejemplo del catálogo, escribe el XPath que:

**** Ejercicio 1
Obtenga el título del segundo libro.
#+BEGIN_EXAMPLE
# Respuesta: /catalogo/libro[2]/titulo/text()
#+END_EXAMPLE

**** Ejercicio 2
Obtenga todos los precios en euros.
#+BEGIN_EXAMPLE
# Respuesta: //precio[@moneda='EUR']/text()
#+END_EXAMPLE

**** Ejercicio 3
Obtenga los títulos de los libros de ficción.
#+BEGIN_EXAMPLE
# Respuesta: //libro[@categoria='ficcion']/titulo/text()
#+END_EXAMPLE

**** Ejercicio 4
Obtenga el autor del libro cuyo título contiene "años".
#+BEGIN_EXAMPLE
# Respuesta: //libro[titulo[contains(., 'años')]]/autor/text()
#+END_EXAMPLE

**** Ejercicio 5
Cuente cuántos libros hay en el catálogo.
#+BEGIN_EXAMPLE
# Respuesta: count(//libro)
#+END_EXAMPLE

** Referencia rápida
:PROPERTIES:
:UNNUMBERED: t
:END:

| Símbolo / sintaxis | Significado              |
|--------------------+--------------------------|
| =/=                | Hijo directo / raíz      |
| =//=               | Descendiente (cualquier nivel) |
| =.=                | Nodo actual              |
| =..=               | Padre                    |
| =@=                | Atributo                 |
| =[]=               | Predicado (filtro)       |
| =|=                | Unión de conjuntos       |
| =text()=           | Contenido de texto       |
| =*=                | Cualquier elemento       |
| =@*=               | Cualquier atributo       |

** Dependencias
:PROPERTIES:
:UNNUMBERED: t
:END:

#+BEGIN_EXAMPLE
pip install lxml
#+END_EXAMPLE

Para HTML "suelto": =lxml= con =etree.HTML()= o =BeautifulSoup= con soporte =lxml=.








*  Ruta Crítica del Web Scraping y Aspectos de Seguridad




