index.html
<div id="outline-container-org3cc0918" class="outline-3">
<h3 id="org3cc0918">XPath en HTML (scraping)</h3>
<div class="outline-text-3" id="text-org3cc0918">
<p>
HTML no siempre es XML bien formado. Herramientas como <code>lxml</code> en Python pueden parsear
HTML y aplicar XPath. Ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">from</span> lxml <span style="color: #fb4934;">import</span> etree

<span style="color: #83a598;">html</span> = <span style="color: #b8bb26;">"""
&lt;html&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;body&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   &lt;div class="articulo"&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   </span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;h1&gt;T&#237;tulo del art&#237;culo&lt;/h1&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   </span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;p&gt;P&#225;rrafo uno.&lt;/p&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   </span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;p&gt;P&#225;rrafo dos con &lt;a href="/enlace"&gt;enlace&lt;/a&gt;.&lt;/p&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   &lt;/div&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   &lt;div class="articulo"&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   </span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;h1&gt;Otro art&#237;culo&lt;/h1&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   </span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;p&gt;Contenido.&lt;/p&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;">   &lt;/div&gt;
</span><span style="color: #b8bb26; background-color: #3c3836;"> </span><span style="color: #b8bb26;"> &lt;/body&gt;
&lt;/html&gt;
"""</span>

<span style="color: #83a598;">tree</span> = etree.HTML<span style="color: #fe8019;">(</span>html<span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Todos los h1
</span><span style="color: #83a598;">titulos</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//h1/text()"</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>titulos<span style="color: #fe8019;">)</span>  <span style="color: #928374;"># </span><span style="color: #928374;">['T&#237;tulo del art&#237;culo', 'Otro art&#237;culo']
</span>
<span style="color: #928374;"># </span><span style="color: #928374;">h1 dentro de div con clase "articulo"
</span><span style="color: #83a598;">titulos_articulo</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//div[@class='articulo']/h1/text()"</span><span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Atributo href de enlaces
</span><span style="color: #83a598;">enlaces</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//a/@href"</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>enlaces<span style="color: #fe8019;">)</span>  <span style="color: #928374;"># </span><span style="color: #928374;">['/enlace']
</span>
<span style="color: #928374;"># </span><span style="color: #928374;">Segundo p&#225;rrafo del primer articulo
</span><span style="color: #83a598;">segundo_p</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//div[@class='articulo'][1]/p[2]/text()"</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org0ea237f" class="outline-4">
<h4 id="org0ea237f">XPath útiles para HTML común</h4>
<div class="outline-text-4" id="text-org0ea237f">
<pre class="example" id="orgc38d6e7">
//a/@href                    → todos los enlaces (URL)
//img/@src                   → todas las imágenes
//div[@class='contenido']    → divs con esa clase
//table//tr                  → filas de tablas
//input[@name='email']       → input por nombre
//*[@id='principal']         → elemento con id
</pre>
</div>
</div>
</div>
<div id="outline-container-org3bb4f29" class="outline-3">
<h3 id="org3bb4f29">XPath en Python (lxml)</h3>
<div class="outline-text-3" id="text-org3bb4f29">
</div>
<div id="outline-container-org5442fb4" class="outline-4">
<h4 id="org5442fb4">Cargar XML desde archivo</h4>
<div class="outline-text-4" id="text-org5442fb4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">from</span> lxml <span style="color: #fb4934;">import</span> etree

<span style="color: #83a598;">tree</span> = etree.parse<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"catalogo.xml"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">root</span> = tree.getroot<span style="color: #fe8019;">()</span>

<span style="color: #928374;"># </span><span style="color: #928374;">O desde string
</span><span style="color: #83a598;">xml_string</span> = <span style="color: #b8bb26;">"&lt;catalogo&gt;&lt;libro&gt;&lt;titulo&gt;X&lt;/titulo&gt;&lt;/libro&gt;&lt;/catalogo&gt;"</span>
<span style="color: #83a598;">root</span> = etree.fromstring<span style="color: #fe8019;">(</span>xml_string.encode<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"utf-8"</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2a78f5d" class="outline-4">
<h4 id="org2a78f5d">Ejecutar XPath</h4>
<div class="outline-text-4" id="text-org2a78f5d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #928374;"># </span><span style="color: #928374;">.xpath() devuelve lista de nodos o valores seg&#250;n la expresi&#243;n
</span><span style="color: #83a598;">libros</span> = root.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//libro"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">titulos</span> = root.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//titulo/text()"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">precio_eur</span> = root.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//precio[@moneda='EUR']/text()"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">primer_autor</span> = root.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//autor[1]/text()"</span><span style="color: #fe8019;">)[</span>0<span style="color: #fe8019;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7618d44" class="outline-4">
<h4 id="org7618d44">Namespaces (XML con prefijos)</h4>
<div class="outline-text-4" id="text-org7618d44">
<p>
Si el XML usa namespaces (p. ej. <code>xmlns</code>), hay que registrarlos:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #83a598;">ns</span> = <span style="color: #fe8019;">{</span><span style="color: #b8bb26;">"rss"</span>: <span style="color: #b8bb26;">"http://purl.org/rss/1.0/"</span><span style="color: #fe8019;">}</span>
<span style="color: #83a598;">items</span> = root.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//rss:item/title/text()"</span>, namespaces=ns<span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc458446" class="outline-3">
<h3 id="orgc458446">Ejercicios prácticos</h3>
<div class="outline-text-3" id="text-orgc458446">
<p>
Con el XML de ejemplo del catálogo, escribe el XPath que:
</p>
</div>
<ul class="org-ul">
<li><a id="org4eb1b67"></a>Ejercicio 1<br />
<div class="outline-text-5" id="text-org4eb1b67">
<p>
Obtenga el título del segundo libro.
</p>
<pre class="example" id="orgac816e6">
# Respuesta: /catalogo/libro[2]/titulo/text()
</pre>
</div>
</li>
<li><a id="org814db2b"></a>Ejercicio 2<br />
<div class="outline-text-5" id="text-org814db2b">
<p>
Obtenga todos los precios en euros.
</p>
<pre class="example" id="orgeac8f64">
# Respuesta: //precio[@moneda='EUR']/text()
</pre>
</div>
</li>
<li><a id="org4c8731a"></a>Ejercicio 3<br />
<div class="outline-text-5" id="text-org4c8731a">
<p>
Obtenga los títulos de los libros de ficción.
</p>
<pre class="example" id="orgb871130">
# Respuesta: //libro[@categoria='ficcion']/titulo/text()
</pre>
</div>
</li>
<li><a id="orgeaf41e7"></a>Ejercicio 4<br />
<div class="outline-text-5" id="text-orgeaf41e7">
<p>
Obtenga el autor del libro cuyo título contiene "años".
</p>
<pre class="example" id="org96dd1e7">
# Respuesta: //libro[titulo[contains(., 'años')]]/autor/text()
</pre>
</div>
</li>
<li><a id="org1d65bd4"></a>Ejercicio 5<br />
<div class="outline-text-5" id="text-org1d65bd4">
<p>
Cuente cuántos libros hay en el catálogo.
</p>
<pre class="example" id="org68db24d">
# Respuesta: count(//libro)
</pre>
</div>
</li>
</ul>
</div>
<div id="outline-container-org20d1614" class="outline-3">
<h3 id="org20d1614">Referencia rápida</h3>
<div class="outline-text-3" id="text-org20d1614">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Símbolo / sintaxis</th>
<th scope="col" class="org-left">Significado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">Hijo directo / raíz</td>
</tr>

<tr>
<td class="org-left"><code>//</code></td>
<td class="org-left">Descendiente (cualquier nivel)</td>
</tr>

<tr>
<td class="org-left"><code>.</code></td>
<td class="org-left">Nodo actual</td>
</tr>

<tr>
<td class="org-left"><code>..</code></td>
<td class="org-left">Padre</td>
</tr>

<tr>
<td class="org-left"><code>@</code></td>
<td class="org-left">Atributo</td>
</tr>

<tr>
<td class="org-left"><code>[]</code></td>
<td class="org-left">Predicado (filtro)</td>
</tr>

<tr>
<td class="org-left">=</td>
<td class="org-left">=</td>
<td class="org-left">Unión de conjuntos</td>
</tr>

<tr>
<td class="org-left"><code>text()</code></td>
<td class="org-left">Contenido de texto</td>
</tr>

<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">Cualquier elemento</td>
</tr>

<tr>
<td class="org-left"><code>@*</code></td>
<td class="org-left">Cualquier atributo</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf01aa2a" class="outline-3">
<h3 id="orgf01aa2a">Dependencias</h3>
<div class="outline-text-3" id="text-orgf01aa2a">
<pre class="example" id="org889ce5d">
pip install lxml
</pre>

<p>
Para HTML "suelto": <code>lxml</code> con <code>etree.HTML()</code> o <code>BeautifulSoup</code> con soporte <code>lxml</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcc5fac5" class="outline-2">
<h2 id="orgcc5fac5">Ruta Crítica del Web Scraping y Aspectos de Seguridad</h2>
<div class="outline-text-2" id="text-orgcc5fac5">
</div>
