readme.org
** Introducción

Este tutorial describe la *ruta crítica* para realizar web scraping: los pasos imprescindibles,
orden lógico y las consideraciones de *seguridad* (tuyas y del sitio objetivo) que conlleva.

** La ruta crítica: fases del proyecto de scraping
:PROPERTIES:
:UNNUMBERED: t
:END:

La ruta crítica es la secuencia de actividades que deben completarse en orden y cuyas
demoras afectan directamente el tiempo total del proyecto.

*** Diagrama de flujo general

#+BEGIN_EXAMPLE
┌─────────────────┐
│ 1. LEGALIDAD    │ ¿Puedo hacerlo?
│ y ÉTICA         │
└────────┬────────┘
         │ Sí
         ▼
┌─────────────────┐
│ 2. ALTERNATIVAS │ ¿Existe API o descarga oficial?
│ (evitar scrape) │
└────────┬────────┘
         │ No hay alternativa adecuada
         ▼
┌─────────────────┐
│ 3. PLANIFICACIÓN│ ¿Qué datos? ¿Qué páginas? ¿Frecuencia?
│                 │
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 4. ANÁLISIS     │ Inspeccionar HTML, estructura, paginación
│ TÉCNICO         │ ¿Contenido estático o dinámico?
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 5. DESARROLLO   │ Código: requests/lxml/selenium, etc.
│                 │ Manejo de errores, reintentos
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 6. SEGURIDAD    │ Headers, rate limiting, proxies (si aplica)
│ Y ROBUSTEZ      │ Validación de datos, sanitización
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 7. EJECUCIÓN    │ Monitoreo, logs, alertas
│ Y MANTENIMIENTO │ Adaptación a cambios del sitio
└─────────────────┘
#+END_EXAMPLE

** Fase 1: Legalidad y ética (puerta de entrada)
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Antes de escribir código

| Verificación | Pregunta | Acción si falla |
|--------------+----------+-----------------|
| Términos de uso | ¿El sitio prohíbe explícitamente el scraping? | No proceder |
| robots.txt | ¿Hay directivas que bloqueen tu user-agent o rutas? | Respetar o no proceder |
| Propiedad intelectual | ¿El contenido está protegido por derechos de autor? | Evaluar uso justo / licencia |
| Datos personales | ¿Vas a extraer datos que identifiquen personas? | Cumplir RGPD/LFPDPPP y normativa local |
| robots.txt location | ¿Dónde está? | Revisar =https://dominio.com/robots.txt= |

*** Ejemplo de robots.txt

#+BEGIN_EXAMPLE
User-agent: *
Disallow: /admin/
Disallow: /api/  # Puede indicar que hay API disponible
Allow: /public/

User-agent: BadBot
Disallow: /
#+END_EXAMPLE

*** Consecuencias de omitir esta fase

- Demandas por violación de términos de servicio.
- Bloqueo de IP o cuenta.
- Responsabilidad por tratamiento indebido de datos personales.
- Reputación y costes legales.

** Fase 2: Buscar alternativas al scraping
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Jerarquía de preferencia (orden recomendado)

1. *API oficial* (Twitter, INEGI, Amazon Product Advertising API, etc.)
2. *RSS / feed XML*
3. *JSON oculto en Network* (pestaña Network del navegador: peticiones XHR/Fetch que devuelven JSON)
4. *HTML estático* (=requests= + lxml)
5. *Contenido dinámico* (Selenium, Playwright)

Nunca empezar con Selenium si no es necesario: es más lento y pesado. Ejemplos: Twitter/X
→ API oficial (plan básico limitado); Amazon → Product Advertising API para afiliados.

*** Antes de scrapear, preguntar

1. ¿Existe una *API oficial*? (Google, Twitter, INEGI, etc.)
2. ¿Hay *datos abiertos* o descarga masiva? (datos.gob.mx, Kaggle)
3. ¿Ofrecen *exportación* o *feed RSS/XML*?
4. ¿El sitio carga datos por JSON interno? (revisar pestaña Network)
5. ¿Se puede *contactar* al propietario para solicitar acceso formal?

*** Motivos para preferir alternativas

- Legalidad más clara.
- Menor riesgo de bloqueo.
- Datos más estructurados y estables.
- Menos mantenimiento ante cambios del sitio.

** Fase 3: Planificación
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Definir alcance

| Aspecto | Preguntas |
|---------+-----------|
| Objetivo | ¿Qué datos exactos necesito? |
| Volumen | ¿Cuántas páginas/registros? |
| Frecuencia | ¿Una vez, diario, en tiempo real? |
| Formato salida | CSV, JSON, base de datos |
| Tiempo estimado | ¿Cuánto tardará una ejecución completa? |

*** Estimar carga al servidor

\[
\text{peticiones/hora} \approx \frac{\text{páginas totales}}{\text{tiempo deseado (h)}} \times (1 + \text{margen reintentos})
\]

Mantener un ritmo *razonable* evita saturar el servidor y ser detectado como bot.

** Fase 4: Análisis técnico
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Inspeccionar el sitio

- Herramientas de desarrollador (F12): estructura HTML, clases, IDs.
- Network tab: ver peticiones XHR/Fetch (contenido dinámico).
- Probar si =requests= + =lxml= devuelven el contenido visible en el navegador.

*** Contenido estático vs. dinámico

| Tipo | Cómo identificarlo | Herramienta típica |
|------+--------------------+---------------------|
| Estático | HTML completo en la respuesta GET | =requests= + =lxml= |
| Dinámico | Contenido cargado por JavaScript | Selenium, Playwright |

*** Mapear la estructura

- URLs base y patrones de paginación.
- Selectores XPath o CSS estables.
- Formularios, cookies o cabeceras requeridas.

