index.html
<div id="outline-container-orga705615" class="outline-3">
<h3 id="orga705615">Introducción</h3>
<div class="outline-text-3" id="text-orga705615">
<p>
Este tutorial describe la <b>ruta crítica</b> para realizar web scraping: los pasos imprescindibles,
orden lógico y las consideraciones de <b>seguridad</b> (tuyas y del sitio objetivo) que conlleva.
</p>
</div>
</div>
<div id="outline-container-org2ce8f8f" class="outline-3">
<h3 id="org2ce8f8f">La ruta crítica: fases del proyecto de scraping</h3>
<div class="outline-text-3" id="text-org2ce8f8f">
<p>
La ruta crítica es la secuencia de actividades que deben completarse en orden y cuyas
demoras afectan directamente el tiempo total del proyecto.
</p>
</div>
<div id="outline-container-org2912190" class="outline-4">
<h4 id="org2912190">Diagrama de flujo general</h4>
<div class="outline-text-4" id="text-org2912190">
<pre class="example" id="orgfd8c587">
┌─────────────────┐
│ 1. LEGALIDAD    │ ¿Puedo hacerlo?
│ y ÉTICA         │
└────────┬────────┘
         │ Sí
         ▼
┌─────────────────┐
│ 2. ALTERNATIVAS │ ¿Existe API o descarga oficial?
│ (evitar scrape) │
└────────┬────────┘
         │ No hay alternativa adecuada
         ▼
┌─────────────────┐
│ 3. PLANIFICACIÓN│ ¿Qué datos? ¿Qué páginas? ¿Frecuencia?
│                 │
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 4. ANÁLISIS     │ Inspeccionar HTML, estructura, paginación
│ TÉCNICO         │ ¿Contenido estático o dinámico?
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 5. DESARROLLO   │ Código: requests/lxml/selenium, etc.
│                 │ Manejo de errores, reintentos
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 6. SEGURIDAD    │ Headers, rate limiting, proxies (si aplica)
│ Y ROBUSTEZ      │ Validación de datos, sanitización
└────────┬────────┘
         │
         ▼
┌─────────────────┐
│ 7. EJECUCIÓN    │ Monitoreo, logs, alertas
│ Y MANTENIMIENTO │ Adaptación a cambios del sitio
└─────────────────┘
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf25d1b2" class="outline-3">
<h3 id="orgf25d1b2">Fase 1: Legalidad y ética (puerta de entrada)</h3>
<div class="outline-text-3" id="text-orgf25d1b2">
</div>
<div id="outline-container-orgb7c86d9" class="outline-4">
<h4 id="orgb7c86d9">Antes de escribir código</h4>
<div class="outline-text-4" id="text-orgb7c86d9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Verificación</th>
<th scope="col" class="org-left">Pregunta</th>
<th scope="col" class="org-left">Acción si falla</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Términos de uso</td>
<td class="org-left">¿El sitio prohíbe explícitamente el scraping?</td>
<td class="org-left">No proceder</td>
</tr>

<tr>
<td class="org-left">robots.txt</td>
<td class="org-left">¿Hay directivas que bloqueen tu user-agent o rutas?</td>
<td class="org-left">Respetar o no proceder</td>
</tr>

<tr>
<td class="org-left">Propiedad intelectual</td>
<td class="org-left">¿El contenido está protegido por derechos de autor?</td>
<td class="org-left">Evaluar uso justo / licencia</td>
</tr>

<tr>
<td class="org-left">Datos personales</td>
<td class="org-left">¿Vas a extraer datos que identifiquen personas?</td>
<td class="org-left">Cumplir RGPD/LFPDPPP y normativa local</td>
</tr>

<tr>
<td class="org-left">robots.txt location</td>
<td class="org-left">¿Dónde está?</td>
<td class="org-left">Revisar <code>https://dominio.com/robots.txt</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4a77e56" class="outline-4">
<h4 id="org4a77e56">Ejemplo de robots.txt</h4>
<div class="outline-text-4" id="text-org4a77e56">
<pre class="example" id="orgd2e9990">
User-agent: *
Disallow: /admin/
Disallow: /api/  # Puede indicar que hay API disponible
Allow: /public/

User-agent: BadBot
Disallow: /
</pre>
</div>
</div>
<div id="outline-container-org7d379de" class="outline-4">
<h4 id="org7d379de">Consecuencias de omitir esta fase</h4>
<div class="outline-text-4" id="text-org7d379de">
<ul class="org-ul">
<li>Demandas por violación de términos de servicio.</li>
<li>Bloqueo de IP o cuenta.</li>
<li>Responsabilidad por tratamiento indebido de datos personales.</li>
<li>Reputación y costes legales.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org145d99d" class="outline-3">
<h3 id="org145d99d">Fase 2: Buscar alternativas al scraping</h3>
<div class="outline-text-3" id="text-org145d99d">
</div>
<div id="outline-container-org6af5c87" class="outline-4">
<h4 id="org6af5c87">Jerarquía de preferencia (orden recomendado)</h4>
<div class="outline-text-4" id="text-org6af5c87">
<ol class="org-ol">
<li><b>API oficial</b> (Twitter, INEGI, Amazon Product Advertising API, etc.)</li>
<li><b>RSS / feed XML</b></li>
<li><b>JSON oculto en Network</b> (pestaña Network del navegador: peticiones XHR/Fetch que devuelven JSON)</li>
<li><b>HTML estático</b> (<code>requests</code> + lxml)</li>
<li><b>Contenido dinámico</b> (Selenium, Playwright)</li>
</ol>

<p>
Nunca empezar con Selenium si no es necesario: es más lento y pesado. Ejemplos: Twitter/X
→ API oficial (plan básico limitado); Amazon → Product Advertising API para afiliados.
</p>
</div>
</div>
<div id="outline-container-orgacfc424" class="outline-4">
<h4 id="orgacfc424">Antes de scrapear, preguntar</h4>
<div class="outline-text-4" id="text-orgacfc424">
<ol class="org-ol">
<li>¿Existe una <b>API oficial</b>? (Google, Twitter, INEGI, etc.)</li>
<li>¿Hay <b>datos abiertos</b> o descarga masiva? (datos.gob.mx, Kaggle)</li>
<li>¿Ofrecen <b>exportación</b> o <b>feed RSS/XML</b>?</li>
<li>¿El sitio carga datos por JSON interno? (revisar pestaña Network)</li>
<li>¿Se puede <b>contactar</b> al propietario para solicitar acceso formal?</li>
</ol>
</div>
</div>
<div id="outline-container-org644e5d6" class="outline-4">
<h4 id="org644e5d6">Motivos para preferir alternativas</h4>
<div class="outline-text-4" id="text-org644e5d6">
<ul class="org-ul">
<li>Legalidad más clara.</li>
<li>Menor riesgo de bloqueo.</li>
<li>Datos más estructurados y estables.</li>
<li>Menos mantenimiento ante cambios del sitio.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org19be25a" class="outline-3">
<h3 id="org19be25a">Fase 3: Planificación</h3>
<div class="outline-text-3" id="text-org19be25a">
</div>
<div id="outline-container-org31f919f" class="outline-4">
<h4 id="org31f919f">Definir alcance</h4>
<div class="outline-text-4" id="text-org31f919f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspecto</th>
<th scope="col" class="org-left">Preguntas</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Objetivo</td>
<td class="org-left">¿Qué datos exactos necesito?</td>
</tr>

<tr>
<td class="org-left">Volumen</td>
<td class="org-left">¿Cuántas páginas/registros?</td>
</tr>

<tr>
<td class="org-left">Frecuencia</td>
<td class="org-left">¿Una vez, diario, en tiempo real?</td>
</tr>

<tr>
<td class="org-left">Formato salida</td>
<td class="org-left">CSV, JSON, base de datos</td>
</tr>

<tr>
<td class="org-left">Tiempo estimado</td>
<td class="org-left">¿Cuánto tardará una ejecución completa?</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0a85354" class="outline-4">
<h4 id="org0a85354">Estimar carga al servidor</h4>
<div class="outline-text-4" id="text-org0a85354">
<p>
\[
\text{peticiones/hora} \approx \frac{\text{páginas totales}}{\text{tiempo deseado (h)}} \times (1 + \text{margen reintentos})
\]
</p>

<p>
Mantener un ritmo <b>razonable</b> evita saturar el servidor y ser detectado como bot.
</p>
</div>
</div>
</div>
<div id="outline-container-org5f18131" class="outline-3">
<h3 id="org5f18131">Fase 4: Análisis técnico</h3>
<div class="outline-text-3" id="text-org5f18131">
</div>
<div id="outline-container-org87c170f" class="outline-4">
<h4 id="org87c170f">Inspeccionar el sitio</h4>
<div class="outline-text-4" id="text-org87c170f">
<ul class="org-ul">
<li>Herramientas de desarrollador (F12): estructura HTML, clases, IDs.</li>
<li>Network tab: ver peticiones XHR/Fetch (contenido dinámico).</li>
<li>Probar si <code>requests</code> + <code>lxml</code> devuelven el contenido visible en el navegador.</li>
</ul>
</div>
</div>
<div id="outline-container-org673d320" class="outline-4">
<h4 id="org673d320">Contenido estático vs. dinámico</h4>
<div class="outline-text-4" id="text-org673d320">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-left">Cómo identificarlo</th>
<th scope="col" class="org-left">Herramienta típica</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Estático</td>
<td class="org-left">HTML completo en la respuesta GET</td>
<td class="org-left"><code>requests</code> + <code>lxml</code></td>
</tr>

<tr>
<td class="org-left">Dinámico</td>
<td class="org-left">Contenido cargado por JavaScript</td>
<td class="org-left">Selenium, Playwright</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5494af4" class="outline-4">
<h4 id="org5494af4">Mapear la estructura</h4>
<div class="outline-text-4" id="text-org5494af4">
<ul class="org-ul">
<li>URLs base y patrones de paginación.</li>
<li>Selectores XPath o CSS estables.</li>
<li>Formularios, cookies o cabeceras requeridas.</li>
</ul>
</div>
</div>
