readme.org
*** Detectando JSON oculto (Network)

Muchos sitios (incl. Amazon, tiendas, portales) cargan datos por peticiones internas a APIs
que devuelven JSON. En lugar de parsear HTML:

1. Abrir herramientas de desarrollador (F12) → pestaña *Network*.
2. Filtrar por XHR o Fetch.
3. Recargar la página y observar qué peticiones devuelven datos útiles.
4. Copiar la URL de la petición y sus parámetros; replicar con =requests=.

Ventaja: JSON estructurado, más fácil de parsear y más estable que el HTML.

** Fase 5: Desarrollo
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Estructura recomendada del código

#+BEGIN_EXAMPLE
scraper/
├── config.py        # URLs, timeouts, headers
├── fetch.py         # Lógica de peticiones HTTP
├── parse.py         # Extracción con XPath/CSS
├── storage.py       # Guardar datos (CSV, DB)
├── main.py          # Orquestación
└── logs/            # Registro de ejecuciones
#+END_EXAMPLE

*** Manejo de errores

#+BEGIN_SRC python
import time
import requests
from requests.adapters import HTTPAdapter
from urllib3.util.retry import Retry

def session_con_reintentos():
    session = requests.Session()
    retries = Retry(total=3, backoff_factor=1, status_forcelist=[500, 502, 503])
    session.mount("https://", HTTPAdapter(max_retries=retries))
    return session

def fetch_con_pausa(url, session, delay=1):
    try:
        r = session.get(url, timeout=30)
        r.raise_for_status()
        time.sleep(delay)  # Rate limiting
        return r.content
    except requests.RequestException as e:
        # Registrar en log, no solo print
        raise
#+END_SRC

** Fase 6: Seguridad y robustez
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Seguridad de las peticiones

**** User-Agent e identificación

- Identificarse de forma clara (no hacerse pasar por Googlebot si no lo eres).
- Incluir un correo de contacto si el sitio lo sugiere.
- Evitar user-agents de navegadores muy antiguos (suelen ser bloqueados).

#+BEGIN_SRC python
HEADERS = {
    "User-Agent": "MiProyecto/1.0 (estudio académico; +mail@ejemplo.com)",
    "Accept": "text/html,application/xhtml+xml",
    "Accept-Language": "es-ES,es;q=0.9",
}
#+END_SRC

**** No exponer credenciales

- Nunca hardcodear API keys, contraseñas o tokens.
- Usar variables de entorno o archivos de configuración excluidos de control de versiones.

#+BEGIN_SRC python
import os
API_KEY = os.environ.get("SCRAPER_API_KEY")
if not API_KEY:
    raise ValueError("Configurar SCRAPER_API_KEY")
#+END_SRC

**** Validar y sanitizar datos de entrada

- URLs, parámetros y consultas pueden venir de fuentes externas.
- Evitar inyección o URLs maliciosas (redirecciones a dominios desconocidos).

#+BEGIN_SRC python
from urllib.parse import urlparse

def url_permitida(url, dominios_permitidos):
    parsed = urlparse(url)
    return parsed.netloc in dominios_permitidos
#+END_SRC

*** Seguridad de los datos extraídos

**** Sanitización de salida

- Limpiar HTML antes de guardar (evitar XSS si luego se muestran en una web).
- Validar tipos y formatos (fechas, números, textos).

#+BEGIN_SRC python
import re
def limpiar_texto(texto):
    if not isinstance(texto, str):
        return ""
    return re.sub(r"<[^>]+>", "", texto).strip()
#+END_SRC

**** Almacenamiento

- No guardar datos personales innecesarios.
- Cifrar almacenamiento si hay datos sensibles.
- Respaldar solo lo necesario y cumplir normativa de retención.

*** Protección del sitio objetivo (ética técnica)

| Práctica | Objetivo |
|----------|----------|
| Rate limiting | No saturar el servidor; pausas entre peticiones |
| Horarios valle | Ejecutar en horas de menor tráfico si es posible |
| Cache | Evitar repetir peticiones innecesarias |
| Respetar 429/503 | Detener o ralentizar si el servidor pide esperar |
| No evadir bloqueos | Si te bloquean, revisar si tu uso es adecuado |

*** Proxies y escalado (consideraciones)

- Proxies rotativos: mayor complejidad y coste; puede violar términos de uso.
- Antes de usarlos: confirmar legalidad y política del sitio.
- Preferir optimizar el ritmo antes que multiplicar IPs.

** Fase 7: Ejecución y mantenimiento
:PROPERTIES:
:UNNUMBERED: t
:END:

