index.html
<div id="outline-container-org3f207b7" class="outline-4">
<h4 id="org3f207b7">Detectando JSON oculto (Network)</h4>
<div class="outline-text-4" id="text-org3f207b7">
<p>
Muchos sitios (incl. Amazon, tiendas, portales) cargan datos por peticiones internas a APIs
que devuelven JSON. En lugar de parsear HTML:
</p>

<ol class="org-ol">
<li>Abrir herramientas de desarrollador (F12) → pestaña <b>Network</b>.</li>
<li>Filtrar por XHR o Fetch.</li>
<li>Recargar la página y observar qué peticiones devuelven datos útiles.</li>
<li>Copiar la URL de la petición y sus parámetros; replicar con <code>requests</code>.</li>
</ol>

<p>
Ventaja: JSON estructurado, más fácil de parsear y más estable que el HTML.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc01caa6" class="outline-3">
<h3 id="orgc01caa6">Fase 5: Desarrollo</h3>
<div class="outline-text-3" id="text-orgc01caa6">
</div>
<div id="outline-container-orge93870b" class="outline-4">
<h4 id="orge93870b">Estructura recomendada del código</h4>
<div class="outline-text-4" id="text-orge93870b">
<pre class="example" id="org6ce6d69">
scraper/
├── config.py        # URLs, timeouts, headers
├── fetch.py         # Lógica de peticiones HTTP
├── parse.py         # Extracción con XPath/CSS
├── storage.py       # Guardar datos (CSV, DB)
├── main.py          # Orquestación
└── logs/            # Registro de ejecuciones
</pre>
</div>
</div>
<div id="outline-container-orgbc6e3f3" class="outline-4">
<h4 id="orgbc6e3f3">Manejo de errores</h4>
<div class="outline-text-4" id="text-orgbc6e3f3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> time
<span style="color: #fb4934;">import</span> requests
<span style="color: #fb4934;">from</span> requests.adapters <span style="color: #fb4934;">import</span> HTTPAdapter
<span style="color: #fb4934;">from</span> urllib3.util.retry <span style="color: #fb4934;">import</span> Retry

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">session_con_reintentos</span><span style="color: #fe8019;">()</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">session</span> = requests.Session<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">retries</span> = Retry<span style="color: #fe8019;">(</span>total=3, backoff_factor=1, status_forcelist=<span style="color: #b16286;">[</span>500, 502, 503<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   session.mount<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"https://"</span>, HTTPAdapter<span style="color: #b16286;">(</span>max_retries=retries<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> session

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">fetch_con_pausa</span><span style="color: #fe8019;">(</span>url, session, delay=1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">r</span> = session.get<span style="color: #fe8019;">(</span>url, timeout=30<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   r.raise_for_status<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   time.sleep<span style="color: #fe8019;">(</span>delay<span style="color: #fe8019;">)</span>  <span style="color: #928374;"># </span><span style="color: #928374;">Rate limiting
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> r.content
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> requests.RequestException <span style="color: #fb4934;">as</span> e:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #928374;"># </span><span style="color: #928374;">Registrar en log, no solo print
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">raise</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgac954e9" class="outline-3">
<h3 id="orgac954e9">Fase 6: Seguridad y robustez</h3>
<div class="outline-text-3" id="text-orgac954e9">
</div>
<div id="outline-container-org6afc5df" class="outline-4">
<h4 id="org6afc5df">Seguridad de las peticiones</h4>
<div class="outline-text-4" id="text-org6afc5df">
</div>
<ul class="org-ul">
<li><a id="org3eeb35e"></a>User-Agent e identificación<br />
<div class="outline-text-5" id="text-org3eeb35e">
<ul class="org-ul">
<li>Identificarse de forma clara (no hacerse pasar por Googlebot si no lo eres).</li>
<li>Incluir un correo de contacto si el sitio lo sugiere.</li>
<li>Evitar user-agents de navegadores muy antiguos (suelen ser bloqueados).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #83a598;">HEADERS</span> = <span style="color: #fe8019;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"User-Agent"</span>: <span style="color: #b8bb26;">"MiProyecto/1.0 (estudio acad&#233;mico; +mail@ejemplo.com)"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"Accept"</span>: <span style="color: #b8bb26;">"text/html,application/xhtml+xml"</span>,
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"Accept-Language"</span>: <span style="color: #b8bb26;">"es-ES,es;q=0.9"</span>,
<span style="color: #fe8019;">}</span>
</pre>
</div>
</div>
</li>
<li><a id="org2a20208"></a>No exponer credenciales<br />
<div class="outline-text-5" id="text-org2a20208">
<ul class="org-ul">
<li>Nunca hardcodear API keys, contraseñas o tokens.</li>
<li>Usar variables de entorno o archivos de configuración excluidos de control de versiones.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> os
<span style="color: #83a598;">API_KEY</span> = os.environ.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"SCRAPER_API_KEY"</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">if</span> <span style="color: #fb4934;">not</span> API_KEY:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">raise</span> <span style="color: #fabd2f;">ValueError</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Configurar SCRAPER_API_KEY"</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org42c120f"></a>Validar y sanitizar datos de entrada<br />
<div class="outline-text-5" id="text-org42c120f">
<ul class="org-ul">
<li>URLs, parámetros y consultas pueden venir de fuentes externas.</li>
<li>Evitar inyección o URLs maliciosas (redirecciones a dominios desconocidos).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">from</span> urllib.parse <span style="color: #fb4934;">import</span> urlparse

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">url_permitida</span><span style="color: #fe8019;">(</span>url, dominios_permitidos<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">parsed</span> = urlparse<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> parsed.netloc <span style="color: #fb4934;">in</span> dominios_permitidos
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge2f0b44" class="outline-4">
<h4 id="orge2f0b44">Seguridad de los datos extraídos</h4>
<div class="outline-text-4" id="text-orge2f0b44">
</div>
<ul class="org-ul">
<li><a id="org8368734"></a>Sanitización de salida<br />
<div class="outline-text-5" id="text-org8368734">
<ul class="org-ul">
<li>Limpiar HTML antes de guardar (evitar XSS si luego se muestran en una web).</li>
<li>Validar tipos y formatos (fechas, números, textos).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> re
<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">limpiar_texto</span><span style="color: #fe8019;">(</span>texto<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #fb4934;">not</span> <span style="color: #fe8019;">isinstance</span><span style="color: #fe8019;">(</span>texto, <span style="color: #fe8019;">str</span><span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #b8bb26;">""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> re.sub<span style="color: #fe8019;">(</span>r<span style="color: #b8bb26;">"&lt;[^&gt;]+&gt;"</span>, <span style="color: #b8bb26;">""</span>, texto<span style="color: #fe8019;">)</span>.strip<span style="color: #fe8019;">()</span>
</pre>
</div>
</div>
</li>
<li><a id="org1d4558a"></a>Almacenamiento<br />
<div class="outline-text-5" id="text-org1d4558a">
<ul class="org-ul">
<li>No guardar datos personales innecesarios.</li>
<li>Cifrar almacenamiento si hay datos sensibles.</li>
<li>Respaldar solo lo necesario y cumplir normativa de retención.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3fac825" class="outline-4">
<h4 id="org3fac825">Protección del sitio objetivo (ética técnica)</h4>
<div class="outline-text-4" id="text-org3fac825">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Práctica</th>
<th scope="col" class="org-left">Objetivo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Rate limiting</td>
<td class="org-left">No saturar el servidor; pausas entre peticiones</td>
</tr>

<tr>
<td class="org-left">Horarios valle</td>
<td class="org-left">Ejecutar en horas de menor tráfico si es posible</td>
</tr>

<tr>
<td class="org-left">Cache</td>
<td class="org-left">Evitar repetir peticiones innecesarias</td>
</tr>

<tr>
<td class="org-left">Respetar 429/503</td>
<td class="org-left">Detener o ralentizar si el servidor pide esperar</td>
</tr>

<tr>
<td class="org-left">No evadir bloqueos</td>
<td class="org-left">Si te bloquean, revisar si tu uso es adecuado</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7425bd7" class="outline-4">
<h4 id="org7425bd7">Proxies y escalado (consideraciones)</h4>
<div class="outline-text-4" id="text-org7425bd7">
<ul class="org-ul">
<li>Proxies rotativos: mayor complejidad y coste; puede violar términos de uso.</li>
<li>Antes de usarlos: confirmar legalidad y política del sitio.</li>
<li>Preferir optimizar el ritmo antes que multiplicar IPs.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb4eb86b" class="outline-3">
<h3 id="orgb4eb86b">Fase 7: Ejecución y mantenimiento</h3>
<div class="outline-text-3" id="text-orgb4eb86b">
</div>
