readme.org
*** Logging

#+BEGIN_SRC python
import logging
logging.basicConfig(level=logging.INFO, format="%(asctime)s [%(levelname)s] %(message)s")
logger = logging.getLogger(__name__)
logger.info("Iniciando scraping de %s", url)
logger.warning("Reintento %d para %s", intento, url)
logger.error("Error en %s: %s", url, str(e))
#+END_SRC

*** Monitoreo básico

- Tasa de éxito vs. errores.
- Tiempo de respuesta y códigos HTTP.
- Cambios en la estructura (parsers que dejan de funcionar).

*** Adaptación a cambios

- Los sitios modifican HTML, clases y rutas.
- Diseñar selectores robustos (evitar dependencias frágiles).
- Revisar periódicamente que el scraper sigue funcionando.

** Checklist de seguridad resumido
:PROPERTIES:
:UNNUMBERED: t
:END:

| # | Verificación | Estado |
|---|--------------+--------|
| 1 | Términos de uso y robots.txt revisados | ☐ |
| 2 | Sin API/alternativa viable | ☐ |
| 3 | Credenciales en variables de entorno | ☐ |
| 4 | User-Agent identificable | ☐ |
| 5 | Rate limiting / pausas implementados | ☐ |
| 6 | Manejo de errores y reintentos | ☐ |
| 7 | Validación de URLs y dominios permitidos | ☐ |
| 8 | Sanitización de datos extraídos | ☐ |
| 9 | Sin almacenar datos personales innecesarios | ☐ |
| 10 | Logging y monitoreo básico | ☐ |

** Riesgos y mitigaciones
:PROPERTIES:
:UNNUMBERED: t
:END:

| Riesgo | Mitigación |
|--------+------------|
| Bloqueo de IP | Rate limiting, horarios valle, User-Agent adecuado |
| Cambio de estructura HTML | Selectores resilientes, pruebas periódicas |
| Exposición de credenciales | Variables de entorno, .gitignore |
| Datos personales | Minimización, anonimización, cumplimiento legal |
| Caída del servidor objetivo | Reintentos con backoff, detección de 429/503 |
| Malware en respuestas | Validar tipos MIME, no ejecutar código descargado |
| Sanciones legales | Cumplir ToS, robots.txt y normativa aplicable |

** Referencias
:PROPERTIES:
:UNNUMBERED: t
:END:

- ~Tutorial_Webscraping_XPath_Blogs.org~: Técnicas de scraping con XPath, ejemplo likcos.
- ~Fuentes_Datos_Gobierno_Abierto.org~: INEGI, datos.gob.mx, clima, alternativas legales.
- ~Tutorial_XPath.org~: Sintaxis XPath y comparación XPath vs CSS.
- robots.txt: =https://dominio.com/robots.txt=
- RGPD / LFPDPPP: normativa aplicable a datos personales según jurisdicción.

* Web Scraping con XPath para Blogs Estáticos

** Introducción
:PROPERTIES:
:UNNUMBERED: t
:END:

Este apartado explica cómo hacer *web scraping* con XPath sobre *blogs estáticos* (HTML
pre-renderizado en el servidor), qué consideraciones técnicas y éticas tener, y por qué
*sitios como Amazon* no son adecuados para este enfoque.

*** Prerrequisitos

- Python 3 con =requests=, =lxml= (o =BeautifulSoup= con parser lxml).
- Conocimientos básicos de XPath (ver ~Tutorial_XPath.org~).
- Comprensión de la estructura HTML (etiquetas, clases, ids).

** Blogs estáticos vs. sitios dinámicos
:PROPERTIES:
:UNNUMBERED: t
:END:

*** ¿Qué es un blog estático?

Un blog estático sirve HTML ya generado por el servidor. Al hacer una petición GET,
recibes el contenido completo en la respuesta. No necesitas ejecutar JavaScript para
ver los artículos.

**** Características típicas
- HTML con estructura predecible (artículos en =<article>=, =<div class="post">=, etc.).
- Paginación mediante URLs distintas (=/page/2/=, =?p=2=).
- Contenido público y pensado para ser indexado por buscadores.
- Sin capchas agresivos ni medidas anti-bot fuertes (en muchos casos).

*** ¿Por qué son adecuados para scraping?

| Aspecto        | Blogs estáticos                    |
|----------------+------------------------------------|
| Contenido      | HTML completo en la respuesta      |
| Herramientas   | =requests= + =lxml= suficientes    |
| Estructura     | Generalmente clara y consistente   |
| Legalidad      | Más predecible si es uso personal  |
| robots.txt     | Suele permitir acceso a contenido  |

** Técnicas de scraping para blogs con XPath
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Paso 1: Inspeccionar la estructura HTML

Antes de escribir XPath, abre el blog en el navegador y usa las herramientas de
desarrollador (F12) para ver:

- Contenedor de artículos: =<article>=, =<div class="post">=, =<div class="entry">=.
- Título: =<h1>=, =<h2>=, =<a class="title">=.
- Autor, fecha, categorías.
- Enlace al artículo completo: =<a href="...">=.
- Snippet o extracto: =<p class="excerpt">=, =<div class="summary">=.

*** Paso 2: Obtener el HTML

#+BEGIN_SRC python
import requests
from lxml import etree

url = "https://ejemplo-blog.com/"
headers = {
    "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36"
}
response = requests.get(url, headers=headers)
response.raise_for_status()
html = response.content
#+END_SRC

