index.html
<div id="outline-container-orgbff5b90" class="outline-4">
<h4 id="orgbff5b90">Logging</h4>
<div class="outline-text-4" id="text-orgbff5b90">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> logging
logging.basicConfig<span style="color: #fe8019;">(</span>level=logging.INFO, <span style="color: #fe8019;">format</span>=<span style="color: #b8bb26;">"%(asctime)s [%(levelname)s] %(message)s"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">logger</span> = logging.getLogger<span style="color: #fe8019;">(</span><span style="color: #fe8019;">__name__</span><span style="color: #fe8019;">)</span>
logger.info<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Iniciando scraping de %s"</span>, url<span style="color: #fe8019;">)</span>
logger.warning<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Reintento %d para %s"</span>, intento, url<span style="color: #fe8019;">)</span>
logger.error<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Error en %s: %s"</span>, url, <span style="color: #fe8019;">str</span><span style="color: #b16286;">(</span>e<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga0fb04b" class="outline-4">
<h4 id="orga0fb04b">Monitoreo básico</h4>
<div class="outline-text-4" id="text-orga0fb04b">
<ul class="org-ul">
<li>Tasa de éxito vs. errores.</li>
<li>Tiempo de respuesta y códigos HTTP.</li>
<li>Cambios en la estructura (parsers que dejan de funcionar).</li>
</ul>
</div>
</div>
<div id="outline-container-org1b82da7" class="outline-4">
<h4 id="org1b82da7">Adaptación a cambios</h4>
<div class="outline-text-4" id="text-org1b82da7">
<ul class="org-ul">
<li>Los sitios modifican HTML, clases y rutas.</li>
<li>Diseñar selectores robustos (evitar dependencias frágiles).</li>
<li>Revisar periódicamente que el scraper sigue funcionando.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4fbb0d3" class="outline-3">
<h3 id="org4fbb0d3">Checklist de seguridad resumido</h3>
<div class="outline-text-3" id="text-org4fbb0d3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">#</th>
<th scope="col" class="org-left">Verificación</th>
<th scope="col" class="org-left">Estado</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Términos de uso y robots.txt revisados</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Sin API/alternativa viable</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Credenciales en variables de entorno</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">User-Agent identificable</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Rate limiting / pausas implementados</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Manejo de errores y reintentos</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Validación de URLs y dominios permitidos</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Sanitización de datos extraídos</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Sin almacenar datos personales innecesarios</td>
<td class="org-left">☐</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Logging y monitoreo básico</td>
<td class="org-left">☐</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org776ddf6" class="outline-3">
<h3 id="org776ddf6">Riesgos y mitigaciones</h3>
<div class="outline-text-3" id="text-org776ddf6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Riesgo</th>
<th scope="col" class="org-left">Mitigación</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Bloqueo de IP</td>
<td class="org-left">Rate limiting, horarios valle, User-Agent adecuado</td>
</tr>

<tr>
<td class="org-left">Cambio de estructura HTML</td>
<td class="org-left">Selectores resilientes, pruebas periódicas</td>
</tr>

<tr>
<td class="org-left">Exposición de credenciales</td>
<td class="org-left">Variables de entorno, .gitignore</td>
</tr>

<tr>
<td class="org-left">Datos personales</td>
<td class="org-left">Minimización, anonimización, cumplimiento legal</td>
</tr>

<tr>
<td class="org-left">Caída del servidor objetivo</td>
<td class="org-left">Reintentos con backoff, detección de 429/503</td>
</tr>

<tr>
<td class="org-left">Malware en respuestas</td>
<td class="org-left">Validar tipos MIME, no ejecutar código descargado</td>
</tr>

<tr>
<td class="org-left">Sanciones legales</td>
<td class="org-left">Cumplir ToS, robots.txt y normativa aplicable</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgeaca0d6" class="outline-3">
<h3 id="orgeaca0d6">Referencias</h3>
<div class="outline-text-3" id="text-orgeaca0d6">
<ul class="org-ul">
<li><code>Tutorial_Webscraping_XPath_Blogs.org</code>: Técnicas de scraping con XPath, ejemplo likcos.</li>
<li><code>Fuentes_Datos_Gobierno_Abierto.org</code>: INEGI, datos.gob.mx, clima, alternativas legales.</li>
<li><code>Tutorial_XPath.org</code>: Sintaxis XPath y comparación XPath vs CSS.</li>
<li>robots.txt: <code>https://dominio.com/robots.txt</code></li>
<li>RGPD / LFPDPPP: normativa aplicable a datos personales según jurisdicción.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb20dc24" class="outline-2">
<h2 id="orgb20dc24">Web Scraping con XPath para Blogs Estáticos</h2>
<div class="outline-text-2" id="text-orgb20dc24">
</div>
<div id="outline-container-org894c641" class="outline-3">
<h3 id="org894c641">Introducción</h3>
<div class="outline-text-3" id="text-org894c641">
<p>
Este apartado explica cómo hacer <b>web scraping</b> con XPath sobre <b>blogs estáticos</b> (HTML
pre-renderizado en el servidor), qué consideraciones técnicas y éticas tener, y por qué
<b>sitios como Amazon</b> no son adecuados para este enfoque.
</p>
</div>
<div id="outline-container-org13ececa" class="outline-4">
<h4 id="org13ececa">Prerrequisitos</h4>
<div class="outline-text-4" id="text-org13ececa">
<ul class="org-ul">
<li>Python 3 con <code>requests</code>, <code>lxml</code> (o <code>BeautifulSoup</code> con parser lxml).</li>
<li>Conocimientos básicos de XPath (ver <code>Tutorial_XPath.org</code>).</li>
<li>Comprensión de la estructura HTML (etiquetas, clases, ids).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org982936e" class="outline-3">
<h3 id="org982936e">Blogs estáticos vs. sitios dinámicos</h3>
<div class="outline-text-3" id="text-org982936e">
</div>
<div id="outline-container-orgaf0449a" class="outline-4">
<h4 id="orgaf0449a">¿Qué es un blog estático?</h4>
<div class="outline-text-4" id="text-orgaf0449a">
<p>
Un blog estático sirve HTML ya generado por el servidor. Al hacer una petición GET,
recibes el contenido completo en la respuesta. No necesitas ejecutar JavaScript para
ver los artículos.
</p>
</div>
<ul class="org-ul">
<li><a id="orgc643719"></a>Características típicas<br />
<div class="outline-text-5" id="text-orgc643719">
<ul class="org-ul">
<li>HTML con estructura predecible (artículos en <code>&lt;article&gt;</code>, <code>&lt;div class</code>"post"&gt;=, etc.).</li>
<li>Paginación mediante URLs distintas (<code>/page/2/</code>, <code>?p=2</code>).</li>
<li>Contenido público y pensado para ser indexado por buscadores.</li>
<li>Sin capchas agresivos ni medidas anti-bot fuertes (en muchos casos).</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgc1be984" class="outline-4">
<h4 id="orgc1be984">¿Por qué son adecuados para scraping?</h4>
<div class="outline-text-4" id="text-orgc1be984">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspecto</th>
<th scope="col" class="org-left">Blogs estáticos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Contenido</td>
<td class="org-left">HTML completo en la respuesta</td>
</tr>

<tr>
<td class="org-left">Herramientas</td>
<td class="org-left"><code>requests</code> + <code>lxml</code> suficientes</td>
</tr>

<tr>
<td class="org-left">Estructura</td>
<td class="org-left">Generalmente clara y consistente</td>
</tr>

<tr>
<td class="org-left">Legalidad</td>
<td class="org-left">Más predecible si es uso personal</td>
</tr>

<tr>
<td class="org-left">robots.txt</td>
<td class="org-left">Suele permitir acceso a contenido</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgdaa964f" class="outline-3">
<h3 id="orgdaa964f">Técnicas de scraping para blogs con XPath</h3>
<div class="outline-text-3" id="text-orgdaa964f">
</div>
<div id="outline-container-org7d48a8b" class="outline-4">
<h4 id="org7d48a8b">Paso 1: Inspeccionar la estructura HTML</h4>
<div class="outline-text-4" id="text-org7d48a8b">
<p>
Antes de escribir XPath, abre el blog en el navegador y usa las herramientas de
desarrollador (F12) para ver:
</p>

<ul class="org-ul">
<li>Contenedor de artículos: <code>&lt;article&gt;</code>, <code>&lt;div class</code>"post"&gt;=, <code>&lt;div class</code>"entry"&gt;=.</li>
<li>Título: <code>&lt;h1&gt;</code>, <code>&lt;h2&gt;</code>, <code>&lt;a class</code>"title"&gt;=.</li>
<li>Autor, fecha, categorías.</li>
<li>Enlace al artículo completo: <code>&lt;a href</code>"&#x2026;"&gt;=.</li>
<li>Snippet o extracto: <code>&lt;p class</code>"excerpt"&gt;=, <code>&lt;div class</code>"summary"&gt;=.</li>
</ul>
</div>
</div>
<div id="outline-container-org37ca7a9" class="outline-4">
<h4 id="org37ca7a9">Paso 2: Obtener el HTML</h4>
<div class="outline-text-4" id="text-org37ca7a9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> requests
<span style="color: #fb4934;">from</span> lxml <span style="color: #fb4934;">import</span> etree

<span style="color: #83a598;">url</span> = <span style="color: #b8bb26;">"https://ejemplo-blog.com/"</span>
<span style="color: #83a598;">headers</span> = <span style="color: #fe8019;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"User-Agent"</span>: <span style="color: #b8bb26;">"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36"</span>
<span style="color: #fe8019;">}</span>
<span style="color: #83a598;">response</span> = requests.get<span style="color: #fe8019;">(</span>url, headers=headers<span style="color: #fe8019;">)</span>
response.raise_for_status<span style="color: #fe8019;">()</span>
<span style="color: #83a598;">html</span> = response.content
</pre>
</div>
</div>
</div>
