readme.org
*** Paso 3: Parsear y aplicar XPath

#+BEGIN_SRC python
tree = etree.HTML(html)

# Ejemplos típicos para blogs (ajustar selectores según el sitio):
# Todos los artículos
articulos = tree.xpath("//article")
# o
articulos = tree.xpath("//div[contains(@class, 'post')]")

# Título del primer artículo
titulo = tree.xpath("//article[1]//h2/a/text()")[0].strip()

# Enlace al artículo
enlace = tree.xpath("//article[1]//h2/a/@href")[0]

# Fecha (si está en un elemento con clase 'date')
fecha = tree.xpath("//article[1]//time/@datetime")
fecha = fecha[0] if fecha else tree.xpath("//article[1]//*[contains(@class,'date')]/text()")

# Extracto o resumen
extracto = tree.xpath("//article[1]//div[contains(@class,'excerpt')]//text()")
extracto = " ".join(t.strip() for t in extracto if t.strip())
#+END_SRC

*** Paso 4: Extraer todos los artículos de una página

#+BEGIN_SRC python
def extraer_articulos_pagina(html):
    tree = etree.HTML(html)
    articulos = tree.xpath("//article")
    resultado = []
    for art in articulos:
        titulo = art.xpath(".//h2/a/text() | .//h1/a/text() | .//.//a[contains(@class,'title')]/text()")
        enlace = art.xpath(".//h2/a/@href | .//h1/a/@href | .//a[contains(@class,'title')]/@href")
        extracto = art.xpath(".//div[contains(@class,'excerpt')]//text() | .//p[contains(@class,'summary')]//text()")
        resultado.append({
            "titulo": titulo[0].strip() if titulo else "",
            "enlace": enlace[0] if enlace else "",
            "extracto": " ".join(t.strip() for t in extracto if t.strip())[:200]
        })
    return resultado
#+END_SRC

*** Paso 5: Paginación

Muchos blogs usan URLs como =/page/2/=, =/?paged=2=, =/blog?page=2=:

#+BEGIN_SRC python
import time

base_url = "https://ejemplo-blog.com/page/{}/"
for pagina in range(1, 6):  # páginas 1 a 5
    url = base_url.format(pagina)
    response = requests.get(url, headers=headers)
    articulos = extraer_articulos_pagina(response.content)
    for a in articulos:
        print(a["titulo"], a["enlace"])
    time.sleep(1)  # respetar el servidor: pausa entre peticiones
#+END_SRC

*** XPath útiles para blogs (resumen)

| Objetivo          | XPath típico                                           |
|-------------------+--------------------------------------------------------|
| Contenedor posts  | =//article=, =//div[contains(@class,'post')]=          |
| Título            | =.//h1/a/text()=, =.//h2/a/text()=                     |
| Enlace            | =.//h1/a/@href=, =.//a[contains(@class,'entry-link')]/@href= |
| Fecha             | =.//time/@datetime=, =.//*[contains(@class,'date')]/text()= |
| Autor             | =.//*[contains(@class,'author')]/text()=               |
| Categorías        | =.//a[contains(@class,'category')]/text()=             |
| Extracto          | =.//div[contains(@class,'excerpt')]//text()=           |

** Consideraciones éticas y legales

*** Buenas prácticas

1. *robots.txt*: Revisar si el sitio prohíbe o limita el scraping.
2. *User-Agent*: Identificarse de forma razonable (no hacerse pasar por bot de Google).
3. *Rate limiting*: Hacer pausas entre peticiones (=time.sleep(1)= o más).
4. *Uso razonable*: Evitar sobrecargar el servidor; respetar términos de uso.
5. *Atribución*: Si redistribuyes contenido, cita la fuente.

