index.html
<div id="outline-container-org4e1b772" class="outline-4">
<h4 id="org4e1b772">Paso 3: Parsear y aplicar XPath</h4>
<div class="outline-text-4" id="text-org4e1b772">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #83a598;">tree</span> = etree.HTML<span style="color: #fe8019;">(</span>html<span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Ejemplos t&#237;picos para blogs (ajustar selectores seg&#250;n el sitio):
</span><span style="color: #928374;"># </span><span style="color: #928374;">Todos los art&#237;culos
</span><span style="color: #83a598;">articulos</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article"</span><span style="color: #fe8019;">)</span>
<span style="color: #928374;"># </span><span style="color: #928374;">o
</span><span style="color: #83a598;">articulos</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//div[contains(@class, 'post')]"</span><span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">T&#237;tulo del primer art&#237;culo
</span><span style="color: #83a598;">titulo</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article[1]//h2/a/text()"</span><span style="color: #fe8019;">)[</span>0<span style="color: #fe8019;">]</span>.strip<span style="color: #fe8019;">()</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Enlace al art&#237;culo
</span><span style="color: #83a598;">enlace</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article[1]//h2/a/@href"</span><span style="color: #fe8019;">)[</span>0<span style="color: #fe8019;">]</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Fecha (si est&#225; en un elemento con clase 'date')
</span><span style="color: #83a598;">fecha</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article[1]//time/@datetime"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">fecha</span> = fecha<span style="color: #fe8019;">[</span>0<span style="color: #fe8019;">]</span> <span style="color: #fb4934;">if</span> fecha <span style="color: #fb4934;">else</span> tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article[1]//*[contains(@class,'date')]/text()"</span><span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Extracto o resumen
</span><span style="color: #83a598;">extracto</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article[1]//div[contains(@class,'excerpt')]//text()"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">extracto</span> = <span style="color: #b8bb26;">" "</span>.join<span style="color: #fe8019;">(</span>t.strip<span style="color: #b16286;">()</span> <span style="color: #fb4934;">for</span> t <span style="color: #fb4934;">in</span> extracto <span style="color: #fb4934;">if</span> t.strip<span style="color: #b16286;">()</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0198aa7" class="outline-4">
<h4 id="org0198aa7">Paso 4: Extraer todos los artículos de una página</h4>
<div class="outline-text-4" id="text-org0198aa7">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">extraer_articulos_pagina</span><span style="color: #fe8019;">(</span>html<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">tree</span> = etree.HTML<span style="color: #fe8019;">(</span>html<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">articulos</span> = tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">resultado</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> art <span style="color: #fb4934;">in</span> articulos:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">titulo</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//h2/a/text() | .//h1/a/text() | .//.//a[contains(@class,'title')]/text()"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">enlace</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//h2/a/@href | .//h1/a/@href | .//a[contains(@class,'title')]/@href"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">extracto</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//div[contains(@class,'excerpt')]//text() | .//p[contains(@class,'summary')]//text()"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   resultado.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"titulo"</span>: titulo<span style="color: #b8bb26;">[</span>0<span style="color: #b8bb26;">]</span>.strip<span style="color: #b8bb26;">()</span> <span style="color: #fb4934;">if</span> titulo <span style="color: #fb4934;">else</span> <span style="color: #b8bb26;">""</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"enlace"</span>: enlace<span style="color: #b8bb26;">[</span>0<span style="color: #b8bb26;">]</span> <span style="color: #fb4934;">if</span> enlace <span style="color: #fb4934;">else</span> <span style="color: #b8bb26;">""</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"extracto"</span>: <span style="color: #b8bb26;">" "</span>.join<span style="color: #b8bb26;">(</span>t.strip<span style="color: #83a598;">()</span> <span style="color: #fb4934;">for</span> t <span style="color: #fb4934;">in</span> extracto <span style="color: #fb4934;">if</span> t.strip<span style="color: #83a598;">()</span><span style="color: #b8bb26;">)[</span>:200<span style="color: #b8bb26;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> resultado
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4ed267" class="outline-4">
<h4 id="orgb4ed267">Paso 5: Paginación</h4>
<div class="outline-text-4" id="text-orgb4ed267">
<p>
Muchos blogs usan URLs como <code>/page/2/</code>, <code>/?paged=2</code>, <code>/blog?page=2</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> time

<span style="color: #83a598;">base_url</span> = <span style="color: #b8bb26;">"https://ejemplo-blog.com/page/{}/"</span>
<span style="color: #fb4934;">for</span> pagina <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">range</span><span style="color: #fe8019;">(</span>1, 6<span style="color: #fe8019;">)</span>:  <span style="color: #928374;"># </span><span style="color: #928374;">p&#225;ginas 1 a 5
</span><span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">url</span> = base_url.<span style="color: #fe8019;">format</span><span style="color: #fe8019;">(</span>pagina<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">response</span> = requests.get<span style="color: #fe8019;">(</span>url, headers=headers<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">articulos</span> = extraer_articulos_pagina<span style="color: #fe8019;">(</span>response.content<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> a <span style="color: #fb4934;">in</span> articulos:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>a<span style="color: #b16286;">[</span><span style="color: #b8bb26;">"titulo"</span><span style="color: #b16286;">]</span>, a<span style="color: #b16286;">[</span><span style="color: #b8bb26;">"enlace"</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   time.sleep<span style="color: #fe8019;">(</span>1<span style="color: #fe8019;">)</span>  <span style="color: #928374;"># </span><span style="color: #928374;">respetar el servidor: pausa entre peticiones</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1044f95" class="outline-4">
<h4 id="org1044f95">XPath útiles para blogs (resumen)</h4>
<div class="outline-text-4" id="text-org1044f95">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Objetivo</th>
<th scope="col" class="org-left">XPath típico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Contenedor posts</td>
<td class="org-left"><code>//article</code>, <code>//div[contains(@class,'post')]</code></td>
</tr>

<tr>
<td class="org-left">Título</td>
<td class="org-left"><code>.//h1/a/text()</code>, <code>.//h2/a/text()</code></td>
</tr>

<tr>
<td class="org-left">Enlace</td>
<td class="org-left"><code>.//h1/a/@href</code>, <code>.//a[contains(@class,'entry-link')]/@href</code></td>
</tr>

<tr>
<td class="org-left">Fecha</td>
<td class="org-left"><code>.//time/@datetime</code>, <code>.//*[contains(@class,'date')]/text()</code></td>
</tr>

<tr>
<td class="org-left">Autor</td>
<td class="org-left"><code>.//*[contains(@class,'author')]/text()</code></td>
</tr>

<tr>
<td class="org-left">Categorías</td>
<td class="org-left"><code>.//a[contains(@class,'category')]/text()</code></td>
</tr>

<tr>
<td class="org-left">Extracto</td>
<td class="org-left"><code>.//div[contains(@class,'excerpt')]//text()</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orge3dd608" class="outline-3">
<h3 id="orge3dd608">Consideraciones éticas y legales</h3>
<div class="outline-text-3" id="text-orge3dd608">
</div>
<div id="outline-container-org024301b" class="outline-4">
<h4 id="org024301b">Buenas prácticas</h4>
<div class="outline-text-4" id="text-org024301b">
<ol class="org-ol">
<li><b>robots.txt</b>: Revisar si el sitio prohíbe o limita el scraping.</li>
<li><b>User-Agent</b>: Identificarse de forma razonable (no hacerse pasar por bot de Google).</li>
<li><b>Rate limiting</b>: Hacer pausas entre peticiones (<code>time.sleep(1)</code> o más).</li>
<li><b>Uso razonable</b>: Evitar sobrecargar el servidor; respetar términos de uso.</li>
<li><b>Atribución</b>: Si redistribuyes contenido, cita la fuente.</li>
</ol>
</div>
</div>
