index.html
<div id="outline-container-orgbc75119" class="outline-4">
<h4 id="orgbc75119">Cuándo es más aceptable</h4>
<div class="outline-text-4" id="text-orgbc75119">
<ul class="org-ul">
<li>Blogs personales o pequeños con contenido público.</li>
<li>Uso educativo o de investigación.</li>
<li>Agregadores de noticias que respetan robots.txt y términos de uso.</li>
<li>Contenido bajo licencias abiertas (CC, etc.).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9b0bcd5" class="outline-3">
<h3 id="org9b0bcd5">Por qué NO es adecuado hacer scraping en Amazon (y similares)</h3>
<div class="outline-text-3" id="text-org9b0bcd5">
</div>
<div id="outline-container-orga25f19a" class="outline-4">
<h4 id="orga25f19a">1. Términos de uso y condiciones</h4>
<div class="outline-text-4" id="text-orga25f19a">
<p>
Amazon (y la mayoría de grandes plataformas) <b>prohíben explícitamente</b> el scraping en
sus condiciones de servicio. Hacerlo puede suponer:
</p>

<ul class="org-ul">
<li>Suspensión o cierre de cuenta.</li>
<li>Acciones legales.</li>
<li>Bloqueo de IP.</li>
</ul>

<p>
No es una limitación técnica, sino contractual y legal.
</p>
</div>
</div>
<div id="outline-container-orgd2b4f3f" class="outline-4">
<h4 id="orgd2b4f3f">2. Contenido dinámico (JavaScript)</h4>
<div class="outline-text-4" id="text-orgd2b4f3f">
<p>
Amazon carga gran parte del contenido mediante JavaScript:
</p>

<ul class="org-ul">
<li>Listados de productos se actualizan con peticiones AJAX.</li>
<li>Precios, disponibilidad y valoraciones se insertan después del HTML inicial.</li>
<li>Una petición con <code>requests</code> devuelve HTML casi vacío respecto a lo que ves en el navegador.</li>
</ul>

<p>
Para scraping efectivo haría falta un navegador headless (Selenium, Playwright), lo que:
</p>

<ul class="org-ul">
<li>Es más complejo y pesado.</li>
<li>Genera más carga para el servidor.</li>
<li>Suele detectarse más fácilmente como bot.</li>
</ul>
</div>
</div>
<div id="outline-container-org3bc1bb4" class="outline-4">
<h4 id="org3bc1bb4">3. Medidas anti-bot</h4>
<div class="outline-text-4" id="text-org3bc1bb4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Medida</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Rate limiting</td>
<td class="org-left">Bloqueo temporal tras muchas peticiones</td>
</tr>

<tr>
<td class="org-left">CAPTCHAs</td>
<td class="org-left">Verificaciones que rompen automatización</td>
</tr>

<tr>
<td class="org-left">Fingerprinting</td>
<td class="org-left">Detección de patrones de navegación</td>
</tr>

<tr>
<td class="org-left">IP blocking</td>
<td class="org-left">Bloqueo de IPs sospechosas</td>
</tr>

<tr>
<td class="org-left">Contenido ofuscado</td>
<td class="org-left">Clases/ids aleatorios que cambian</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5548a4b" class="outline-4">
<h4 id="org5548a4b">4. Estructura cambiante</h4>
<div class="outline-text-4" id="text-org5548a4b">
<ul class="org-ul">
<li>El HTML de Amazon cambia con frecuencia (A/B tests, rediseños).</li>
<li>Selectores XPath que funcionan hoy pueden dejar de hacerlo en semanas.</li>
<li>Mantener un scraper estable es costoso y frágil.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc4b27ed" class="outline-4">
<h4 id="orgc4b27ed">5. Alternativas legales y recomendadas</h4>
<div class="outline-text-4" id="text-orgc4b27ed">
<ul class="org-ul">
<li><b>Amazon Product Advertising API</b>: Para afiliados y partners autorizados.</li>
<li><b>Otros APIs oficiales</b>: Muchas tiendas ofrecen APIs para precios, inventario, etc.</li>
<li><b>Bases de datos de terceros</b>: Datasets académicos o comerciales de productos.</li>
</ul>
</div>
</div>
<div id="outline-container-org45b46e2" class="outline-4">
<h4 id="org45b46e2">Resumen: Amazon vs. blog estático</h4>
<div class="outline-text-4" id="text-org45b46e2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspecto</th>
<th scope="col" class="org-left">Blog estático</th>
<th scope="col" class="org-left">Amazon (y similares)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Términos de uso</td>
<td class="org-left">Suele ser tolerable</td>
<td class="org-left">Prohibido explícitamente</td>
</tr>

<tr>
<td class="org-left">Contenido</td>
<td class="org-left">HTML estático completo</td>
<td class="org-left">Mucho contenido dinámico</td>
</tr>

<tr>
<td class="org-left">Anti-bot</td>
<td class="org-left">Escaso o inexistente</td>
<td class="org-left">Muy presente</td>
</tr>

<tr>
<td class="org-left">Estructura</td>
<td class="org-left">Estable y predecible</td>
<td class="org-left">Cambia con frecuencia</td>
</tr>

<tr>
<td class="org-left">Alternativas</td>
<td class="org-left">Scraping razonable</td>
<td class="org-left">Usar API oficial</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
