readme.org
** Ejemplo completo: scraper para un blog estático
:PROPERTIES:
:UNNUMBERED: t
:END:

#+BEGIN_SRC python
import requests
from lxml import etree
import time
import csv

def scrape_blog(base_url, num_paginas=3):
    """Extrae artículos de un blog estático con paginación /page/N/."""
    headers = {"User-Agent": "Mozilla/5.0 (compatible; BlogStudyBot/1.0)"}
    articulos = []
    for p in range(1, num_paginas + 1):
        url = f"{base_url.rstrip('/')}/page/{p}/" if p > 1 else base_url
        try:
            r = requests.get(url, headers=headers, timeout=10)
            r.raise_for_status()
            tree = etree.HTML(r.content)
            for art in tree.xpath("//article"):
                tit = art.xpath(".//h2/a/text() | .//h1/a/text()")
                lnk = art.xpath(".//h2/a/@href | .//h1/a/@href")
                ext = art.xpath(".//div[contains(@class,'excerpt')]//text()")
                articulos.append({
                    "titulo": tit[0].strip() if tit else "",
                    "enlace": lnk[0] if lnk else "",
                    "extracto": " ".join(t.strip() for t in ext if t.strip())[:300]
                })
        except Exception as e:
            print(f"Error en {url}: {e}")
        time.sleep(1)
    return articulos

# Uso (sustituir por un blog real que permita scraping):
# datos = scrape_blog("https://ejemplo-blog.com/", num_paginas=3)
# for a in datos:
#     print(a["titulo"], "->", a["enlace"])
#+END_SRC

** Dependencias

#+BEGIN_EXAMPLE
pip install requests lxml
#+END_EXAMPLE

** Referencias

- ~Tutorial_XPath.org~: Sintaxis y ejemplos de XPath.
- =robots.txt=: Revisar =https://dominio.com/robots.txt= antes de scrapear.
- APIs: Buscar si el sitio ofrece una API oficial antes de automatizar.




*  Fuentes de Datos Gubernamentales y Abiertos: INEGI, datos.gob.mx y más

** Introducción

Instituciones gubernamentales publican *datos abiertos* bajo marcos legales que permiten
su reutilización. Es preferible usar *APIs oficiales* o *descargas directas* en lugar de
scraping cuando están disponibles: son legales, estables y eficientes.

Este apartado recopila fuentes como *INEGI*, *datos.gob.mx* y otras donde sí podemos
obtener información de forma adecuada.

** INEGI (México)
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Qué es INEGI

El *Instituto Nacional de Estadística y Geografía* (INEGI) produce estadísticas y
geografía de México. Ofrece varias formas de acceso programático a sus datos.

*** API del Banco de Indicadores

**** Registro y token

- URL: ~https://www.inegi.org.mx/servicios/api_indicadores.html~
- Requiere *registro* para obtener un *token*.
- Registro: ~https://www.inegi.org.mx/app/desarrolladores/registro/default.html~

**** Parámetros típicos

| Parámetro         | Descripción                            | Ejemplo                      |
|-------------------+----------------------------------------+------------------------------|
| IdIndicador       | Clave del indicador                    | 1002000001 (Población total) |
| Idioma            | es / en                                | es                           |
| Área geográfica   | 00=nacional, 99=entidad, 999=municipio | 00                           |
| Dato más reciente | true / false                           | false (serie histórica)      |
| Fuente            | BISE, etc.                             | BISE                         |
| Token             | Token de registro                      | [tu token]                   |
| Formato           | json, jsonp, xml                       | json                         |

