index.html
<div id="outline-container-org96df0af" class="outline-3">
<h3 id="org96df0af">Ejemplo completo: scraper para un blog estático</h3>
<div class="outline-text-3" id="text-org96df0af">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> requests
<span style="color: #fb4934;">from</span> lxml <span style="color: #fb4934;">import</span> etree
<span style="color: #fb4934;">import</span> time
<span style="color: #fb4934;">import</span> csv

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">scrape_blog</span><span style="color: #fe8019;">(</span>base_url, num_paginas=3<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""Extrae art&#237;culos de un blog est&#225;tico con paginaci&#243;n /page/N/."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">headers</span> = <span style="color: #fe8019;">{</span><span style="color: #b8bb26;">"User-Agent"</span>: <span style="color: #b8bb26;">"Mozilla/5.0 (compatible; BlogStudyBot/1.0)"</span><span style="color: #fe8019;">}</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">articulos</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> p <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">range</span><span style="color: #fe8019;">(</span>1, num_paginas + 1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">url</span> = f<span style="color: #b8bb26;">"</span>{base_url.rstrip('/')}<span style="color: #b8bb26;">/page/</span>{p}<span style="color: #b8bb26;">/"</span> <span style="color: #fb4934;">if</span> p &gt; 1 <span style="color: #fb4934;">else</span> base_url
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">try</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">r</span> = requests.get<span style="color: #fe8019;">(</span>url, headers=headers, timeout=10<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   r.raise_for_status<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">tree</span> = etree.HTML<span style="color: #fe8019;">(</span>r.content<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> art <span style="color: #fb4934;">in</span> tree.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"//article"</span><span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">tit</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//h2/a/text() | .//h1/a/text()"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">lnk</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//h2/a/@href | .//h1/a/@href"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">ext</span> = art.xpath<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">".//div[contains(@class,'excerpt')]//text()"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   articulos.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">{</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"titulo"</span>: tit<span style="color: #b8bb26;">[</span>0<span style="color: #b8bb26;">]</span>.strip<span style="color: #b8bb26;">()</span> <span style="color: #fb4934;">if</span> tit <span style="color: #fb4934;">else</span> <span style="color: #b8bb26;">""</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"enlace"</span>: lnk<span style="color: #b8bb26;">[</span>0<span style="color: #b8bb26;">]</span> <span style="color: #fb4934;">if</span> lnk <span style="color: #fb4934;">else</span> <span style="color: #b8bb26;">""</span>,
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b8bb26;">"extracto"</span>: <span style="color: #b8bb26;">" "</span>.join<span style="color: #b8bb26;">(</span>t.strip<span style="color: #83a598;">()</span> <span style="color: #fb4934;">for</span> t <span style="color: #fb4934;">in</span> ext <span style="color: #fb4934;">if</span> t.strip<span style="color: #83a598;">()</span><span style="color: #b8bb26;">)[</span>:300<span style="color: #b8bb26;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">except</span> <span style="color: #fabd2f;">Exception</span> <span style="color: #fb4934;">as</span> e:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"Error en </span>{url}<span style="color: #b8bb26;">: </span>{e}<span style="color: #b8bb26;">"</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   time.sleep<span style="color: #fe8019;">(</span>1<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> articulos

<span style="color: #928374;"># </span><span style="color: #928374;">Uso (sustituir por un blog real que permita scraping):
</span><span style="color: #928374;"># </span><span style="color: #928374;">datos = scrape_blog("https://ejemplo-blog.com/", num_paginas=3)
</span><span style="color: #928374;"># </span><span style="color: #928374;">for a in datos:
</span><span style="color: #928374;">#     </span><span style="color: #928374;">print(a["titulo"], "-&gt;", a["enlace"])</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1e7c5c" class="outline-3">
<h3 id="orge1e7c5c">Dependencias</h3>
<div class="outline-text-3" id="text-orge1e7c5c">
<pre class="example" id="org5c580d4">
pip install requests lxml
</pre>
</div>
</div>
<div id="outline-container-orgec10f14" class="outline-3">
<h3 id="orgec10f14">Referencias</h3>
<div class="outline-text-3" id="text-orgec10f14">
<ul class="org-ul">
<li><code>Tutorial_XPath.org</code>: Sintaxis y ejemplos de XPath.</li>
<li><code>robots.txt</code>: Revisar <code>https://dominio.com/robots.txt</code> antes de scrapear.</li>
<li>APIs: Buscar si el sitio ofrece una API oficial antes de automatizar.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org30f7650" class="outline-2">
<h2 id="org30f7650">Fuentes de Datos Gubernamentales y Abiertos: INEGI, datos.gob.mx y más</h2>
<div class="outline-text-2" id="text-org30f7650">
</div>
<div id="outline-container-org3343434" class="outline-3">
<h3 id="org3343434">Introducción</h3>
<div class="outline-text-3" id="text-org3343434">
<p>
Instituciones gubernamentales publican <b>datos abiertos</b> bajo marcos legales que permiten
su reutilización. Es preferible usar <b>APIs oficiales</b> o <b>descargas directas</b> en lugar de
scraping cuando están disponibles: son legales, estables y eficientes.
</p>

<p>
Este apartado recopila fuentes como <b>INEGI</b>, <b>datos.gob.mx</b> y otras donde sí podemos
obtener información de forma adecuada.
</p>
</div>
</div>
<div id="outline-container-org5833d57" class="outline-3">
<h3 id="org5833d57">INEGI (México)</h3>
<div class="outline-text-3" id="text-org5833d57">
</div>
<div id="outline-container-orgfd8e9c6" class="outline-4">
<h4 id="orgfd8e9c6">Qué es INEGI</h4>
<div class="outline-text-4" id="text-orgfd8e9c6">
<p>
El <b>Instituto Nacional de Estadística y Geografía</b> (INEGI) produce estadísticas y
geografía de México. Ofrece varias formas de acceso programático a sus datos.
</p>
</div>
</div>
<div id="outline-container-org0f2c8e7" class="outline-4">
<h4 id="org0f2c8e7">API del Banco de Indicadores</h4>
<div class="outline-text-4" id="text-org0f2c8e7">
</div>
<ul class="org-ul">
<li><a id="orgdc494df"></a>Registro y token<br />
<div class="outline-text-5" id="text-orgdc494df">
<ul class="org-ul">
<li>URL: <code>https://www.inegi.org.mx/servicios/api_indicadores.html</code></li>
<li>Requiere <b>registro</b> para obtener un <b>token</b>.</li>
<li>Registro: <code>https://www.inegi.org.mx/app/desarrolladores/registro/default.html</code></li>
</ul>
</div>
</li>
<li><a id="orgd1b9176"></a>Parámetros típicos<br />
<div class="outline-text-5" id="text-orgd1b9176">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parámetro</th>
<th scope="col" class="org-left">Descripción</th>
<th scope="col" class="org-left">Ejemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">IdIndicador</td>
<td class="org-left">Clave del indicador</td>
<td class="org-left">1002000001 (Población total)</td>
</tr>

<tr>
<td class="org-left">Idioma</td>
<td class="org-left">es / en</td>
<td class="org-left">es</td>
</tr>

<tr>
<td class="org-left">Área geográfica</td>
<td class="org-left">00=nacional, 99=entidad, 999=municipio</td>
<td class="org-left">00</td>
</tr>

<tr>
<td class="org-left">Dato más reciente</td>
<td class="org-left">true / false</td>
<td class="org-left">false (serie histórica)</td>
</tr>

<tr>
<td class="org-left">Fuente</td>
<td class="org-left">BISE, etc.</td>
<td class="org-left">BISE</td>
</tr>

<tr>
<td class="org-left">Token</td>
<td class="org-left">Token de registro</td>
<td class="org-left">[tu token]</td>
</tr>

<tr>
<td class="org-left">Formato</td>
<td class="org-left">json, jsonp, xml</td>
<td class="org-left">json</td>
</tr>
</tbody>
</table>
</div>
</li>
