readme.org
**** Ejemplo en Python (API Indicadores)

#+BEGIN_SRC python
import requests

TOKEN = "TU_TOKEN_AQUI"  # Obtener en inegi.org.mx/app/desarrolladores/registro
# Indicador 1002000001 = Población total
url = (
    f"https://www.inegi.org.mx/app/api/indicadores/desarrolladores/jsonxml/"
    f"INDICATOR/1002000001/es/00/false/BISE/2.0/{TOKEN}?type=json"
)
response = requests.get(url)
data = response.json()
# Estructura: data["Series"][0]["OBSERVATIONS"]
for obs in data.get("Series", [{}])[0].get("OBSERVATIONS", []):
    print(obs["TIME_PERIOD"], obs["OBS_VALUE"])
#+END_SRC

*** API DENUE (Directorio Estadístico Nacional de Unidades Económicas)

- URL: ~https://www.inegi.org.mx/servicios/api_denue.html~
- Busca establecimientos por palabra, actividad económica, ubicación, etc.
- Requiere token.
- Devuelve JSON con unidades económicas.

**** Ejemplo de consulta DENUE

#+BEGIN_SRC python
TOKEN = "TU_TOKEN"
busqueda = "restaurante"
entidad = "19"  # Nuevo León
url = f"https://www.inegi.org.mx/app/api/denue/v1/consulta/buscar/{busqueda}/{entidad}/{TOKEN}"
response = requests.get(url)
establecimientos = response.json()
#+END_SRC

*** Datos Abiertos INEGI

- URL: ~https://www.inegi.org.mx/datosabiertos/~
- Archivos en formatos estándar (CSV, Excel, etc.).
- Descarga directa sin API; suele usarse para conjuntos grandes.

*** Descarga Masiva INEGI

- URL: ~https://www.inegi.org.mx/app/descarga/~
- Permite seleccionar DENUE, Banco de Indicadores, Inventario Nacional de Viviendas,
  microdatos y tabulados por área geográfica, tema, período y formato.

*** Librería inegipy (Python)

#+BEGIN_EXAMPLE
pip install inegipy
#+END_EXAMPLE

Facilita el acceso al Banco de Indicadores, DENUE y Marco Geoestadístico.
Documentación: ~https://pypi.org/project/inegipy/~

** datos.gob.mx (Plataforma Nacional de Datos Abiertos)
:PROPERTIES:
:UNNUMBERED: t
:END:

*** Qué es datos.gob.mx

Plataforma centralizada de *datos abiertos* del Gobierno de México. Incluye miles de
bases de datos de dependencias federales, estatales y organismos autónomos.

- URL: ~https://datos.gob.mx/~
- Más de 5 000 bases de datos.
- Categorías: Economía, Educación, Salud, Cultura, Ciencia y Tecnología, etc.

*** API CKAN

La plataforma usa *CKAN*. Su API permite listar conjuntos, buscar y obtener URLs de
descarga de recursos (CSV, Excel, etc.).

**** Endpoints útiles

| Acción | URL | Descripción |
|--------+-----+-------------|
| Listar datasets | =/api/3/action/package_list= | IDs de todos los conjuntos |
| Ver dataset | =/api/3/action/package_show?id=ID= | Metadatos y recursos |
| Buscar | =/api/3/action/package_search?q=TERMINO= | Búsqueda por término |
| Ver recurso | =/api/3/action/resource_show?id=ID= | Detalles de un recurso |

**** Ejemplo: listar y buscar conjuntos de datos

#+BEGIN_SRC python
import requests

BASE = "https://datos.gob.mx/api/3/action"

# Listar todos los IDs de conjuntos
r = requests.get(f"{BASE}/package_list")
datasets = r.json().get("result", [])

# Buscar por término
r = requests.get(f"{BASE}/package_search", params={"q": "educación"})
resultados = r.json().get("result", {}).get("results", [])
for d in resultados[:5]:
    print(d["title"], "-", d.get("organization", {}).get("title"))
#+END_SRC

