index.html
<li><a id="org76aabb1"></a>Ejemplo en Python (API Indicadores)<br />
<div class="outline-text-5" id="text-org76aabb1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> requests

<span style="color: #83a598;">TOKEN</span> = <span style="color: #b8bb26;">"TU_TOKEN_AQUI"</span>  <span style="color: #928374;"># </span><span style="color: #928374;">Obtener en inegi.org.mx/app/desarrolladores/registro
</span><span style="color: #928374;"># </span><span style="color: #928374;">Indicador 1002000001 = Poblaci&#243;n total
</span><span style="color: #83a598;">url</span> = <span style="color: #fe8019;">(</span>
<span style="background-color: #3c3836;"> </span>   f<span style="color: #b8bb26;">"https://www.inegi.org.mx/app/api/indicadores/desarrolladores/jsonxml/"</span>
<span style="background-color: #3c3836;"> </span>   f<span style="color: #b8bb26;">"INDICATOR/1002000001/es/00/false/BISE/2.0/</span>{TOKEN}<span style="color: #b8bb26;">?type=json"</span>
<span style="color: #fe8019;">)</span>
<span style="color: #83a598;">response</span> = requests.get<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="color: #83a598;">data</span> = response.json<span style="color: #fe8019;">()</span>
<span style="color: #928374;"># </span><span style="color: #928374;">Estructura: data["Series"][0]["OBSERVATIONS"]
</span><span style="color: #fb4934;">for</span> obs <span style="color: #fb4934;">in</span> data.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Series"</span>, <span style="color: #b16286;">[</span><span style="color: #b8bb26;">{}</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)[</span>0<span style="color: #fe8019;">]</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"OBSERVATIONS"</span>, <span style="color: #b16286;">[]</span><span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>obs<span style="color: #b16286;">[</span><span style="color: #b8bb26;">"TIME_PERIOD"</span><span style="color: #b16286;">]</span>, obs<span style="color: #b16286;">[</span><span style="color: #b8bb26;">"OBS_VALUE"</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org02ff7ee" class="outline-4">
<h4 id="org02ff7ee">API DENUE (Directorio Estadístico Nacional de Unidades Económicas)</h4>
<div class="outline-text-4" id="text-org02ff7ee">
<ul class="org-ul">
<li>URL: <code>https://www.inegi.org.mx/servicios/api_denue.html</code></li>
<li>Busca establecimientos por palabra, actividad económica, ubicación, etc.</li>
<li>Requiere token.</li>
<li>Devuelve JSON con unidades económicas.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org0029602"></a>Ejemplo de consulta DENUE<br />
<div class="outline-text-5" id="text-org0029602">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #83a598;">TOKEN</span> = <span style="color: #b8bb26;">"TU_TOKEN"</span>
<span style="color: #83a598;">busqueda</span> = <span style="color: #b8bb26;">"restaurante"</span>
<span style="color: #83a598;">entidad</span> = <span style="color: #b8bb26;">"19"</span>  <span style="color: #928374;"># </span><span style="color: #928374;">Nuevo Le&#243;n
</span><span style="color: #83a598;">url</span> = f<span style="color: #b8bb26;">"https://www.inegi.org.mx/app/api/denue/v1/consulta/buscar/</span>{busqueda}<span style="color: #b8bb26;">/</span>{entidad}<span style="color: #b8bb26;">/</span>{TOKEN}<span style="color: #b8bb26;">"</span>
<span style="color: #83a598;">response</span> = requests.get<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="color: #83a598;">establecimientos</span> = response.json<span style="color: #fe8019;">()</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9104bbc" class="outline-4">
<h4 id="org9104bbc">Datos Abiertos INEGI</h4>
<div class="outline-text-4" id="text-org9104bbc">
<ul class="org-ul">
<li>URL: <code>https://www.inegi.org.mx/datosabiertos/</code></li>
<li>Archivos en formatos estándar (CSV, Excel, etc.).</li>
<li>Descarga directa sin API; suele usarse para conjuntos grandes.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfa51724" class="outline-4">
<h4 id="orgfa51724">Descarga Masiva INEGI</h4>
<div class="outline-text-4" id="text-orgfa51724">
<ul class="org-ul">
<li>URL: <code>https://www.inegi.org.mx/app/descarga/</code></li>
<li>Permite seleccionar DENUE, Banco de Indicadores, Inventario Nacional de Viviendas,
microdatos y tabulados por área geográfica, tema, período y formato.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb37784c" class="outline-4">
<h4 id="orgb37784c">Librería inegipy (Python)</h4>
<div class="outline-text-4" id="text-orgb37784c">
<pre class="example" id="org0bf5330">
pip install inegipy
</pre>

<p>
Facilita el acceso al Banco de Indicadores, DENUE y Marco Geoestadístico.
Documentación: <code>https://pypi.org/project/inegipy/</code>
</p>
</div>
</div>
</div>
<div id="outline-container-org3ab981f" class="outline-3">
<h3 id="org3ab981f">datos.gob.mx (Plataforma Nacional de Datos Abiertos)</h3>
<div class="outline-text-3" id="text-org3ab981f">
</div>
<div id="outline-container-org84a55c9" class="outline-4">
<h4 id="org84a55c9">Qué es datos.gob.mx</h4>
<div class="outline-text-4" id="text-org84a55c9">
<p>
Plataforma centralizada de <b>datos abiertos</b> del Gobierno de México. Incluye miles de
bases de datos de dependencias federales, estatales y organismos autónomos.
</p>

<ul class="org-ul">
<li>URL: <code>https://datos.gob.mx/</code></li>
<li>Más de 5 000 bases de datos.</li>
<li>Categorías: Economía, Educación, Salud, Cultura, Ciencia y Tecnología, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-org081e874" class="outline-4">
<h4 id="org081e874">API CKAN</h4>
<div class="outline-text-4" id="text-org081e874">
<p>
La plataforma usa <b>CKAN</b>. Su API permite listar conjuntos, buscar y obtener URLs de
descarga de recursos (CSV, Excel, etc.).
</p>
</div>
<ul class="org-ul">
<li><a id="org2f363ec"></a>Endpoints útiles<br />
<div class="outline-text-5" id="text-org2f363ec">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Acción</th>
<th scope="col" class="org-left">URL</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Listar datasets</td>
<td class="org-left"><code>/api/3/action/package_list</code></td>
<td class="org-left">IDs de todos los conjuntos</td>
</tr>

<tr>
<td class="org-left">Ver dataset</td>
<td class="org-left"><code>/api/3/action/package_show?id=ID</code></td>
<td class="org-left">Metadatos y recursos</td>
</tr>

<tr>
<td class="org-left">Buscar</td>
<td class="org-left"><code>/api/3/action/package_search?q=TERMINO</code></td>
<td class="org-left">Búsqueda por término</td>
</tr>

<tr>
<td class="org-left">Ver recurso</td>
<td class="org-left"><code>/api/3/action/resource_show?id=ID</code></td>
<td class="org-left">Detalles de un recurso</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org96616da"></a>Ejemplo: listar y buscar conjuntos de datos<br />
<div class="outline-text-5" id="text-org96616da">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> requests

<span style="color: #83a598;">BASE</span> = <span style="color: #b8bb26;">"https://datos.gob.mx/api/3/action"</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Listar todos los IDs de conjuntos
</span><span style="color: #83a598;">r</span> = requests.get<span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"</span>{BASE}<span style="color: #b8bb26;">/package_list"</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">datasets</span> = r.json<span style="color: #fe8019;">()</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"result"</span>, <span style="color: #b16286;">[]</span><span style="color: #fe8019;">)</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Buscar por t&#233;rmino
</span><span style="color: #83a598;">r</span> = requests.get<span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"</span>{BASE}<span style="color: #b8bb26;">/package_search"</span>, params=<span style="color: #b16286;">{</span><span style="color: #b8bb26;">"q"</span>: <span style="color: #b8bb26;">"educaci&#243;n"</span><span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">resultados</span> = r.json<span style="color: #fe8019;">()</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"result"</span>, <span style="color: #b16286;">{}</span><span style="color: #fe8019;">)</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"results"</span>, <span style="color: #b16286;">[]</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">for</span> d <span style="color: #fb4934;">in</span> resultados<span style="color: #fe8019;">[</span>:5<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>d<span style="color: #b16286;">[</span><span style="color: #b8bb26;">"title"</span><span style="color: #b16286;">]</span>, <span style="color: #b8bb26;">"-"</span>, d.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"organization"</span>, <span style="color: #b8bb26;">{}</span><span style="color: #b16286;">)</span>.get<span style="color: #b16286;">(</span><span style="color: #b8bb26;">"title"</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</li>
