readme.org
**** Ejemplo: obtener URL de descarga de un recurso

#+BEGIN_SRC python
# Supongamos que tenemos el id del dataset (ej. "catalogo-escuelas")
dataset_id = "catalogo-escuelas"
r = requests.get(f"{BASE}/package_show", params={"id": dataset_id})
pkg = r.json().get("result", {})
for res in pkg.get("resources", []):
    if res.get("format", "").upper() == "CSV":
        url_descarga = res["url"]
        print("Descargar CSV:", url_descarga)
        # response = requests.get(url_descarga)
        # with open("datos.csv", "wb") as f:
        #     f.write(response.content)
        break
#+END_SRC

*** Descarga directa de archivos

En la web de datos.gob.mx cada dataset tiene recursos con enlaces de descarga directa.
Se puede usar la API para obtener esas URLs y luego =requests.get()= para descargar.

** Otras fuentes gubernamentales de datos abiertos

*** México

| Fuente             | URL            | Descripción                                  |
|--------------------+----------------+----------------------------------------------|
| INEGI              | inegi.org.mx   | Estadísticas, indicadores, DENUE, geografía  |
| datos.gob.mx       | datos.gob.mx   | Catálogo nacional de datos abiertos          |
| SAT datos abiertos | gob.mx/sat     | Información fiscal y aduanal                 |
| SEPOMEX            | sepomex.gob.mx | Códigos postales (consultar términos de uso) |

*** España

| Fuente       | URL          | Descripción                        |
|--------------+--------------+------------------------------------|
| datos.gob.es | datos.gob.es | Portal de datos abiertos de España |

*** Internacional

| Fuente               | URL                   | Descripción                     |
|----------------------+-----------------------+---------------------------------|
| World Bank Open Data | data.worldbank.org    | Indicadores mundiales           |
| UN Data              | data.un.org           | Estadísticas de Naciones Unidas |
| Eurostat             | ec.europa.eu/eurostat | Estadísticas europeas           |

** Cuándo usar cada método

| Método           | Cuándo usarlo                                        | Ejemplo                                   |
|------------------+------------------------------------------------------+-------------------------------------------|
| API oficial      | Existe y cubre tus necesidades                       | INEGI Indicadores, DENUE                  |
| Descarga directa | Archivos CSV/Excel en el portal                      | datos.gob.mx, INEGI Datos Abiertos        |
| API CKAN         | Listar, buscar, obtener URLs de recursos             | datos.gob.mx                              |
| Scraping         | Solo si no hay API ni descarga y el sitio lo permite | Evitar en gobierno; preferir alternativas |

** Buenas prácticas

1. *Priorizar API y descargas oficiales*: Son legales, estables y están pensadas para uso programático.
2. *Revisar términos de uso y licencias*: Aunque sean datos abiertos, pueden haber condiciones.
3. *Identificarse*: Usar un User-Agent razonable si haces peticiones HTTP.
4. *No saturar servidores*: Respetar rate limits; hacer pausas entre peticiones masivas.
5. *Atribuir la fuente*: Citar INEGI, datos.gob.mx, etc., al publicar o reutilizar datos.
6. *Protección de datos*: Evitar extraer o combinar datos que permitan identificar personas sin base legal.

