index.html
<li><a id="org9343d63"></a>Ejemplo: obtener URL de descarga de un recurso<br />
<div class="outline-text-5" id="text-org9343d63">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #928374;"># </span><span style="color: #928374;">Supongamos que tenemos el id del dataset (ej. "catalogo-escuelas")
</span><span style="color: #83a598;">dataset_id</span> = <span style="color: #b8bb26;">"catalogo-escuelas"</span>
<span style="color: #83a598;">r</span> = requests.get<span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"</span>{BASE}<span style="color: #b8bb26;">/package_show"</span>, params=<span style="color: #b16286;">{</span><span style="color: #b8bb26;">"id"</span>: dataset_id<span style="color: #b16286;">}</span><span style="color: #fe8019;">)</span>
<span style="color: #83a598;">pkg</span> = r.json<span style="color: #fe8019;">()</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"result"</span>, <span style="color: #b16286;">{}</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">for</span> res <span style="color: #fb4934;">in</span> pkg.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"resources"</span>, <span style="color: #b16286;">[]</span><span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> res.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"format"</span>, <span style="color: #b8bb26;">""</span><span style="color: #fe8019;">)</span>.upper<span style="color: #fe8019;">()</span> == <span style="color: #b8bb26;">"CSV"</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">url_descarga</span> = res<span style="color: #fe8019;">[</span><span style="color: #b8bb26;">"url"</span><span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Descargar CSV:"</span>, url_descarga<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #928374;"># </span><span style="color: #928374;">response = requests.get(url_descarga)
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #928374;"># </span><span style="color: #928374;">with open("datos.csv", "wb") as f:
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #928374;">#     </span><span style="color: #928374;">f.write(response.content)
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">break</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8adee69" class="outline-4">
<h4 id="org8adee69">Descarga directa de archivos</h4>
<div class="outline-text-4" id="text-org8adee69">
<p>
En la web de datos.gob.mx cada dataset tiene recursos con enlaces de descarga directa.
Se puede usar la API para obtener esas URLs y luego <code>requests.get()</code> para descargar.
</p>
</div>
</div>
</div>
<div id="outline-container-org9ae1722" class="outline-3">
<h3 id="org9ae1722">Otras fuentes gubernamentales de datos abiertos</h3>
<div class="outline-text-3" id="text-org9ae1722">
</div>
<div id="outline-container-orgc047019" class="outline-4">
<h4 id="orgc047019">México</h4>
<div class="outline-text-4" id="text-orgc047019">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Fuente</th>
<th scope="col" class="org-left">URL</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">INEGI</td>
<td class="org-left">inegi.org.mx</td>
<td class="org-left">Estadísticas, indicadores, DENUE, geografía</td>
</tr>

<tr>
<td class="org-left">datos.gob.mx</td>
<td class="org-left">datos.gob.mx</td>
<td class="org-left">Catálogo nacional de datos abiertos</td>
</tr>

<tr>
<td class="org-left">SAT datos abiertos</td>
<td class="org-left">gob.mx/sat</td>
<td class="org-left">Información fiscal y aduanal</td>
</tr>

<tr>
<td class="org-left">SEPOMEX</td>
<td class="org-left">sepomex.gob.mx</td>
<td class="org-left">Códigos postales (consultar términos de uso)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org126e121" class="outline-4">
<h4 id="org126e121">España</h4>
<div class="outline-text-4" id="text-org126e121">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Fuente</th>
<th scope="col" class="org-left">URL</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">datos.gob.es</td>
<td class="org-left">datos.gob.es</td>
<td class="org-left">Portal de datos abiertos de España</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org293bcf0" class="outline-4">
<h4 id="org293bcf0">Internacional</h4>
<div class="outline-text-4" id="text-org293bcf0">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Fuente</th>
<th scope="col" class="org-left">URL</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">World Bank Open Data</td>
<td class="org-left">data.worldbank.org</td>
<td class="org-left">Indicadores mundiales</td>
</tr>

<tr>
<td class="org-left">UN Data</td>
<td class="org-left">data.un.org</td>
<td class="org-left">Estadísticas de Naciones Unidas</td>
</tr>

<tr>
<td class="org-left">Eurostat</td>
<td class="org-left">ec.europa.eu/eurostat</td>
<td class="org-left">Estadísticas europeas</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgccbf71a" class="outline-3">
<h3 id="orgccbf71a">Cuándo usar cada método</h3>
<div class="outline-text-3" id="text-orgccbf71a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Método</th>
<th scope="col" class="org-left">Cuándo usarlo</th>
<th scope="col" class="org-left">Ejemplo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">API oficial</td>
<td class="org-left">Existe y cubre tus necesidades</td>
<td class="org-left">INEGI Indicadores, DENUE</td>
</tr>

<tr>
<td class="org-left">Descarga directa</td>
<td class="org-left">Archivos CSV/Excel en el portal</td>
<td class="org-left">datos.gob.mx, INEGI Datos Abiertos</td>
</tr>

<tr>
<td class="org-left">API CKAN</td>
<td class="org-left">Listar, buscar, obtener URLs de recursos</td>
<td class="org-left">datos.gob.mx</td>
</tr>

<tr>
<td class="org-left">Scraping</td>
<td class="org-left">Solo si no hay API ni descarga y el sitio lo permite</td>
<td class="org-left">Evitar en gobierno; preferir alternativas</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9e5ee69" class="outline-3">
<h3 id="org9e5ee69">Buenas prácticas</h3>
<div class="outline-text-3" id="text-org9e5ee69">
<ol class="org-ol">
<li><b>Priorizar API y descargas oficiales</b>: Son legales, estables y están pensadas para uso programático.</li>
<li><b>Revisar términos de uso y licencias</b>: Aunque sean datos abiertos, pueden haber condiciones.</li>
<li><b>Identificarse</b>: Usar un User-Agent razonable si haces peticiones HTTP.</li>
<li><b>No saturar servidores</b>: Respetar rate limits; hacer pausas entre peticiones masivas.</li>
<li><b>Atribuir la fuente</b>: Citar INEGI, datos.gob.mx, etc., al publicar o reutilizar datos.</li>
<li><b>Protección de datos</b>: Evitar extraer o combinar datos que permitan identificar personas sin base legal.</li>
</ol>
</div>
</div>
