readme.org
** Ejemplo completo: indicador INEGI + guardar CSV

#+BEGIN_SRC python
import requests
import csv

TOKEN = "TU_TOKEN"
# INPC - Índice Nacional de Precios al Consumidor (ejemplo)
indicador = "628193"  # Ajustar al indicador deseado
url = (
    f"https://www.inegi.org.mx/app/api/indicadores/desarrolladores/jsonxml/"
    f"INDICATOR/{indicador}/es/00/false/BISE/2.0/{TOKEN}?type=json"
)
r = requests.get(url)
data = r.json()

observaciones = data.get("Series", [{}])[0].get("OBSERVATIONS", [])
with open("indicador_inegi.csv", "w", newline="", encoding="utf-8") as f:
    w = csv.writer(f)
    w.writerow(["periodo", "valor"])
    for obs in observaciones:
        w.writerow([obs["TIME_PERIOD"], obs["OBS_VALUE"]])
print(f"Guardados {len(observaciones)} registros")
#+END_SRC

** Resumen de enlaces

- INEGI API Indicadores: ~https://www.inegi.org.mx/servicios/api_indicadores.html~
- INEGI API DENUE: ~https://www.inegi.org.mx/servicios/api_denue.html~
- INEGI Datos Abiertos: ~https://www.inegi.org.mx/datosabiertos/~
- INEGI Descarga Masiva: ~https://www.inegi.org.mx/app/descarga/~
- Registro token INEGI: ~https://www.inegi.org.mx/app/desarrolladores/registro/default.html~
- datos.gob.mx: ~https://datos.gob.mx/~
- Constructor de Consultas INEGI: ~https://www.inegi.org.mx/app/querybuilder/~

** Dependencias

#+BEGIN_EXAMPLE
pip install requests inegipy
#+END_EXAMPLE
