index.html
<div id="outline-container-orgb776d30" class="outline-3">
<h3 id="orgb776d30">Ejemplo completo: indicador INEGI + guardar CSV</h3>
<div class="outline-text-3" id="text-orgb776d30">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> requests
<span style="color: #fb4934;">import</span> csv

<span style="color: #83a598;">TOKEN</span> = <span style="color: #b8bb26;">"TU_TOKEN"</span>
<span style="color: #928374;"># </span><span style="color: #928374;">INPC - &#205;ndice Nacional de Precios al Consumidor (ejemplo)
</span><span style="color: #83a598;">indicador</span> = <span style="color: #b8bb26;">"628193"</span>  <span style="color: #928374;"># </span><span style="color: #928374;">Ajustar al indicador deseado
</span><span style="color: #83a598;">url</span> = <span style="color: #fe8019;">(</span>
<span style="background-color: #3c3836;"> </span>   f<span style="color: #b8bb26;">"https://www.inegi.org.mx/app/api/indicadores/desarrolladores/jsonxml/"</span>
<span style="background-color: #3c3836;"> </span>   f<span style="color: #b8bb26;">"INDICATOR/</span>{indicador}<span style="color: #b8bb26;">/es/00/false/BISE/2.0/</span>{TOKEN}<span style="color: #b8bb26;">?type=json"</span>
<span style="color: #fe8019;">)</span>
<span style="color: #83a598;">r</span> = requests.get<span style="color: #fe8019;">(</span>url<span style="color: #fe8019;">)</span>
<span style="color: #83a598;">data</span> = r.json<span style="color: #fe8019;">()</span>

<span style="color: #83a598;">observaciones</span> = data.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"Series"</span>, <span style="color: #b16286;">[</span><span style="color: #b8bb26;">{}</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)[</span>0<span style="color: #fe8019;">]</span>.get<span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"OBSERVATIONS"</span>, <span style="color: #b16286;">[]</span><span style="color: #fe8019;">)</span>
<span style="color: #fb4934;">with</span> <span style="color: #fe8019;">open</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"indicador_inegi.csv"</span>, <span style="color: #b8bb26;">"w"</span>, newline=<span style="color: #b8bb26;">""</span>, encoding=<span style="color: #b8bb26;">"utf-8"</span><span style="color: #fe8019;">)</span> <span style="color: #fb4934;">as</span> f:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">w</span> = csv.writer<span style="color: #fe8019;">(</span>f<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   w.writerow<span style="color: #fe8019;">(</span><span style="color: #b16286;">[</span><span style="color: #b8bb26;">"periodo"</span>, <span style="color: #b8bb26;">"valor"</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> obs <span style="color: #fb4934;">in</span> observaciones:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   w.writerow<span style="color: #fe8019;">(</span><span style="color: #b16286;">[</span>obs<span style="color: #b8bb26;">[</span><span style="color: #b8bb26;">"TIME_PERIOD"</span><span style="color: #b8bb26;">]</span>, obs<span style="color: #b8bb26;">[</span><span style="color: #b8bb26;">"OBS_VALUE"</span><span style="color: #b8bb26;">]</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"Guardados </span>{<span style="color: #fe8019;">len</span>(observaciones)}<span style="color: #b8bb26;"> registros"</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaf43fe7" class="outline-3">
<h3 id="orgaf43fe7">Resumen de enlaces</h3>
<div class="outline-text-3" id="text-orgaf43fe7">
<ul class="org-ul">
<li>INEGI API Indicadores: <code>https://www.inegi.org.mx/servicios/api_indicadores.html</code></li>
<li>INEGI API DENUE: <code>https://www.inegi.org.mx/servicios/api_denue.html</code></li>
<li>INEGI Datos Abiertos: <code>https://www.inegi.org.mx/datosabiertos/</code></li>
<li>INEGI Descarga Masiva: <code>https://www.inegi.org.mx/app/descarga/</code></li>
<li>Registro token INEGI: <code>https://www.inegi.org.mx/app/desarrolladores/registro/default.html</code></li>
<li>datos.gob.mx: <code>https://datos.gob.mx/</code></li>
<li>Constructor de Consultas INEGI: <code>https://www.inegi.org.mx/app/querybuilder/</code></li>
</ul>
</div>
</div>
<div id="outline-container-orga202019" class="outline-3">
<h3 id="orga202019">Dependencias</h3>
<div class="outline-text-3" id="text-orga202019">
<pre class="example" id="orgf06f538">
pip install requests inegipy
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Eduardo Alcaraz</p>
<p class="date">Created: 2026-02-16 lun 08:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
